[
    {
        "title": "Dataset selection",
        "link": "https://gnomad.broadinstitute.org/help/dataset-selection",
        "text": "The data selection drop-down specifies which dataset is displayed on the page. It also updates accompanying data such as the coverage plot, constraint statistics, regional constraint, and variant positional distribution plot, when available.\nIn the past, the gnomAD browser has supported disease-specific subsets (e.g. non-cancer). However,\nwe have decided to no longer create these subsets in v4 and will begin to phase out support for all subsets in the browser in 2024\n. We made the decision to remove support for subsets from the gnomAD v4 exomes for two reasons: sample metadata and sample size. While we are provided high level study phenotype and case/control status for some samples,\nwe do not have comprehensive phenotype metadata for gnomAD samples\n, and many samples are now derived from large biobanks, which can include individuals with disease. As such, we cannot ensure that samples in a non-disease subset do not have the specified disease. Additionally, as the dataset has grown, concerns about enrichment of any particular phenotype decreases. And finally, we continue to remove cohorts recruited for severe pediatric disease and have also removed the TCGA cancer samples due to data quality. For a more detailed understanding of the cohorts included in gnomAD, please see the “Study Diseases in gnomAD” table\non our stats page\n. In summary, we encourage our users to check frequencies across the full dataset to fully leverage the scale and power of gnomAD data.\nNote that gnomAD v4.0 has a single subset (non-UK Biobank), but frequencies for this subset are not displayed on the browser and are only available in our downloadable files.\nThe following subsets from previous versions are currently available, but access to these subsets will change in 2024. Those subsets that will be continued to be supported in the browser and available on our downloads page are indicated in bold, those that will be moved to download only in early 2024 are in italics.\nShort variants\ngnomAD v4.0\ngnomAD v4.0\ngnomAD v4.0 (non-UK Biobank): Only samples that are not present in the UKBB 455,000 exome release. The allele counts in this subset can thus be added to those of UKBB to enable federated use of both datasets. (\nDownload only\n)\ngnomAD v3.1.2\ngnomAD v3.1.2\ngnomAD v3.1.2 (non-cancer): Only samples from individuals who were not ascertained for having cancer in a cancer study.\ngnomAD v3.1.2 (non-neuro): Only samples that were not collected as part of a neurologic or psychiatric case/control study, or samples collected as part of a neurologic or psychiatric case/control study but designated as controls.\ngnomAD v3.1.2 (non-v2): Only samples that are new to the v3 or v3.1 release and not included in gnomAD v2.\ngnomAD v3.1.2 (non-TOPMed): Only samples that are not present in the Trans-Omics for Precision Medicine (TOPMed)/BRAVO release. The allele counts in this subset can thus be added to those of BRAVO to enable federated use of both datasets.\ngnomAD v3.1.2 (controls/biobanks): Only samples collected specifically as controls for disease studies, or samples belonging to biobanks (e.g. BioMe, Genizon) or general population studies (e.g., 1000 Genomes, HGDP, PAGE).\ngnomAD v2.1.1\ngnomAD v2.1.1\ngnomAD v2.1.1 (non-TOPMed): Only samples that are not present in the Trans-Omics for Precision Medicine (TOPMed)/BRAVO release. The allele counts in this subset can thus be added to those of BRAVO to federate both datasets.\ngnomAD v2.1.1 (non-cancer): Only samples from individuals who were not ascertained for having cancer in a cancer study.\ngnomAD v2.1.1 (non-neuro): Only samples from individuals who were not ascertained for having a neurological condition in a neurological case/control study.\ngnomAD v2.1.1 (controls): Only samples from individuals who were not selected as a case in a case/control study of common disease.\nExAC\nExAC v1.0\nStructural variants\nv4\ngnomAD genome SVs v4.0\n: Structural variant (SV) calls generated from a set of GS samples that largely overlaps those in gnomAD v4. This current SV release includes 63,046 unrelated genomes. See the\ngnomAD-SV blog post\nfor details.\ngnomAD genome SVs v4.0 (non-neuro): Only samples from individuals who were not ascertained for having a neurological condition in a neurological case/control study. (\nDownload only\n)\ngnomAD genome SVs v4.0 (controls): Only samples from individuals who were not selected as a case in a case/control study of common disease. (\nDownload only\n)\ngnomAD exome CNVs v4.0\n: Copy number variant (CNV) calls generated from a set of ES samples that largely overlaps those in gnomAD v4. This current CNV release includes 464,297 unrelated exomes.\ngnomAD exome CNVs v4.0 (non-neuro): Only samples from individuals who were not ascertained for having a neurological condition in a neurological case/control study. (\nDownload only\n)\ngnomAD exome CNVs v4.0 (controls): Only samples from individuals who were not selected as a case in a case/control study of common disease. (\nDownload only\n)\ngnomAD SVs v2.1 (controls): Only samples from individuals who were not selected as a case in a case/control study of common disease.\nv2\ngnomAD SVs v2.1: Structural variant (SV) calls generated from a set of GS samples that largely overlaps those in gnomAD v2.1. This current SV release includes 10,847 unrelated genomes. See the\ngnomAD-SV paper\nfor details.\ngnomAD SVs v2.1 (non-neuro): Only samples from individuals who were not ascertained for having a neurological condition in a neurological case/control study.\ngnomAD SVs v2.1 (controls): Only samples from individuals who were not selected as a case in a case/control study of common disease.\nThe data selection drop-down also updates accompanying data such as the coverage plot, constraint statistics, regional constraint, and variant positional distribution plot."
    },
    {
        "title": "Variant QC",
        "link": "https://gnomad.broadinstitute.org/help/variant-qc",
        "text": "gnomAD v4.0 exomes\nSee our\n4.0 release blog post\nfor more details about the variant QC process.\ngnomAD v4.0 genomes (previously v3.1)\nSee our\n3.1 release blog post\nfor more details about the variant QC process. Variants from the genomes in v3.1 were brought directly into v4 and are now labeled v4 genomes.\nExpand to see details for past versions\ngnomAD v3.0\nFor gnomAD v3.0, we computed all our variant QC metrics within Hail and because our new sparse format contains all the GVCFs information, we computed them for each allele separately. We then used the\nallele-specific version of GATK Variant Quality Score Recalibration (VQSR)\nto compute a confidence score for each allele in our data to be real or artifactual. We used the following features:\nSNPs:\nFS\n,\nSOR\n,\nReadPosRankSum\n,\nMQRankSum\n,\nQD\n,\nDP\n,\nMQ\nindels:\nFS\n,\nSOR\n,\nReadPosRankSum\n,\nMQRankSum\n,\nQD\n,\nDP\nOn top of the GATK bundle training resources (hapmap, omni, 1000 genomes, mills indels), we also used 10M transmitted singletons (alleles observed exactly twice confidently in a parent and a child) from 6,044 trios present in our raw data.\nWe assessed the results of the filtering by looking at the same quality metrics we used for the gnomAD v2 callset:\nde novo\nlooking mutations in our 6,044 trios, Ti/Tv ratio, proportion singletons, proportion bi-allelic variants, variants in  ClinVar and precision and recall in two truth samples present in our data:\nNA12878\nand a\npseudo-diploid sample\n( A mixture of DNA (est. 50.7% / 49.3%) from two haploid CHM cell lines) for which we have good truth data.\nIn addition to VQSR, we also  applied the following hard filters:\nAC0\n: No sample had a high quality genotype at this variant site (GQ>=20, DP>=10 and allele balance >  0.2 for heterozygotes)\nInbreedingCoeff\n: there was an excess of heterozygotes at the site compared to Hardy-Weinberg expectations using a threshold of -0.3 on the InbreedingCoefficient metric.\nIn total, 12.7% of SNVs and 34.2% of indels were filtered, leaving  526,001,545 SNVs and 69,168,024 indels that passed all filters in our release.\ngnomAD v2.1\nFor gnomAD v2.1 variants QC, we used all sites present in the 141,456 release samples as well as sites present in family members forming trios (717 trios in genomes, 6,029 trios in exomes) that passed all of the sample QC filters. Including these trios allowed us to look at transmission and Mendelian violations for evaluation purposes. Variant QC was performed on the exomes and genomes separately but using the same pipeline (although different thresholds were used).\nWe used a random forests (RF) model using allele-specific annotations as our main tool for variant quality control. This updated model is described below and performs markedly better than both VQSR and our previous RF model (used on gnomAD v2.0.2) on all the evaluation metrics we used. In addition to our RF filter, we also excluded all sites failing the following two hard filters:\nInbreedingCoeff\n: Excess heterozygotes defined by an inbreeding coefficient < -0.3\nAC0\n: No sample had a high quality genotype (depth >= 10, genotype quality >= 20 and minor allele balance > 0.2 for heterozygous genotypes)\nFinally, for this release we have moved the information about sites falling in low complexity (‘lcr’), decoy (\ndecoy\n) and segmental duplication (\nsegdup\n) regions to the\nINFO\nfield. This means that the information is still easily available in the VCF but variants in these regions that pass other filters will have a\nPASS\nvalue in the\nFILTER\ncolumn. In the browser,\nlcr\n,\ndecoy\nand\nsegdup\nare displayed in the\nFlags\ncolumn.\nRandom forests model\nWe used a random forests (RF) model developed with Hail and pyspark. Our model was applied to exomes and genomes separately. Our model considered each allele separately and emitted a prediction for each allele. We used a combination of features output by the GATK Haplotype Caller and features that we computed from the genotypes directly. In particular, we introduced the following two allele-specific features:\nqd\n: This metric is inspired by the GATK quality / depth (\nQD\n) metric, but is computed per-allele, only on the carriers of that allele. So for each allele,\nqd\nis computed as the sum of the non-reference genotype likelihoods divided by the sum of the depth in all carrier of that allele.\npab_max\n: This metric is the highest p-value for sampling the observed allele balance under a binomial model. Because we take the highest value, we effectively consider the \"best looking\" sample in terms of allele-balance.\nRandom forests features\nFeature\nDescription\nAllele / site specific\nGenomes feature importance\nExomes feature importance\nAllele type\nSNV, Indel, complex\nAllele\n0.0012\n0.00027\nqd\nAllelic quality / depth\nAllele\n0.470\n0.62\npax_max\nMax. p-value of binomial test for allele balance\nAllele\n0.106\n0.065\nvariant_type\nSNV, multi-allelic SNV, indel, multi-allelic indel, mixed\nSite\n0.0065\n0.0054\nwas_mixed\nWhether there were both SNVs and indels at the site\nSite\n0.0056\n0.00048\nn_alt_alleles\nNumber of non-reference alleles\nSite\n0.0060\n0.0061\nhas_star\nWhether there is a spanning deletion that overlaps the site\nSite\n0.0115\n0.0023\nInbreedingCoeff\nInbreeding Coefficient\nSite*\n0.042\n0.123\nMQRankSum\nZ-score from Wilcoxon rank sum test of Alt vs. Ref read mapping qualities\nSite*\n0.031\n0.019\nReadPosRankSum\nZ-score from Wilcoxon rank sum test of Alt vs. Ref read position bias\nSite*\n0.060\n0.061\nSOR\nSymmetric Odds Ratio of 2×2 contingency table to detect strand bias\nSite*\n0.266\n0.10\n*: These features should ideally be computed for each allele separately but they were generated for each site in our callset and it was impractical to re-generate them for each allele.\nNote that since random forests don't tolerate missing data, we have naively imputed all missing values using the median value for that feature.\nRandom forest training examples\nOur strategy for selecting training sites was the same as for gnomAD v2.0.2; however, because we had an increase in our number of trios, we had more positive transmitted singletons alleles than previously. The table below summarizes our training examples.\nName\nDescription\nClass\nNumber of alleles in genomes\nNumber of alleles in exomes\nomni\nSNVs present on the Omni 2.5 genotyping array and found in 1000 genomes (available in the GATK bundle)\nTP\n2.3Mln\n95k\nmills\nIndels present in the Mills and Devine data (available in the GATK bundle)\nTP\n1.3Mln\n12k\n1000 Genomes high-quality sites\nSites discovered in 1000 Genomes with high confidence (available in the GATK bundle)\nTP\n29Mln\n560k\ntransmitted_singletons\nvariants found in two and only two individuals, which were a parent-offspring pair\nTP\n116k\n106k\nfail_hard_filters\nvariants failing traditional GATK hard filters: QD < 2 || FS > 60 || MQ < 30\nFP\n31Mln\n789k\nNote that for training the model, we used a balanced training set by randomly downsampling the class that had more training examples to match the number of training examples in the other class.\nRandom forests filtering thresholds\nIn order to set a threshold for the PASS / RF filter in the release, we have used a slightly different set of evaluation metrics. The reason being that some of the classical metrics such as transition/transversion ratio and insertion:deletion ratio are very difficult to interpret in large callsets. On the other hand, we have additional data and resources that can serve as useful proxy for callset quality, such as large number of trios, validated variants (e.g. validated\nde novo\nmutations in our exomes) or public databases such as ClinVar. We used the following metrics to determine a cutoff on the random forests model output, to build what we believed to be a high quality set of variants:\nPrecision / recall against two well characterized samples:\nNA12878 from\ngenome in a bottle\nCHM1\nCHM13: A mixture of DNA (est. 50.7% / 49.3%) from two haploid CHM cell lines, deep sequenced with PacBio and _de novo\nassembled, available\nhere\n. Note that indels of size 1 were removed because of PacBio-specific problems.\nNumber of singleton Mendelian violations in our evaluation trios (N=1 amongst all samples and is found in a child)\nSingleton transmission ratio in trios\nSensitivity to validated\nde novo\nmutations (exomes only)\nSensitivity to singleton ClinVar variants\nFor exomes, our filtration process removes 12.2% of SNVs (RF probability >= 0.1) and 24.7% of indels (RF probability >= 0.2). For genomes, we filtered 10.7% of SNVs (RF probability >= 0.4) and 22.3% of indels (RF probability >= 0.4)."
    },
    {
        "title": "Genetic Ancestry in gnomAD",
        "link": "https://gnomad.broadinstitute.org/help/ancestry",
        "text": "See our\nblog post\non genetic ancestry for more details on our process and additional commentary on the benefits and limitations of using genetically-derived ancestry.\nIn gnomAD we provide the following genetic ancestry groups: African/African American (\nafr\n), Amish (\nami\n), Admixed American (\namr\n), Ashkenazi Jewish (\nasj\n), East Asian (\neas\n), Finnish (\nfin\n), Non-Finnish European (\nnfe\n) and South Asian (\nsas\n). Individuals were classified as \"remaining individuals\" (\nrmi\n) if they did not unambiguously cluster with these groups in a principal component analysis (PCA).\nGenetic ancestry identification\nUsing the\nhwe_normalized_pca\nfunction in Hail\nwe computed the 20 first principal components (PCs) on well-behaved bi-allelic autosomal QC SNVs on all unrelated samples. For each release, PCA is run on the entire dataset at once, excluding first and second degree relatives. We then train a random forest classifier on samples with provided ancestry labels using the PCs as features. Samples with the following probability of group assignments were assigned to the relevant labels:\nAFR\n: 0.93\nAMR\n: 0.86\nASJ\n: 0.88\nEAS\n: 0.96\nFIN\n: 0.91\nMID\n: 0.56\nNFE\n: 0.78\nSAS\n: 0.96\nAny samples that we were unable to cluster using these probabilities were grouped into \"Remaining individuals\". Genetic ancestry sub-group clustering has not been performed for gnomAD v4 at this time.\ngnomAD v4.0 genomes (previously v3.1)\nTo select the variants for PCA (\nhwe_normalized_pca\nfunction in Hail\n) from the gnomAD v3.1 dataset, which were inrocporated into gnomAD v4, we lifted-over the high-quality variants used for gnomAD v2, as well as a set of 5k variants widely used for quality control of GWAS data\ndefined by Shaun Purcell\n. We then took these variants and applied our quality threshold, leading to 76,215 high quality variants for PCA.\nWe then trained a random forest classifier using 17,906 samples with known ancestry in gnomAD v3 and 14,949 samples for which we had a genetic ancestry group label from gnomAD v2. Many of the additional genomes in v3.1 have ancestry information, increasing the total ancestry labels used for training to 36,882. We used 16 PCs as features and assigned ancestry to all samples for which the probability of that ancestry was > 75% according to the random forest model.\nExpand to see details for past versions\ngnomAD v2\nFor gnomAD v2, we used 94,176 training sites that were shared by exomes and genomes and passed our high quality thresholds for PCA. The random forest model was trained using a set of 52,768 samples for which we knew the genetic ancestry. Because there were only 31 South Asian (\nsas\n) samples among the genomes, we manually assigned these to other (\noth\n) genetic ancestry as well, due to their low number.\nGenetic ancestry sub-group assignment (gnomAD v2 only)\nGenetic ancestry sub-groups were computed for European and East Asian samples using PCA. The reason for computing for these two genetic ancestry groups only was (1) the presence of reliable labels of known sub-population for large enough samples of the data, and (2) the resulting PCA was convincingly splitting the data into separate clusters that matched our known labels. The following steps were taken for the non-Finnish European and East Asian samples separately:\nHigh-quality sites (same used for relatedness) were extracted for all samples of that genetic ancestry group.\nSites were further filtered to exclude\nSites where the allele frequency in that group was < 0.1%\nSites where any platform had > 0.1% missingness (or more than 1 missing sample if there were less than 1,000 samples for a given platform)\nRemaining sites were LD-pruned in that population down to r\n2\n= 0.1\nPCs were computed using\nhwe_normalized_pca\nin Hail\n.\nA random forest (RF) model was created using:\nEuropean samples: 3 first PCs as features and known genetic ancestry sub-group labels for 17,102 samples\nEast Asian samples: first 2 PCs as features and known sub-continental population labels for 2,067 samples.\nAll samples with a random forest prediction probability > 90% according to the random forest were assigned a genetic ancestry sub-group. Other samples were labeled with the other non-Finnish European (\nonf\n) or other East Asian (\noea\n) ancestry depending on their genetic ancestry group label.\nFor gnomAD v2, we also provide genetic ancestry sub-groups sub-continental information for the East Asian (Koreans (\nkor\n) and Japanese (\njpn\n)) and Non-Finnish European (Bulgarian (\nbgr\n), Estonian (\nest\n), North-Western European (\nnwe\n), Southern European (\nseu\n) and Swedish (\nswe\n)) populations."
    },
    {
        "title": "Relatedness filtering",
        "link": "https://gnomad.broadinstitute.org/help/relatedness-filtering",
        "text": "Relatedness filtering for the v4 release was done using\ncuKING\n. Relatedness was computed amongst all samples that passed our hard filters (both exomes and genomes in gnomAD v4) together. We used 1.1 million autosomal SNVs with an allele frequency > 0.01% and a call rate of > 95% in the combined gnomAD v3.1.2 and CCDG genome data, a call rate > 99% in both CCDG and UKBB exome data and LD-pruned with a cutoff of r\n2\n= 0.1 for inferring relatedness.\nAfter running\ncuKING\n, we used the\nmaximal_independent_set\nmethod in Hail\nto get the largest set of samples with no pair of samples related at the 2nd degree or closer. When we had to select a sample amongst multiple possibilities, we used the same scheme to favor a sample over another:\nGenomes had priority over exomes in gnomAD v4.0\nWithin genomes\nPCR free had priority over PCR+\nIn a parent/child pair, the parent was kept\nTies broken by the sample with highest mean coverage\nWithin exomes\nIn a parent/child pair, the parent was kept\nTies broken by the sample with the higher mean coverage on chromosome 20"
    },
    {
        "title": "Annotations in gnomAD",
        "link": "https://gnomad.broadinstitute.org/help/vep",
        "text": "gnomAD v4.0\nVEP\nVariants in the browser (and all current VCFs available for download) were annotated using VEP version 105 using GENCODE v39 on GRCh38, with the\nLOFTEE\n(Loss-Of-Function Transcript Effect Estimator) plugin.\nLOFTEE\nLOFTEE considers all stop-gained, splice-disrupting, and frameshift variants, and filters out many known false-positive modes, such as variants near the end of transcripts and in non-canonical splice sites, as described in the\ncode documentation\n. These variants are flagged on the gene page with \"LC pLoF\" and on the variant page in the Annotations section: however, as these annotations are transcript specific, you may need to click on the \"Transcripts\" box in order to observe the annotation for each particular transcript.\nLCR and SEGDUP flags\ngnomAD v4\nVariants have been flagged according to whether they fall into low-complexity regions (LCRs) or segmental duplication (SEGDUP) regions.\nThese\nregions\nwere identified with the\nsymmetric DUST algorithm\non GRCh38 at a score threshold of 30.\nThe segmental duplication regions we used are from the Global Alliance for Genomics and Health (GA4GH) Benchmarking Team and the Genome in a Bottle Consortium. Information on the source of these files can be found in\nGA4GH's benchmarking-tools GitHub repository\n.\nExpand to see details for past versions\nVEP\ngnomAD v3.1\nVariants in the browser (and all current VCFs available for download) were annotated using VEP version 101 using GENCODE v35 on GRCh38, with the\nLOFTEE\n(Loss-Of-Function Transcript Effect Estimator) plugin.\ngnomAD v3.0\nVariants in the browser (and all current VCFs available for download) were annotated using VEP version 95 using GENCODE v29 on GRCh38, with the\nLOFTEE\n(Loss-Of-Function Transcript Effect Estimator) plugin.\ngnomAD v2\nVariants in the browser (and all current VCFs available for download) were annotated using VEP version 85 using GENCODE v19 on GRCh37, with the\nLOFTEE\n(Loss-Of-Function Transcript Effect Estimator) plugin.\nMNVs (gnomAD v2 only)\nMulti-nucleotide variants (MNVs) were identified using\nHail's window_by_locus\nfunction. We exhaustively looked for variants that appear in the same individual, in the same haplotype, and within 2 bp distance for the exome dataset and 10 bp distance for the genome dataset. More information can be found in\n\"Landscape of multi-nucleotide variants in 125,748 human exomes and 15,708 genomes\"\n.\nLCR, SEGDUP and DECOY flags\ngnomAD v3\nVariants have been flagged according to whether they fall into low-complexity regions (LCRs).\nThese\nregions\nwere identified\nwith the\nsymmetric DUST algorithm\non GRCh38 at a score threshold of 30.\ngnomAD v2\nVariants have been flagged according to whether they fall into low-complexity regions (LCRs) or segmental duplication (SEGDUP) regions.\nLow-complexity regions\nwere identified with the\nsymmetric DUST algorithm\non GRCh37 at a score threshold of 30.\nThe\nsegmental duplication\nand\ndecoy\nregions we used are from\nthe Global Alliance for Genomics and Health (GA4GH) Benchmarking Team and the Genome in a Bottle Consortium. Information on the source of these files can be found in\nGA4GH's benchmarking-tools GitHub repository\n."
    },
    {
        "title": "Filtering allele frequency",
        "link": "https://gnomad.broadinstitute.org/help/faf",
        "text": "This annotation can be used for filtering variants by allele frequency against a disease-specific threshold that can be set for each disease (e.g. BA1 in the 2015 ACMG/AMP guidelines). In this case the filtering allele frequency (FAF) is the maximum credible genetic ancestry group AF (e.g. the lower bound of the 95% confidence interval (CI)). If the FAF is above the disease-specific threshold, then the observed AC is not compatible with pathogenicity. See\nhttp://cardiodb.org/allelefrequencyapp/\nand\nWhiffin\net al.\n2017\nfor additional information.\nNote that the GroupMax FAF contains filtering allele frequency information from the genetic ancestry group with the highest\nFAF\n, not the filtering allele frequency information calculated on the genetic ancestry group with the highest\nAF\n.\nThe filtering allele frequency calculation only includes non-bottlenecked genetic ancestry groups: we did not calculate this metric on the Amish (\nami\n), Ashkenazi Jewish (\nasj\n), European Finnish (\nfin\n), Middle Eastern (\nmid\n), and \"Remaining Individuals\" (\nrmi\n) groups.\nOn the browser, the\nGroupMax FAF\nannotation is directly available on the variant page. In the VCF and Hail Tables, the filtering allele frequency annotation (abbreviated \"\nfaf\n\") is computed globally and for each genetic ancestry group. Filtering allele frequencies (FAFs) for each genetic ancestry group are listed separately with 95% and 99% CIs."
    },
    {
        "title": "Group maximum allele frequency",
        "link": "https://gnomad.broadinstitute.org/help/grpmax",
        "text": "This annotation (abbreviated \"\ngrpmax\n\") contains allele frequency information (AC, AN, AF, homozygote count) for the non-bottlenecked genetic ancestry groups with the highest\nAF\n. Note that\ngrpmax\nis distinct from filtering allele frequency.\nFor gnomAD v4, this calculation excludes Amish (\nami\n), Ashkenazi Jewish (\nasj\n), European Finnish (\nfin\n), Middle Eastern (\nmid\n), and \"Remaining Individuals\" (\nrmi\n) groups. For gnomAD v2, this calculation excludes Ashkenazi Jewish (\nasj\n), European Finnish (\nfin\n), and \"Remaining Individuals\" (\nrmi\n) groups."
    },
    {
        "title": "Gene constraint",
        "link": "https://gnomad.broadinstitute.org/help/constraint",
        "text": "Genetic constraint is a measure of the amount that a genomic region is under negative selection. Knowing how much a gene is constrained (e.g., intolerant to mutational changes) can help prioritize variants that are more likely to have a deleterious functional impact. In order to measure a gene’s intolerance to variation, we developed a mutational model that predicts the number of variants expected to be seen in the gnomAD dataset for a given transcript based on local sequence context and CpG methylation levels. We then compare those per-transcript expectations to the observed amount of variation, and consider transcripts that are significantly depleted of their expected variation to be constrained against, or intolerant of, such variation. As detailed below, we have developed three gene-level constraint metrics.\nWe recommend using the\nLOEUF\n(loss-of-function observed / expected upper bound fraction) score displayed in the constraint table\n, though we also display the probability of being loss-of-function intolerant (\npLI\n) score and z-score for all genes, when available.\nThe sections below will review:\nMethods\nDetails on each of the scores\nLOEUF: loss-of-function observed / expected upper bound fraction\npLI: probability of being loss-of-function intolerant\nZ score\nAn explanation of “What is the difference between the LOEUF and pLI score?\n”\nMore details on these methods can be found in the supplement of\nLek\net al.\nNature 2016\nand\nKarczewski\net al.\nNature 2020\n.\nMethods\nTranscripts included in the analyses\nWe used the transcripts of protein-coding genes as defined by GENCODE v39.\nWe currently flag 599 MANE select transcripts that have (1) no expected variants, (2) far too many synonymous, missense, or pLoF variants as determined by a Z score, or (3) far too few synonymous variants as determined by a Z score. If all outliers are removed, there are 16,863 MANE select transcripts left for analyses.\nObserved variant count\nThe observed variant count is the number of unique single nucleotide variants in the transcript with minor allele frequency (MAF) < 0.1% and median depth in the exome samples ≥ 30. Variants with MAFs over 0.1% were not included; the rationale behind this choice is that, for pLoF variants, the total number of false positives far outweighs the number of true common variants.\nExpected variant count\nWe calculate the expected number of variants for all bases with median depth ≥ 30 in our exome samples using a mutational model that corrects for local sequence context and CpG methylation levels. Previously, we used this same mutational model, but corrected for depth; more details on the previous approach can be found in section 4.1 of the supplement in\nKarczewski\net al.\nNature 2020\n.\npLoF Variant types\nFor pLoF counts, only nonsense, splice donor and acceptor site variants caused by single nucleotide changes and called as high confidence by\nLOFTEE\nwere counted. This is because the mutation model does not account for insertions and deletions that underlie frameshift variants.\nScores\nObserved / expected (\noe\n) and the Loss-of-function Observed / expected upper bound fraction (\nLOEUF\n) score\nWe have calculated the ratio of the observed / expected (\noe\n) number of loss-of-function variants for all bases of sufficient depth in the MANE Select (v4 on GRCh38) or canonical (ExAC and v2 on GRCh37) and other non-Select/canonical transcript for each gene. The expected counts are based on a mutational model that takes sequence context and methylation into account.\nInterpretation\nObserved/expected (\noe\n) is a continuous measure of how tolerant a gene is to a certain class of variation (e.g. loss-of-function). When a gene has a low\noe\nvalue, it is under stronger selection for that class of variation than a gene with a higher value. Because counts depend on gene size and sample size, the precision of the\noe\nvalues varies a lot from one gene to the next. Therefore in addition to the\noe\nvalue, we also display the 90% confidence interval (CI) for each of the\noe\nvalues.\nWhen evaluating how constrained a gene is, it is essential to take the 90% CI into consideration. In particular, we suggest using the upper bound of that CI, which is also known as the\nLOEUF\n(“loss-of-function observed/expected upper bound fraction”) score.\nLOEUF\nis therefore a conservative estimate of the observed/expected ratio, based on the upper bound of a Poisson-derived confidence interval around the ratio. Low\nLOEUF\nscores indicate strong selection against predicted loss-of-function (pLoF) variation in a given gene, while high\nLOEUF\nscores suggest a relatively higher tolerance to inactivation.\nOne advantage of\noe\nand\nLOEUF\ncompared to\npLI\nare that they are more direct measures of biological significance, and can be easily used as continuous values. For example, a doubling of\noe\nfrom 0.2 to 0.4 conveys that 20% vs 40% of the expected number of variants has been observed in gnomAD. By contrast, a doubling of the\npLI\nscore (e.g., 0.45 to 0.9) is less immediately interpretable as\npLI\nis fairly dichotomous with nearly all genes having scores < 0.1 or > 0.9. Intermediate\npLI\nscores (0.1-0.9) are typically an indication that the gene was too small to be confidently categorized.\nAlthough\noe\nand\nLOEUF\nare continuous values, we understand that it can be useful to use a threshold for certain applications. In particular, for the interpretation of Mendelian disease cases, we suggest using a\nLOEUF\nscore < 0.6 as a threshold if needed. Again, ideally\noe\nand\nLOEUF\nshould be used as a continuous values rather than a cutoff.\nAs mentioned above,\noe\nand\nLOEUF\nare dependent on sample size and we note that these values are slightly higher in v4 compared to v2 for all genes. The major impact of this is that any\nLOEUF\nthresholds used on v2 will not give an equivalent number of genes when applied to v4. This rise in\noe\nis anticipated, particularly as we are now able to sample variants with a much lower population allele frequency than before (e.g., 1 in ~125,000 individuals vs 1 in ~730,000 individuals).\nProbability of being loss-of-function intolerant (\npLI\n)\npLI\nis based on the underlying premise that we can assign genes to three natural categories with respect to sensitivity to loss-of-function variation: null (tolerant; where loss-of-function variation – heterozygous or homozygous - is completely tolerated by natural selection), recessive (where heterozygous variants are tolerated but homozygous ones are not), and haploinsufficient (where heterozygous loss-of-function variants are not tolerated). In order to create these metrics, we assumed that tolerant genes would have the expected amount of loss-of-function variation and then took the empirical observed/expected rate of loss-of-function variation for recessive disease genes (0.706) and severe haploinsufficient genes (0.207) to represent the average outcome of the homozygous and heterozygous intolerant scenarios, respectively. We then used an expectation-maximization (EM) algorithm to assign each transcript a probability of belonging to each category.\npLI\nis the probability of belonging to the haploinsufficient class of genes. We have updated the empirical observed/expected rate of loss-of-function variants from previous releases. More details on the original formulation of pLI can be found in section 4.4 of the supplement in\nLek\net al.\nNature 2016\n.\nSynonymous and missense (Z scores)\nFor synonymous and missense variation, we created a signed Z score of the deviation of observed counts from the expected number. Positive Z scores indicate increased constraint (intolerance to variation) and therefore that the transcript had fewer variants than expected. Negative Z scores were given to transcripts that had more variants than expected.\nTo generate Z scores, we used a previously described, but slightly modified, sequence-context based mutational model to predict the number of expected rare (minor allele frequency < 0.1%) variants per transcript at well covered sites. We then calculated the chi-squared value for the deviation of observation from expectation for each mutational class (synonymous and missense). The square root of these values was taken and multiplied by -1 if the number of observed variants was greater than expectation or 1 if observed counts were smaller than expected. The synonymous Z scores were then corrected by dividing each score by the standard deviation of all synonymous Z scores in between -8 and 8 (-5 and 5 for gnomAD v2). For the missense Z scores, we took all Z scores between -8 and 0 (-5 and 0 for gnomAD v2) and created a mirrored distribution. The missense Z scores were then corrected by dividing each score by the standard deviation of these mirror distributions.\nFor more information, see\nSamocha\net al.\nNature Genetics 2014\nand\nLek\net al.\nNature 2016\n.\nWhat is the difference between the oe/LOEUF and pLI score?\nIt is very important to note that\noe\n(and thereby\nLOEUF\n) score is very different from that of\npLI\n; in particular low\noe\nvalues are indicative of strong intolerance, whereas high\npLI\nscores indicate intolerance. In addition, while\npLI\nincorporated the uncertainty around low counts (i.e a gene with low expected count, due to small size or low coverage, could not have a high\npLI\n),\noe\ndoes not. Therefore, the\noe\nmetric comes with a 90% CI. It is important to consider the confidence interval when using\noe\n. The change from\npLI\nto\noe\nwas motivated mainly by its easier interpretation and its continuity across the spectrum of selection. As an example, let’s take a gene with a\npLI\nof 0.8: this means that this gene cannot be categorized as a highly likely haploinsufficient gene based on our data. However, it is unclear whether this value was obtained because of small sample or gene size or because there were too many loss-of-function (LoF) variants observed in the gene. In addition, if the cause was the latter,\npLI\ndoesn’t tell much about the overall selection against loss-of-function in this gene. On the other hand, a gene with an LoF\noe\nof 0.4 can clearly be interpreted as a gene where only 40% of the expected loss-of-function variants were observed and therefore is likely under selection against LoF variants. In addition, the 90% CI allows us to clearly distinguish cases where there is a lot of uncertainty about the constraint for that gene due to sample size. Since\npLI\n> 0.9 is widely used in research and clinical interpretation of Mendelian cases, we suggest using the upper bound of the\noe\nconfidence interval (which we term the \"loss-of-function observed/expected upper bound fraction\" or \"\nLOEUF\n\") < 0.6 if a hard threshold is needed."
    },
    {
        "title": "Proportion expressed across transcripts (pext) score",
        "link": "https://gnomad.broadinstitute.org/help/pext",
        "text": "The pext score, presented in\n\"Transcript expression-aware annotation improves rare variant interpretation\"\n, summarizes isoform expression values across tissues to allow for quick visualization of the expression status of exonic regions across tissues.\nHere, we have integrated pext values from the GTEx v7 dataset. To do so, we first compute the median expression of a transcript for GTEx tissue samples, and define the expression of a given base as the sum of the expression of all transcripts that touch that base as seen in the visualization below:\nWe do this for every GTEx tissue, and then normalize the value by the expression of the gene in the tissue. This is the base-level pext, which can be interpreted as a measure of the proportion of the total transcriptional output from a gene that would be affected by the position in question. It can also be thought of as an exon-usage type metric.\nHow is this useful?\nThis visualization will show you how much an exonic region has evidence of expression across tissues.\nFor example, you may find that there is no evidence of expression for a region in any GTEx tissues. We find that such regions often have low conservation and are enriched for annotation errors. In other cases, you may find a tissue-specific region carrying a variant of interest, which may be relevant to the clinical presentation of a carrier.\nImportant difference between annotation-level and base-level pext\nFor the base-level pext value, we sum the expression value of all transcripts that touch that base, whereas for an annotation-level we only sum the expression of transcripts on which a variant has a given annotation. For example for this toy variant:\nCHROM    POS   REF  ALT   CONSEQUENCES\n  X     34242   C    T    ENST1: missense,\n                          ENST2: missense,\n                          ENST3: stop_gained\nThe base-level pext value is the sum of the expression of ENST1, ENST2, and ENST3 divided by the gene expression value\nThe annotation-level pext value is the sum of expression of ENST1 and ENST2 for the missense annotation, and the expression  of ENST3 for the stop gained annotation, each divided by the gene expression value.\nTherefore it's important to note that\nthe base-level pext value represents a maximum of the position, and will always be higher than the annotation-level pext value\n. Therefore just because a position has a high base-level pext value doesn't mean a pLoF annotated at that position will have a high annotation-level pext value.\nCaveats\nWe note that the pext values are derived from isoform quantifications using the RSEM tool. Isoform quantification tools can be imprecise, especially for longer genes with many annotated isoforms. While we have manually curated a set of regions with low pext values, and find that they are enriched for annotation errors, domain knowledge of a gene will outperform this summary metric (ie. there may be edge cases for which an exon that is established to be critical for gene function may appear unexpressed with pext). We also note that the GTEx dataset is postmortem adult tissue, and thus we cannot dismiss the probability that an exon may be development-specific or may be expressed in tissues not represented in GTEx.\nAlso note that for the browser, we have only added expression values for protein-coding (CDS) regions. While UTRs do have expression in transcriptome datasets, we do not include this information for the visualization.\nMore information\nCheck out our paper for details on development, validation and utility of pext values for interpretation. We also have a detailed\nGitHub page\nthat outlines the commands to create these files, and includes steps to annotate your own variant file with pext values with any isoform expression matrix."
    },
    {
        "title": "Regional constraint",
        "link": "https://gnomad.broadinstitute.org/help/regional-constraint",
        "text": "Important: The regional missense constraint track is currently only available / displayed when selecting the gnomAD v2.1.1 dataset. In addition, there are three distinct views:\nRegional constraint information for genes that exhibit evidence of regional missense constraint (RMC)\nTranscript-wide missense information for genes that were searched for but did not exhibit any evidence of RMC\nText for\noutlier genes\nnot searched for evidence of RMC\nMethods\nWe searched for regions within transcripts that were differentially intolerant of missense variation within the v2.1.1 dataset. We used likelihood ratio tests to identify transcripts that had two or more regions with significantly different levels of missense constraint (as measured by depletion of observed rare missense variation compared to expected). Missense constraint values closer to zero indicate increased intolerance against missense variation.\nNote that these data currently reflect the regional constraint seen in the gnomAD v2.1.1, which was mapped to GRCh37. We will update to gnomAD v4 (GRCh38) in the near future.\nMore details can be found in\nSamocha\net al.\nbioRxiv 2017\n, or the open-source\nGitHub repository\n.\nTranscripts included in the analyses\nWe used the canonical transcripts of protein-coding genes as defined by GENCODE v19. We removed transcripts that lacked a methionine at the start of the coding sequence, a stop codon at the end of coding sequence, or were indivisible by three, which left 19,704 transcripts. Additionally, we excluded 517 transcripts that had zero observed variants when removing exons with a median depth < 1 as well as 556 transcripts that had either (1) far too many synonymous and missense variants as determined by a Z score (p < 10-4 and 10-3, respectively) or (2) far too few synonymous and missense variants as determined by a Z score (p < 10-4 and 10-3, respectively). When all outliers were removed, there were 18,629 transcripts left for analyses.\nObserved missense variants\nThe observed number of rare missense variants per base in gnomAD v2.1.1 was determined by extracting all variants that met the following criteria:\nDefined as a missense change (\"missense_variant\") by the Variant Effect Predictor (VEP)\nHad an allele count > 0\nHad an allele frequency of < 0.001 across gnomAD v2.1.1 exomes\nHad a median coverage > 0 across gnomAD v2.1.1 exomes\nPassed all variant QC filters\nExpected variant count\nWe used a depth corrected probability of mutation for each gene to predict the expected variant counts. More details can be found in the supplement of\nKarczewski\net al.\nNature 2020\n.\nIdentification of missense constrained regions\nWe used likelihood ratio tests to identify regions within transcripts that were differentially intolerant of missense variation. Briefly, we searched for breaks between base pairs that would split a transcript into two or more regions with significantly different levels of missense constraint. We used a likelihood ratio test to determine if splitting a transcript into multiple regions was significantly better at modeling the gene's observed pattern of missense variation than the null model that assumes no regional variability in missense constraint. For these analyses, we assumed that observed counts should follow a Poisson distribution around the product of the expected counts and the model-specific observed / expected proportion. More details of this analysis are included in\nSamocha et al bioRxiv 2017\n."
    },
    {
        "title": "Overview of structural variants in gnomAD",
        "link": "https://gnomad.broadinstitute.org/help/sv-overview",
        "text": "Background\nStructural variants (SVs) are a form of genomic variation involving the gain, loss or rearrangement of at least 50 nucleotides.\nSVs occur across numerous mutational classes, including gains and losses of genomic DNA (\ncopy number variants\n/\nCNVs or unbalanced\nSVs), and dosage-neutral rearrangements of the linear genome sequence (known as\nbalanced\nSVs).\nDue to their size and disruptive nature, SVs can often result in alterations to coding sequences.\nDescription of gnomAD SV data\nThe gnomAD v4 release has two SV data sets, 1) those detected in 63,046 unrelated genomes 2) and those detected in 464,297 exomes, the latter excluding common CNVs above 1%. In the gnomAD browser, we provide site, frequency, and annotation information for 1,199,117 high-quality SVs, as well as 66,903 high-quality rare coding CNVs. As with the gnomAD short variant data set, we have removed cohorts recruited for severe pediatric disease.\nWe have also produced VCF and BED files for both datasets, which are available via\nthe gnomAD Downloads page\n.\nMethods\nGenome SVs\nThe new SV dataset for gnomAD v4 was generated using a cloud-based SV joint calling pipeline, GATK-SV (\nCollins\net al\n. 2020\n). To learn more about this method, including the types of variants identified, functional impact, and browser details, please read our v4 genomes SV\nblog post\n.\nRare Exome CNVs\nTo generate this reference resource we applied the methods, GATK-gCNV, from our recent publication (\nBabadi\net al\n. Nat Genet, 2023\n). To learn more about this method, including benchmarking, annotations, and browser details, please read our v4 rare exome CNV\nblog post\n.\nReferences\nFor more information, please refer to:\nGenome SVs:\ngnomAD SV paper\nv4 genomes SV blog post\nRare Exome CNVs:\nRare exome CNV paper\nv4 rare exome CNV blog post\nExpand to see details for past versions\nDescription of gnomAD v2 SV data\nIn the gnomAD browser, we provide site, frequency, and annotation information for 445,857 SVs discovered in 10,738 unrelated individuals. As with the gnomAD short variant data set, we have removed individuals known to be affected by severe pediatric disease, as well as their first-degree relatives.\nWe have also produced VCF and BED files containing the 445,857 SVs from 10,738 unrelated genomes, which are available via\nthe gnomAD Downloads page\n.\nv2 SV Methods\nWe catalogued SVs from Illumina short-read whole-genome sequencing (WGS) aggregated across various population genetic and complex disease association studies. In total, this cohort included 14,891 individuals, a subset (72%; 10,738/14,891) of which are included in the public SV dataset release on this website. We performed SV discovery by integrating four published SV algorithms (\nManta\n,\nDELLY\n,\nMELT\n, and\ncn.MOPS\n) to detect sites of putative SV across seven mutational classes, and jointly filtered, genotyped, resolved, and annotated these SVs across all 14,891 genomes. All SV discovery was performed in\nFireCloud\n, where the components of the gnomAD SV discovery pipeline are available as public methods with dedicated Docker images. Extensive technical details of this process are provided in the supplementary information of the\ngnomAD SV paper\n.\nReferences\nFor more information, please refer to the\ngnomAD SV paper\nor this\nblog post\n."
    },
    {
        "title": "Variant co-occurrence",
        "link": "https://gnomad.broadinstitute.org/help/variant-cooccurrence",
        "text": "Recessive diseases arise when both the maternal and the paternal copies of a gene are impacted by a damaging genetic variant in the affected individual. When a patient carries two different potentially causal variants in a gene for a given disorder, accurate diagnosis requires determining that these two variants occur on different copies of the chromosome (i.e., are in trans) rather than on the same copy (i.e., in cis). However, current approaches for determining phase, beyond parental testing, are limited in clinical settings.\nTo help with these challenges, we have released inferred phasing data for all pairs of variants within a gene where both variants have a global allele frequency in gnomAD v2.1.1 exomes <5% and are either coding, flanking intronic (from position -1 to -3 in acceptor sites, and +1 to +8 in donor sites), or in the 5’/3’ UTRs. On the browser, over 5.3 billion pairs of variants across 19,685 genes can be queried. We have also released a file of 20,921,100 pairs of variants that were seen at least once in the same individual. As a note: if a pair of qualifying variants is not in this file, it indicates that the two variants were never seen together in the same individual, and therefore we would infer that these variants are in trans. To learn more about this approach please read our\nblog post\nor\npaper\n.\nAdditionally, we have incorporated cumulative counts of gnomAD individuals carrying pairs of rare co-occurring variants within genes in the gnomAD v2 browser across various allele frequencies and functional consequences. These counts can be used to evaluate how frequently rare variant co-occurrence is observed in a large reference population. To read more about this approach, how to access this data in the browser, as well as limitations please see our\nblog post\n. Additionally you can read our paper\nhere\n."
    },
    {
        "title": "HGDP + 1KG dense MatrixTable annotation descriptions",
        "link": "https://gnomad.broadinstitute.org/help/hgdp-1kg-annotations",
        "text": "This dataset includes genomes from the Human Genome Diversity Project (HGDP) and the 1000 Genomes Project (1KG). We have added sample QC and variant QC annotations performed on the full gnomAD dataset as well as sample QC annotations specific to this unique and diverse subset. This MatrixTable also includes a\nsynthetic-diploid\n(syndip) sample (a mixture of DNA from two haploid CHM cell lines).\nGlobal annotations:\ngnomad_sex_imputation_ploidy_cutoffs:\nContains sex chromosome ploidy cutoffs used when determining sex chromosome karyotypes for the gnomAD sex imputation. Format: (upper cutoff for single X, (lower cutoff for double X, upper cutoff for double X), lower cutoff for triple X) and (lower cutoff for single Y, upper cutoff for single Y), lower cutoff for double Y).\ngnomad_population_inference_pca_metrics:\nContains the number of principal components (PCs) used when running PC-project and the minimum cutoff probability of belonging to a given population for the gnomAD population inference.\nsample_hard_filter_cutoffs:\nContains the cutoffs used for hard-filtering samples prior to sample QC. Sample QC metrics are computed using the Hail sample_qc module on all autosomal bi-allelic SNVs. Samples are removed if they are clear outliers for any of the following metrics: number of snps (n_snp), ratio of heterozygous variants to homozygous variants (r_het_hom_var), number of singletons (n_singleton), and mean coverage on chromosome 20 (cov). Additionally, we filter based on outliers of the following BAM/CRAM-derived metrics: % contamination (freemix), % chimera, and median insert size.\ngnomad_sample_qc_metric_outlier_cutoffs:\nContains the cutoffs used for filtering outlier samples based on QC metrics (reported in the sample_qc and gnomad_sample_qc_residuals annotations). The first eight PCs computed during the gnomAD ancestry assignment were regressed out and the sample filter cutoffs were determined based on the residuals for each of the sample QC metrics. Samples were filtered if they fell outside four median absolute deviations (MADs) from the median for the following sample QC metrics: n_snp, r_ti_tv, r_insertion_deletion, n_insertion, n_deletion, n_het, n_hom_var, n_transition, and n_transversion. Samples over 8 MADs above the median n_singleton metric and over 4 MADs above the median r_het_hom_var metric were also filtered.\ngnomad_age_distribution:\ngnomAD callset-wide age histogram calculated on release samples.\nbin_edges:\nBin edges for the age histogram.\nbin_freq:\nBin frequencies for the age histogram. This is the number of records found in each bin.\nn_smaller:\nCount of age values falling below lowest histogram bin edge.\nn_larger:\nCount of age values falling above highest histogram bin edge.\nhgdp_tgp_freq_meta:\nHGDP and 1KG frequency metadata. An ordered list containing the frequency aggregation group for each element of the hgdp_tgp_freq array row annotation.\ngnomad_freq_meta:\ngnomAD frequency metadata. An ordered list containing the frequency aggregation group for each element of the gnomad_freq array row annotation.\nhgdp_tgp_freq_index_dict:\nDictionary keyed by specified label grouping combinations (group: adj/raw, pop: HGDP or 1KG subpopulation, sex: sex karyotype), with values describing the corresponding index of each grouping entry in the HGDP + 1KG frequency array annotation.\ngnomad_freq_index_dict:\nDictionary keyed by specified label grouping combinations (group: adj/raw, pop: gnomAD inferred global population sex: sex karyotype), with values describing the corresponding index of each grouping entry in the gnomAD frequency array annotation.\ngnomad_faf_meta:\ngnomAD filtering allele frequency metadata. An ordered list containing the frequency aggregation group for each element of the gnomad_faf array row annotation.\ngnomad_faf_index_dict:\nDictionary keyed by specified label grouping combinations (group: adj/raw, pop: gnomAD inferred global population sex: sex karyotype), with values describing the corresponding index of each grouping entry in the filtering allele frequency (using Poisson 99% CI) annotation.\nvariant_filtering_model:\nThe variant filtering model used and its specific cutoffs.\nmodel_name:\nVariant filtering model name used in the 'filters' row annotation to indicate the variant was filtered by the model during variant QC.\nscore_name:\nName of score used for variant filtering.\nsnv_cutoff:\nSNV filtering cutoff information.\nbin:\nFiltering percentile cutoff for SNVs.\nmin_score:\nMinimum score at SNV filtering percentile cutoff.\nindel_cutoff:\nInformation about cutoff used for indel filtering.\nbin:\nFiltering percentile cutoff for indels.\nmin_score:\nMinimum score at indel filtering percentile cutoff.\nsnv_training_variables:\nVariant annotations used as features in SNV filtering model.\nindel_training_variables:\nVariant annotations used as features in indel filtering model.\nvariant_inbreeding_coeff_cutoff:\nHard-filter cutoff for InbreedingCoeff on variants.\nvep_version:\nVEP version.\nvep_csq_header:\nVEP header for VCF export.\ndbsnp_version:\ndbSNP version.\nColumn annotations (samples):\ns:\nSample ID.\nbam_metrics:\nSample level metrics obtained from BAMs/CRAMs.\npct_bases_20x:\nThe fraction of bases that attained at least 20X sequence coverage in post-filtering bases.\npct_chimeras:\nThe fraction of reads that map outside of a maximum insert size (usually 100kb) or that have the two ends mapping to different chromosomes.\nfreemix:\nEstimate of contamination (0-100 scale).\nmean_coverage:\nThe mean coverage in bases of the genome territory after all filters are applied; see\nhere\n.\nmedian_coverage:\nThe median coverage in bases of the genome territory after all filters are applied; see\nhere\n.\nmean_insert_size:\nThe mean insert size of the 'core' of the distribution. Artefactual outliers in the distribution often cause calculation of nonsensical mean and stdev values. To avoid this, the distribution is first trimmed to a 'core' distribution of +/- N median absolute deviations around the median insert size.\nmedian_insert_size:\nThe median insert size of all paired end reads where both ends mapped to the same chromosome.\npct_bases_10x:\nThe fraction of bases that attained at least 10X sequence coverage in post-filtering bases.\nsample_qc:\nStruct containing sample QC metrics calculated using hl.sample_qc().\nn_deletion:\nNumber of deletion alternate alleles.\nn_het:\nNumber of heterozygous calls.\nn_hom_ref:\nNumber of homozygous reference calls.\nn_hom_var:\nNumber of homozygous alternate calls.\nn_insertion:\nNumber of insertion alternate alleles.\nn_non_ref:\nSum of n_het and n_hom_var.\nn_snp:\nNumber of SNP alternate alleles.\nn_transition:\nNumber of transition (A-G, C-T) alternate alleles.\nn_transversion:\nNumber of transversion alternate alleles.\nr_het_hom_var:\nHet/HomVar call ratio.\nr_insertion_deletion:\nInsertion/Deletion allele ratio.\nr_ti_tv:\nTransition/Transversion ratio.\ngnomad_sex_imputation:\nStruct containing sex imputation information.\nchr20_mean_dp:\nSample's mean depth across chromosome 20.\nchrX_mean_dp:\nSample's mean depth across chromosome X.\nchrY_mean_dp:\nSample's mean depth across chromosome Y.\nchrX_ploidy:\nSample's chromosome X ploidy (chrX_mean_dp normalized using chr20_mean_dp).\nchrY_ploidy:\nSample's chromosome Y ploidy (chrY_mean_dp normalized using chr20_mean_dp).\nX_karyotype:\nSample's chromosome X karyotype.\nY_karyotype:\nSample's chromosome Y karyotype.\nsex_karyotype:\nSample's sex karyotype (combined X and Y karyotype).\nf_stat:\nInbreeding coefficient (excess heterozygosity) on chromosome X.\nn_called:\nNumber of variants with a genotype call.\nexpected_homs:\nExpected number of homozygotes.\nobserved_homs:\nObserved number of homozygotes.\ngnomad_population_inference:\nStruct containing ancestry information assigned by applying a principal components analysis (PCA) on gnomAD samples and using those PCs in a random forest classifier trained on known gnomAD ancestry labels.\npca_scores:\nSample's scores for each gnomAD population PC.\npop:\nSample's inferred gnomAD population label.\nprob_afr:\nRandom forest probability that the sample is of African/African American ancestry.\nprob_ami:\nRandom forest probability that the sample is of Amish ancestry.\nprob_amr:\nRandom forest probability that the sample is of Latino ancestry.\nprob_asj:\nRandom forest probability that the sample is of Ashkenazi Jewish ancestry.\nprob_eas:\nRandom forest probability that the sample is of East Asian ancestry.\nprob_fin:\nRandom forest probability that the sample is of Finnish ancestry.\nprob_mid:\nRandom forest probability that the sample is of Middle Eastern ancestry.\nprob_nfe:\nRandom forest probability that the sample is of Non-Finnish European ancestry.\nprob_oth:\nRandom forest probability that the sample is of Other ancestry.\nprob_sas:\nRandom forest probability that the sample is of South Asian ancestry.\ngnomad_sample_qc_residuals:\nStruct containing the residuals after regressing out the first eight PCs computed during the gnomAD ancestry assignment from each sample QC metric calculated using hl.sample_qc().\nn_snp_residual:\nResiduals after regressing out the first eight ancestry PCs from the number of SNP alternate alleles.\nr_ti_tv_residual:\nResiduals after regressing out the first eight ancestry PCs from the Transition/Transversion ratio.\nr_insertion_deletion_residual:\nResiduals after regressing out the first eight ancestry PCs from the Insertion/Deletion allele ratio.\nn_insertion_residual:\nResiduals after regressing out the first eight ancestry PCs from the number of insertion alternate alleles.\nn_deletion_residual:\nResiduals after regressing out the first eight ancestry PCs from the number of deletion alternate alleles.\nr_het_hom_var_residual:\nResiduals after regressing out the first eight ancestry PCs from the Het/HomVar call ratio.\nn_transition_residual:\nResiduals after regressing out the first eight ancestry PCs from the number of transition (A-G, C-T) alternate alleles.\nn_transversion_residual:\nResiduals after regressing out the first eight ancestry PCs from the number of transversion alternate alleles.\ngnomad_sample_filters:\nSample QC filter annotations used for the gnomAD release.\nhard_filters:\nSet of hard filters applied to each sample prior to additional sample QC. Samples are hard filtered if they are extreme outliers for any of the following metrics: number of snps (n_snp), ratio of heterozygous variants to homozygous variants (r_het_hom_var), number of singletons (n_singleton), and mean coverage on chromosome 20 (cov). Additionally, we filter based on outliers of the following Picard metrics: % contamination (freemix), % chimera, and median insert size.\nhard_filtered:\nWhether a sample was hard filtered. The gnomad_sample_filters.hard_filters set is empty if this annotation is True.\nrelease_related:\nWhether a sample had a second-degree or greater relatedness to another sample in the gnomAD release.\nqc_metrics_filters:\nSet of all sample QC metrics for which each sample was found to be an outlier after computing sample QC metrics using the Hail sample_qc() module and regressing out the first 8 gnomAD ancestry assignment PCs.\ngnomad_high_quality:\nWhether a sample has passed gnomAD sample QC metrics except for relatedness (i.e., gnomad_sample_filters.hard_filters and gnomad_sample_filters.qc_metrics_filters are empty sets).\ngnomad_release:\nWhether the sample was included in the gnomAD release dataset. For the full gnomAD release, relatedness inference is performed on the full dataset, and release samples are chosen in a way that maximizes the number of samples retained while filtering the dataset to include only samples with less than second-degree relatedness. For the HGDP + 1KG subset, samples passing all other sample QC metrics are retained.\nrelatedness_inference:\nInformation about the sample’s relatedness to other samples within the callset.\nrelated_samples:\nSet of all HGDP or 1KG samples that have a kinship estimate (kin) > 0.05 determined using Hail’s\npc_relate\nmodule with this sample. More details on the relatedness inference can be found\nhere\n. This set is empty if the sample has no such relationships within this HGDP + 1KG subset. Each entry of the set consists of a struct containing the following information about this relationship:\ns:\nSample ID.\nkin:\nKinship estimate.\nibd0:\nIBD0 estimate.\nibd1:\nIBD1 estimate.\nibd2:\nIBD2 estimate.\nrelated:\nIndicates whether this sample is excluded from variant frequency calculations (hgdp_tgp_freq) because of relatedness to other samples. Closely related individuals are pruned from the dataset to enhance the accuracy of population frequency estimates. Pruning using Hail’s\nmaximal_independent_set\nmodule maintains the maximal number of individuals in the dataset.\nhgdp_tgp_meta:\nSample metadata specific to the HGDP + 1KG subset.\nproject:\nIndicates if the sample is part of the Human Genome Diversity Project (‘HGDP’), the ‘1000 Genomes’ project, or is the\nsynthetic-diploid\nsample (a mixture of DNA from two haploid CHM cell lines).\nstudy_region:\nStudy-specific global population labels.\npopulation:\nPopulation label for HGDP or 1KG. The HGDP populations are detailed\nhere\n. 1KG populations are described\nhere\n.\ngenetic_region:\nGlobal population labels harmonized across both studies.\nlatitude:\nApproximate latitude of the geographical place of origin of the population.\nlongitude:\nApproximate longitude of the geographical place of origin of the population.\nhgdp_technical_meta:\nTechnical considerations for HGDP detailed\nhere\n. This struct will be missing for 1KG samples and syndip.\nsource:\nWhich batch/project these HGDP samples were sequenced in (Sanger vs Simons Genome Diversity Project).\nlibrary_type:\nWhether library prep was PCR-free or used PCR.\nglobal_pca_scores:\nArray of the first 20 principal components analysis (PCA) scores on the full HGDP + 1KG subset. Obtained by first dividing the sample set into relateds and unrelateds (using relatedness_inference.related). PCA was run on the unrelated samples using Hail’s\nhwe_normalized_pca\nmodule, producing a global PCA score for each of the unrelated samples and loadings for each variant. The related samples were then\nprojected\nonto the predefined PCA space using the variant loadings from the unrelated sample PCA to produce the PC scores for the related samples. Code used to obtain these scores can be found under\nglobal pca\nhere\nsubcontinental_pca:\nThe subcontinental PCAs were obtained in a similar manner as the global PCA scores (hgdp_tgp_meta.global_pca_scores). The full HGDP + 1KG subset was split by genetic region (hgdp_tgp_meta.genetic_region) prior to performing the same PCA and PC projection steps described for the global PCA scores. These steps were performed for each region separately. The code used to obtain these scores can be found under\nsubcontinental pca\nhere\npca_scores:\nArray of the first 20 subcontinental PCA scores for the sample based on its value in the hgdp_tgp_meta.genetic_region annotation (one of: AFR, AMR, CSA, EAS, EUR, MID, or OCE).\npca_scores_outliers_removed:\nArray of the first 20 subcontinental PCA scores following the removal of samples labeled as subcontinental PCA outliers (hgdp_tgp_meta.subcontinental_pca.outlier).\noutlier:\nWhether the sample was an outlier in the subcontinental PCAs.\ngnomad_labeled_subpop:\nSimilar to the\nhgdp_tgp_meta.population\nannotation, this is the sample's population label supplied by HGDP or 1KG with slight modifications that were used to harmonize labels with other gnomAD samples.\nhigh_quality:\nSamples that pass all ‘gnomad_sample_filters.hard_filters’ and were not found to be outliers in global population-specific principal component analysis\nhgdp_tgp_meta.subcontinental_pca.outlier\n.\nRow annotations (variants):\nlocus:\nVariant locus. Contains contig and position information.\nalleles:\nVariant alleles.\nrsid:\ndbSNP reference SNP identification (rsID) numbers.\na_index:\nThe original index of this alternate allele in the multiallelic representation (1 is the first alternate allele or the only alternate allele in a biallelic variant).\nwas_split:\nTrue if this variant was originally multiallelic, otherwise False.\nhgdp_tgp_freq:\nAllele frequency information (AC, AN, AF, homozygote count) in HGDP + 1KG samples that pass the high_quality sample annotation and are inferred as unrelated (False in relatedness_inference.related annotation).\nAC:\nAlternate allele count  in HGDP + 1KG samples that pass the high_quality sample annotation.\nAF:\nAlternate allele frequency  in HGDP + 1KG samples that pass the high_quality sample annotation.\nAN:\nTotal number of alleles in HGDP + 1KG samples that pass the high_quality sample annotation.\nhomozygote_count:\nCount of homozygous individuals in HGDP + 1KG samples that pass the high_quality sample annotation.\ngnomad_freq:\nAllele frequency information (AC, AN, AF, homozygote count) in gnomAD release.\nAC:\nAlternate allele count in gnomAD release.\nAF:\nAlternate allele frequency in gnomAD release.\nAN:\nTotal number of alleles in gnomAD release.\nhomozygote_count:\nCount of homozygous individuals in gnomAD release.\ngnomad_popmax:\nAllele frequency information (AC, AN, AF, homozygote count) for the population with maximum AF in gnomAD.\nAC:\nAllele count in the population with the maximum AF in gnomAD.\nAF:\nMaximum allele frequency across populations in gnomAD.\nAN:\nTotal number of alleles in the population with the maximum AF in gnomAD.\nhomozygote_count:\nCount of homozygous individuals in the population with the maximum allele frequency in gnomAD.\npop:\nPopulation with maximum AF in gnomAD.\nfaf95:\nFiltering allele frequency (using Poisson 95% CI) for the population with the maximum allele frequency in gnomAD.\ngnomad_faf:\nFiltering allele frequency in gnomAD release.\nfaf95:\nFiltering allele frequency in gnomAD release (using Poisson 95% CI).\nfaf99:\nFiltering allele frequency in gnomAD release (using Poisson 99% CI).\ngnomad_qual_hists:\ngnomAD genotype quality metric histograms for high quality genotypes.\ngq_hist_all:\nHistogram for GQ calculated on high quality genotypes.\nbin_edges:\nBin edges for the GQ histogram calculated on high quality genotypes are: 0|5|10|15|20|25|30|35|40|45|50|55|60|65|70|75|80|85|90|95|100\nbin_freq:\nBin frequencies for the GQ histogram calculated on high quality genotypes. The number of records found in each bin.\nn_smaller:\nCount of GQ values falling below lowest histogram bin edge, for GQ calculated on high quality genotypes\nn_larger:\nCount of GQ values falling above highest histogram bin edge, for GQ calculated on high quality genotypes\ndp_hist_all:\nHistogram for DP calculated on high quality genotypes.\nbin_edges:\nBin edges for the DP histogram calculated on high quality genotypes are: 0|5|10|15|20|25|30|35|40|45|50|55|60|65|70|75|80|85|90|95|100.\nbin_freq:\nBin frequencies for the DP histogram calculated on high quality genotypes. The number of records found in each bin.\nn_smaller:\nCount of DP values falling below lowest histogram bin edge, for DP calculated on high quality genotypes.\nn_larger:\nCount of DP values falling above highest histogram bin edge, for DP calculated on high quality genotypes.\ngq_hist_alt:\nHistogram for GQ in heterozygous individuals calculated on high quality genotypes.\nbin_edges:\nBin edges for the histogram of GQ in heterozygous individuals calculated on high quality genotypes are: 0|5|10|15|20|25|30|35|40|45|50|55|60|65|70|75|80|85|90|95|100.\nbin_freq:\nBin frequencies for the histogram of GQ in heterozygous individuals calculated on high quality genotypes. The number of records found in each bin.\nn_smaller:\nCount of GQ values falling below lowest histogram bin edge, for GQ in heterozygous individuals calculated on high quality genotypes.\nn_larger:\nCount of GQ values falling above highest histogram bin edge, for GQ in heterozygous individuals calculated on high quality genotypes.\ndp_hist_alt:\nHistogram for DP in heterozygous individuals calculated on high quality genotypes.\nbin_edges:\nBin edges for the histogram of DP in heterozygous individuals calculated on high quality genotypes are: 0|5|10|15|20|25|30|35|40|45|50|55|60|65|70|75|80|85|90|95|100.\nbin_freq:\nBin frequencies for the histogram of DP in heterozygous individuals calculated on high quality genotypes. The number of records found in each bin.\nn_smaller:\nCount of DP values falling below lowest histogram bin edge, for DP in heterozygous individuals calculated on high quality genotypes.\nn_larger:\nCount of DP values falling above highest histogram bin edge, for DP in heterozygous individuals calculated on high quality genotypes.\nab_hist_alt:\nHistogram for AB in heterozygous individuals calculated on high quality genotypes.\nbin_edges:\nBin edges for the histogram of AB in heterozygous individuals calculated on high quality genotypes are: 0.00|0.05|0.10|0.15|0.20|0.25|0.30|0.35|0.40|0.45|0.50|0.55|0.60|0.65|0.70|0.75|0.80|0.85|0.90|0.95|1.00.\nbin_freq:\nBin frequencies for the histogram of AB in heterozygous individuals calculated on high quality genotypes. The number of records found in each bin.\nn_smaller:\nCount of AB values falling below lowest histogram bin edge, for AB in heterozygous individuals calculated on high quality genotypes.\nn_larger:\nCount of AB values falling above highest histogram bin edge, for AB in heterozygous individuals calculated on high quality genotypes.\ngnomad_raw_qual_hists:\ngnomAD genotype quality metric histograms.\ngq_hist_all:\nHistogram for GQ calculated on all genotypes.\nbin_edges:\nBin edges for the GQ histogram calculated on all genotypes are: 0|5|10|15|20|25|30|35|40|45|50|55|60|65|70|75|80|85|90|95|100.\nbin_freq:\nBin frequencies for the GQ histogram calculated on all genotypes. The number of records found in each bin.\nn_smaller:\nCount of GQ values falling below lowest histogram bin edge, for GQ calculated on all genotypes.\nn_larger:\nCount of GQ values falling above highest histogram bin edge, for GQ calculated on all genotypes.\ndp_hist_all:\nHistogram for DP calculated on all genotypes.\nbin_edges:\nBin edges for the DP histogram calculated on all genotypes are: 0|5|10|15|20|25|30|35|40|45|50|55|60|65|70|75|80|85|90|95|100\nbin_freq:\nBin frequencies for the DP histogram calculated on all genotypes. The number of records found in each bin.\nn_smaller:\nCount of DP values falling below lowest histogram bin edge, for DP calculated on all genotypes.\nn_larger:\nCount of DP values falling above highest histogram bin edge, for DP calculated on all genotypes.\ngq_hist_alt:\nHistogram for GQ in heterozygous individuals calculated on all genotypes.\nbin_edges:\nBin edges for the histogram of GQ in heterozygous individuals calculated on all genotypes are: 0|5|10|15|20|25|30|35|40|45|50|55|60|65|70|75|80|85|90|95|100.\nbin_freq:\nBin frequencies for the histogram of GQ in heterozygous individuals calculated on all genotypes. The number of records found in each bin.\nn_smaller:\nCount of GQ values falling below lowest histogram bin edge, for GQ in heterozygous individuals calculated on all genotypes.\nn_larger:\nCount of GQ values falling above highest histogram bin edge, for GQ in heterozygous individuals calculated on all genotypes.\ndp_hist_alt:\nHistogram for DP in heterozygous individuals calculated on all genotypes.\nbin_edges:\nBin edges for the histogram of DP in heterozygous individuals calculated on all genotypes are: 0|5|10|15|20|25|30|35|40|45|50|55|60|65|70|75|80|85|90|95|100.\nbin_freq:\nBin frequencies for the histogram of DP in heterozygous individuals calculated on all genotypes. The number of records found in each bin.\nn_smaller:\nCount of DP values falling below lowest histogram bin edge, for DP in heterozygous individuals calculated on all genotypes.\nn_larger:\nCount of DP values falling above highest histogram bin edge, for DP in heterozygous individuals calculated on all genotypes.\nab_hist_alt:\nHistogram for AB in heterozygous individuals calculated on all genotypes.\nbin_edges:\nBin edges for the histogram of AB in heterozygous individuals calculated on all genotypes are: 0.00|0.05|0.10|0.15|0.20|0.25|0.30|0.35|0.40|0.45|0.50|0.55|0.60|0.65|0.70|0.75|0.80|0.85|0.90|0.95|1.00.\nbin_freq:\nBin frequencies for the histogram of AB in heterozygous individuals calculated on all genotypes. The number of records found in each bin.\nn_smaller:\nCount of AB values falling below lowest histogram bin edge, for AB in heterozygous individuals calculated on all genotypes.\nn_larger:\nCount of AB values falling above highest histogram bin edge, for AB in heterozygous individuals calculated on all genotypes.\ngnomad_age_hist_het:\nHistogram for age in all heterozygous gnomAD release samples calculated on high quality genotypes.\nbin_edges:\nBin edges for the age histogram.\nbin_freq:\nBin frequencies for the age histogram. This is the number of records found in each bin.\nn_smaller:\nCount of age values falling below lowest histogram bin edge.\nn_larger:\nCount of age values falling above highest histogram bin edge.\ngnomad_age_hist_hom:\nHistogram for age in all homozygous gnomAD release samples calculated on high quality genotypes.\nbin_edges:\nBin edges for the age histogram.\nbin_freq:\nBin frequencies for the age histogram. This is the number of records found in each bin.\nn_smaller:\nCount of age values falling below lowest histogram bin edge.\nn_larger:\nCount of age values falling above highest histogram bin edge.\nfilters:\nVariant filters; AC0: Allele count is zero after filtering out low-confidence genotypes (GQ < 20; DP < 10; and AB < 0.2 for het calls), AS_VQSR: Failed VQSR filtering thresholds of -2.7739 for SNPs and -1.0606 for indels, InbreedingCoeff: GATK InbreedingCoeff < -0.3, PASS: Passed all variant filters.\ninfo:\nStruct containing typical GATK allele-specific (AS) info fields and additional variant QC fields.\nQUALapprox:\nSum of PL[0] values; used to approximate the QUAL score.\nSB:\nPer-sample component statistics which comprise the Fisher's exact test to detect strand bias. Values are: depth of reference allele on forward strand, depth of reference allele on reverse strand, depth of alternate allele on forward strand, depth of alternate allele on reverse strand.\nMQ:\nRoot mean square of the mapping quality of reads across all samples.\nMQRankSum:\nZ-score from Wilcoxon rank sum test of alternate vs. reference read mapping qualities.\nVarDP:\nDepth over variant genotypes (does not include depth of reference samples).\nAS_ReadPosRankSum:\nAllele-specific z-score from Wilcoxon rank sum test of alternate vs. reference read position bias.\nAS_pab_max:\nMaximum p-value over callset for binomial test of observed allele balance for a heterozygous genotype, given expectation of 0.5.\nAS_QD:\nAllele-specific variant call confidence normalized by depth of sample reads supporting a variant.\nAS_MQ:\nAllele-specific root mean square of the mapping quality of reads across all samples.\nQD:\nVariant call confidence normalized by depth of sample reads supporting a variant.\nAS_MQRankSum:\nAllele-specific z-score from Wilcoxon rank sum test of alternate vs. reference read mapping qualities.\nFS:\nPhred-scaled p-value of Fisher's exact test for strand bias.\nAS_FS:\nAllele-specific phred-scaled p-value of Fisher's exact test for strand bias.\nReadPosRankSum:\nZ-score from Wilcoxon rank sum test of alternate vs. reference read position bias.\nAS_QUALapprox:\nAllele-specific sum of PL[0] values; used to approximate the QUAL score.\nAS_SB_TABLE:\nAllele-specific forward/reverse read counts for strand bias tests.\nAS_VarDP:\nAllele-specific depth over variant genotypes (does not include depth of reference samples).\nAS_SOR:\nAllele-specific strand bias estimated by the symmetric odds ratio test.\nSOR:\nStrand bias estimated by the symmetric odds ratio test.\ntransmitted_singleton:\nVariant was a callset-wide doubleton that was transmitted within a family from a parent to a child (i.e., a singleton amongst unrelated samples in cohort).\nomni:\nVariant is present on the Omni 2.5 genotyping array and found in 1000 Genomes data.\nmills:\nIndel is present in the Mills and Devine data.\nmonoallelic:\nAll samples are homozygous alternate for the variant.\nInbreedingCoeff:\nInbreeding coefficient, the excess heterozygosity at a variant site, computed as 1 - (the number of heterozygous genotypes)/(the number of heterozygous genotypes expected under Hardy-Weinberg equilibrium).\nvep:\nConsequence annotations from Ensembl VEP. More details about VEP output is described\nhere\n. VEP was run using the LOFTEE plugin and information about the additional LOFTEE annotations can be found\nhere\n.\nvqsr:\nVQSR related variant annotations.\nAS_VQSLOD:\nAllele-specific log-odds ratio of being a true variant versus being a false positive under the trained VQSR Gaussian mixture model.\nAS_culprit:\nAllele-specific worst-performing annotation in the VQSR Gaussian mixture model.\nNEGATIVE_TRAIN_SITE:\nVariant was used to build the negative training set of low-quality variants for VQSR.\nPOSITIVE_TRAIN_SITE:\nVariant was used to build the positive training set of high-quality variants for VQSR.\nregion_flag:\nStruct containing flags for problematic regions.\nlcr:\nVariant falls within a low complexity region.\nsegdup:\nVariant falls within a segmental duplication region.\nallele_info:\nAllele information.\nvariant_type:\nVariant type (snv, indel, multi-snv, multi-indel, or mixed).\nallele_type:\nAllele type (snv, insertion, deletion, or mixed).\nn_alt_alleles:\nTotal number of alternate alleles observed at variant locus.\nwas_mixed:\nVariant type was mixed.\ncadd:\nraw_score:\nRaw CADD scores are interpretable as the extent to which the annotation profile for a given variant suggests that the variant is likely to be 'observed' (negative values) vs 'simulated' (positive values); higher values indicate that a variant is more likely to be simulated (or \"not observed\") and therefore more likely to have deleterious effects. More information can be found on the\nCADD website\n.\nphred:\nCADD Phred-like scores ('scaled C-scores') ranging from 1 to 99, based on the rank of each variant relative to all possible 8.6 billion substitutions in the human reference genome. Larger values are more deleterious. More information can be found on the\nCADD website\n.\nhas_duplicate:\na True/False flag that indicates whether the variant has more than one CADD score associated with it*.\nrevel:\ndbNSFP's Revel score, ranging from 0 to 1. Variants with higher scores are predicted to be more likely to be deleterious.\nrevel_score:\nRevel’s numerical score from 0 to 1.\nhas_duplicate:\na True/False flag that indicates whether the variant has more than one revel_score associated with it*.\nsplice_ai:\nsplice_ai:\nThe maximum delta score, interpreted as the probability of the variant being splice-altering.\nsplice_consequence:\nThe consequence term associated with the max delta score in 'splice_ai’.\nhas_duplicate:\na True/False flag that indicates whether the variant has more than one splice_ai score associated with it*.\nprimate_ai:\nprimate_ai_score:\nPrimateAI's deleteriousness score from 0 (less deleterious) to 1 (more deleterious).\nhas_duplicate:\na True/False flag that indicates whether the variant has more than one primate_ai_score associated with it*.\n* For a small set of variants, the in silico predictors calculated multiple scores per variant based on additional information. For example, if a variant is found in multiple transcripts or if it has multiple trinucleotide contexts, an in silico predictor may report scores for multiple scenarios. The highest score was taken for each variant in the cases where the in silico predictor calculates multiple scores, and we flag variants with multiple scores.\nAdditional annotations found on the variant annotation HT:\nThese annotations are not present on the dense MT because all LowQual variants and variants in centromeres and telomeres are filtered.\nAS_lowqual:\nWhether the variant falls below a low quality threshold and was excluded from the gnomAD dataset. We recommend filtering all such variants. This is similar to the GATK LowQual filter, but is allele-specific. GATK computes this annotation at the site level, which uses the least stringent prior for mixed sites.\ntelomere_or_centromere:\nWhether the variant falls within a telomere or centromere region. These variants were excluded from the gnomAD dataset. We recommend filtering all such variants."
    },
    {
        "title": "gnomAD v4 Hail Tables",
        "link": "https://gnomad.broadinstitute.org/help/v4-hts",
        "text": "All of gnomAD’s files are stored as Hail tables. In this section we will review:\nBackground on Hail\ngnomAD Hail Table frequency annotations\ngnomAD v4.0 Hail Table annotation descriptions\nNote that Hail Tables (HT), MatrixTables (MT), and VariantDatasets (VDS) are all\ndirectories\nwhen viewed through a file manager, so you will need to download all of the associated files.\nBackground\nHail is an open-source library that provides accessible interfaces for exploring genomic data, with a backend that automatically scales to take advantage of large compute clusters. Hail enables those without expertise in parallel computing to flexibly, efficiently, and interactively analyze large sequencing datasets. We recommend using Hail and our Hail utilities for gnomAD to work with the data listed in the gnomAD downloads page.\nThe Hail forum is a place to search for answers to Hail issues, post about any bugs found, engage with the Hail community and Hail team.\ngnomAD Hail Table frequency annotations\nThe gnomAD release sites Hail Tables containing allele frequency information within the row annotation named '\nfreq\n'.\nThe '\nfreq\n' annotation is an array, and each element of the array is a struct that contains the alternate allele count (\nAC\n), alternate allele frequency (\nAF\n), total number of alleles (\nAN\n), and number of homozygous alternate individuals (\nhomozygote_count\n) for a specific sample grouping.\nUse the '\nfreq_index_dict\n' global annotation to retrieve frequency information for a specific group of samples from the '\nfreq\n' array. This global annotation is a dictionary keyed by sample grouping combinations whose values are the combination's index in the '\nfreq\n' array. The groupings and their available options by version are listed in the table below.\nCategory\nDefinition\nExome Options\nGenome Options\ngroup\nGenotype's filter\nadj\n1\n, raw\nadj\n1\n, raw\nsex\nInferred sex/sex karyotype\n2\nXX, XY\nXX, XY\nsubset\nSample subsets within release\nnon-UK Biobank (Download only)\nHGDP, 1KG (Download Hail Table only)\ngen_anc\ngnomAD inferred genetic ancestry group\nafr\n,\namr\n,\nasj\n,\neas\n,\nfin\n,\nmid\n,\nnfe\n,\nrmi\n,\nsas\nafr\n,\namr\n,\nasj\n,\neas\n,\nfin\n,\nmid\n,\nnfe\n,\nrmi\n,\nsas\ngen_anc\n(1KG subset only)\nThe 1KG project's ancestry\nN/A\nacb\n,\nasw\n,\nbeb\n,\ncdx\n,\nceu\n,\nchb\n,\nchs\n,\nclm\n,\nesn\n,\nfin\n,\ngbr\n,\ngih\n,\ngwd\n,\nibs\n,\nitu\n,\njpt\n,\nkhv\n,\nlwk\n,\nmsl\n,\nmxl\n,\npel\n,\npjl\n,\npur\n,\nstu\n,\ntsi\n,\nyri\ngen_anc\n(HGDP subset only)\nThe HGDP's ancestry labels\nN/A\nadygei, balochi, bantukenya, bantusafrica, basque, bedouin, biakapygmy, brahui, burusho, cambodian, colombian, dai, daur, druze, french, han, hazara, hezhen, italian, japanese, kalash, karitiana, lahu, makrani, mandenka, maya, mbutipygmy, melanesian, miaozu, mongola, mozabite, naxi, orcadian, oroqen, palestinian, papuan, pathan, pima, russian, san, sardinian, she, sindhi, surui, tu, tujia, tuscan, uygur, xibo, yakut, yizu, yoruba\ndownsampling\nDownsampled sample counts\ngnomAD: 10, 100, 500, 1000, 2000, 2884, 5000, 10000, 13068, 16740, 19850, 20000, 22362, 26710, 30198, 43129, 50000, 100000, 200000, 500000, 556006, non-UKB: 10, 100, 500, 1000, 2000, 2074, 5000, 8847, 10000, 10492, 16549, 18035, 20000, 21870, 26572, 34899, 50000, 100000, 175054, 200000\nThe gnomes release Hail Table does not contain downsampling information.\nVersion 4.0 sample grouping combinations and 'freq' array access\nThe available v4.0 grouping combinations within the 'freq' array annotation are listed below. adj1 must be provided as the “group” for all combinations except when requesting raw frequency information, which is only available for the main gnomAD callsets and subsets.\ngroup, e.g. “\nadj\n”, “\nraw\n”\nsex-group, e.g. “\nXX_adj\n”\nsubset-group, e.g. “\nnon_ukb-raw\n”\ngen-anc3-group, e.g. “\nafr_adj\n”\ngen-anc-sex-group, e.g. “\nami_XX_adj\n”\ndownsampling2-group-pop, e.g. “\n10_adj_eas\n”,\nsubset-gen-anc-group, e.g. “\n_sas_adj\n”\nsubset-sex-group, e.g. “\nnon_ukb_XY_adj\n”\nsubset-gen-anc3-sex-group, e.g. “\nnon_ukb_mid_XX_adj\n”,\nTo access the '\nfreq\n' array using the '\nfreq_index_dict\n', you need to retrieve the value of your desired label combination key. The example below accesses the entry of the high quality genotypes (group: adj) of XX individuals (sex: XX) clustered with the AFR genetic ancestry group in the gnomAD v4.0 exomes:\n# Load the v4.0 exomes public release HT\nfrom gnomad.resources.grch38.gnomad import public_release\nht = public_release(“exomes”).ht()\n\n# Use the key 'afr-XX-adj' to retrieve the index of this groups frequency data in 'freq'\nht = ht.annotate(afr_XX_freq=ht.freq[ht.freq_index_dict['afr_XX_adj']])\nThe above example will retrieve the entire frequency struct for each variant. To grab a certain statistic, such as\nAC\n, specify the statistic after the value:\nht = ht.annotate(afr_XX_AC=ht.freq[ht.freq_index_dict['afr_XX_adj']].AC)\nThis same approach can be applied to the filtering allele frequency (FAF) array, '\nfaf\n', by using the '\nfaf_index_dict\n', and to the joint FAF array, '\njoint_faf\n', by using '\njoint_faf_index_dict\n'.\nIncludes only genotypes with depth >= 10, genotype quality >= 20 and minor allele balance > 0.2 for heterozygous genotypes.\nSome downsamplings exceed population counts and thus are not available for those populations. Also, downsamplings are available in the v4 exomes with two stratifications: across the full gnomAD release and across the non-UKB subset only. Note that the genomes Hail Table does not contain downsampling information.\nFor the HGDP and 1KG subsets in the gnomAD v4.0 genomes,, project specified populations are available in place of gnomAD inferred global populations. The HGDP populations are detailed here. The 1KG populations are described here\ngnomAD v4.0 Hail Table annotation descriptions\ngnomAD v4.0 exomes Hail Table annotations\nNote that joint frequency, including filtering allele frequency, is available on this table. However, for the most up to date version of joint frequencies, please see our\nnew resource\nGlobal fields:\nfreq_meta\n: Allele frequency metadata. An ordered list containing the frequency aggregation group for each element of the ‘freq’ array row annotation.\nfreq_index_dict\n: Dictionary keyed by specified label grouping combinations (group: adj/raw, pop: gnomAD inferred global population, sex: sex karyotype), with values describing the corresponding index of each grouping entry in the ‘freq’ array row annotation.\nfreq_meta_sample_count\n: A sample count per sample grouping defined in the '\nfreq_meta\n' global annotation.\nfaf_meta\n: Filtering allele frequency metadata. An ordered list containing the frequency aggregation group for each element of the ‘faf’ array row annotation.\nfaf_index_dict\n: Dictionary keyed by specified label grouping combinations (group: adj/raw, pop: gnomAD inferred global population, sex: sex karyotype), with values describing the corresponding index of each grouping entry in the filtering allele frequency (‘faf’) row annotation.\njoint_freq_meta\n: Joint allele frequency across the exomes and genomes metadata. An ordered list containing the frequency aggregation group for each element of the ‘joint_freq’ array row annotation.\njoint_freq_index_dict\n: Dictionary keyed by specified label grouping combinations (group: adj/raw, pop: gnomAD inferred global population, sex: sex karyotype), with values describing the corresponding index of each grouping entry in the ‘joint_freq’ array row annotation.\njoint_freq_meta_sample_count\n: A sample count per sample grouping defined in the 'joint_freq_meta' global annotation.\njoint_faf_meta\n: Joint filtering allele frequency across the exomes and genomes metadata. An ordered list containing the frequency aggregation group for each element of the ‘joint_faf’ array row annotation.\njoint_faf_index_dict: Dictionary keyed by specified label grouping combinations (group: adj/raw, pop: gnomAD inferred global population, sex: sex karyotype), with values describing the corresponding index of each grouping entry in the filtering allele frequency (‘joint_faf’) row annotation.\nage_distribution\n: Callset-wide age histogram calculated on release samples.\nbin_edges\n: Bin edges for the age histogram.\nbin_freq\n: Bin frequencies for the age histogram. This is the number of records found in each bin.\nn_smaller\n: Count of age values falling below lowest histogram bin edge.\nn_larger\n: Count of age values falling above highest histogram bin edge.\ndownsamplings\n: Dictionary keyed by dataset with values corresponding to available downsampled sample counts.\nfiltering_model\n: The variant filtering model used and its specific cutoffs.\nfilter_name\n: Variant filtering model name used in the 'filters' row annotation, indicating the variant was filtered by this model during variant QC.\nscore_name\n: Annotation name of the score used for variant filtering.\nsnv_cutoff\n: SNV filtering cutoff information.\nbin\n: Filtering percentile cutoff for SNVs.\nmin_score\n: Minimum score at SNV filtering percentile cutoff.\nindel_cutoff\n: Indel filtering cutoff information.\nbin\n: Filtering percentile cutoff for indels.\nmin_score\n: Minimum score at indel filtering percentile cutoff.\nsnv_training_variables\n: Variant annotations used as features in the SNV filtering model.\nindel_training_variables\n: Variant annotations used as features in the indel filtering model.\ninbreeding_coeff_cutoff\n: Inbreeding Coefficient threshold used to hard filter variants.\ninterval_qc_parameters\n: Thresholds used to determine whether an exome calling interval was high coverage and passed interval QC.\nper_platform\n: Whether these thresholds were stratified per platform.\nall_platforms\n: Whether these thresholds were applied uniformly across platforms, as long as a platform had a sample size above\nmin_platform_size\n.\nhigh_qual_cutoffs\n: Interval QC thresholds per chromosomal region:\nautosome_par\n: Contains annotation used to filter high coverage intervals on autosomes and in pseudoautosomal regions and threshold for annotation. Interval was considered high quality only if this annotation was over the specified threshold value.\nx_non_par\n: Contains annotation used to filter high coverage intervals in non-pseudoautosomal regions of chromosome X and threshold for annotation. Interval was considered high quality only if this annotation was over the specified threshold value.\ny_non_par\n: Contains annotation used to filter high coverage intervals in non-pseudoautosomal regions of chromosome Y and threshold for annotation. Interval was considered high quality only if this annotation was over the specified threshold value.\nmin_platform_size\n: Sample size required for a platform to be considered.\ntool_versions\n: Versions of in silico predictors used in the callset.\ncadd_version\n: Combined Annotation Dependent Depletion (CADD) version.\nrevel_version\n: Rare Exome Variant Ensemble Learner (REVEL) version.\nspliceai_version\n: spliceAI version.\npangolin_version\n: Pangolin version.\nphylop_version\n: phyloP version.\ndbsnp_version\n: dbSNP version used in the callset.\nsift_version\n: Sorting Intolerant from Tolerant (SIFT) version.\npolyphen_version\n: Polymorphism Phenotyping v2 (Polyphen-v2) version.\nvrs_versions\n: The Variant Representation Specification version that was used to compute IDs on the callset.\nvrs_schema_version\n: The\nversion\nof the VRS schema that is used to represent variants and compute identifiers.\nvrs_python_version\n: The\nversion\nof the vrs-python library that was used to compute IDs on the callset.\nseqrepo_version\n: The\nversion\nof the SeqRepo database that was used in VRS computations.\nvep_globals\n: Information about VEP annotations.\nvep_version\n: VEP version that was run on the callset.\nvep_help\n: Output from\nvep --help\n.\nvep_config\n: VEP configuration to run VEP version with\nHail\n. File created using command within VEP init shell script in\nhttps://github.com/broadinstitute/gnomad_methods/tree/main\n.\ngencode_version\n: GENCODE version used in VEP.\nmane_select_version\n: MANE select version used in VEP.\nfrequency_README\n: Explanation of how to use the 'freq_index_dict' global annotation to extract frequencies from the 'freq' row annotation.\ndate\n: Date Hail Table was created.\nversion\n: gnomAD data version.\nRow fields:\nlocus\n: Variant locus. Contains contig and position information.\nalleles\n: Variant alleles.\nfreq\n: Array of allele frequency information (AC, AN, AF, homozygote count) for each frequency aggregation group in the gnomAD release.\nAC\n: Alternate allele count in release.\nAF\n: Alternate allele frequency, (AC/AN), in release.\nAN\n: Total number of alleles in release.\nhomozygote_count\n: Count of homozygous alternate individuals in release.\ngrpmax\n: Allele frequency information (AC, AN, AF, homozygote count) for the non-bottlenecked genetic ancestry group with maximum allele frequency. Excludes Ashkenazi Jewish (\nasj\n), European Finnish (\nfin\n), Middle Eastern (\nmid\n), and \"Other\" (\noth\n) groups.\ngnomAD\n: grpmax information across the full gnomAD release dataset.\nAC\n: Alternate allele count in the group with the maximum allele frequency.\nAF\n: Maximum alternate allele frequency, (AC/AN), across groups in gnomAD.\nAN\n: Total number of alleles in the group with the maximum allele frequency.\nhomozygote_count\n: Count of homozygous individuals in the group with the maximum allele frequency.\ngen_ancpop\n: Genetic ancestry group with maximum allele frequency\nnon_ukb\n: grpmax information across the non-UKB subset.\nAC\n: Alternate allele count in the group with the maximum allele frequency.\nAF\n: Maximum alternate allele frequency, (AC/AN), across groups in gnomAD.\nAN\n: Total number of alleles in the group with the maximum allele frequency.\nhomozygote_count\n: Count of homozygous individuals in the group with the maximum allele frequency.\ngen_ancpop\n: Genetic ancestry group with maximum allele frequency\nfaf\n: Filtering allele frequency.\nfaf95\n: Filtering allele frequency (using Poisson 95% CI).\nfaf99\n: Filtering allele frequency (using Poisson 99% CI).\nfafmax\n: Information about the genetic ancestry group with the maximum filtering allele frequency.\ngnomAD\n: Information about the genetic ancestry group with the maximum filtering allele frequency across the full gnomAD release dataset.\nfaf95_max\n: Maximum filtering allele frequency (using Poisson 95% CI).\nfaf95_max_gen_anc\n: Genetic ancestry group with the maximum filtering allele frequency (95% CI).\nfaf99_max\n: Maximum filtering allele frequency (using Poisson 99% CI).\nfaf99_max_gen_anc\n: Genetic ancestry group with the maximum filtering allele frequency (99% CI).\nnon_ukb\n: Information about the genetic ancestry group with the maximum filtering allele frequency in the non-UKB subset.\nfaf95_max\n: Maximum filtering allele frequency (using Poisson 95% CI).\nfaf95_max_gen_anc\n: Genetic ancestry group with the maximum filtering allele frequency (95% CI).\nfaf99_max\n: Maximum filtering allele frequency (using Poisson 99% CI).\nfaf99_max_gen_anc\n: Genetic ancestry group with the maximum filtering allele frequency (99% CI).\njoint_freq\n: Array of combined exomes and genomes allele frequency information (AC, AN, AF, homozygote count) for the full gnomAD release and for each genetic ancestry group. Note that the values in array will correspond to combined or joint value if the variant was present in both data types, otherwise this array will contain frequencies only for the data type associated with the Hail Table (in this case, exomes).\nAC\n: Combined (exomes + genomes) alternate allele count in release.\nAF\n: Combined (exomes + genomes) alternate allele frequency, (AC/AN), in release.\nAN\n: Total number of alleles across exomes and genomes in release.\nhomozygote_count\n: Count of homozygous alternate individuals across exomes and genomes in release.\njoint_grpmax\n: Allele frequency information (AC, AN, AF, homozygote count) for the non-bottlenecked genetic ancestry group with maximum allele frequency across both exomes and genomes. Excludes Amish (ami), Ashkenazi Jewish (asj), European Finnish (fin), Middle Eastern (mid), and \"Other\" (oth) groups.\nAC\n: Alternate allele count in the group with the maximum allele frequency.\nAF\n: Maximum alternate allele frequency, (AC/AN), across groups in gnomAD.\nAN\n: Total number of alleles in the group with the maximum allele frequency.\nhomozygote_count\n: Count of homozygous individuals in the group with the maximum allele frequency.\ngen_anc\n: Genetic ancestry group with maximum allele frequency.\njoint_faf\n: Array of combined exomes and genomes filtering allele frequency information (AC, AN, AF, homozygote count). Note that the values in array will correspond to the joint or combined value if the variant had a defined filtering allele frequency in both data types, otherwise this array will contain filtering allele frequencies only for the data type associated with the Hail Table (in this case, exomes).\nfaf95\n: Combined exomes and genomes filtering allele frequency (using Poisson 95% CI).\nfaf99\n: Combined exomes and genomes filtering allele frequency (using Poisson 99% CI).\njoint_fafmax\n: Information about the genetic ancestry group with the maximum filtering allele frequency across both exomes and genomes. Note that the values in array will correspond to the joint or combined value if the variant had a defined filtering allele frequency in both data types, otherwise this array will contain filtering allele frequencies only for the data type associated with the Hail Table (in this case, exomes).\nfaf95_max\n: Maximum filtering allele frequency (using Poisson 95% CI) across both exomes and genomes.\nfaf95_max_gen_anc\n: Genetic ancestry group with the maximum filtering allele frequency (95% CI) across both exomes and genomes.\nfaf99_max\n: Maximum filtering allele frequency (using Poisson 99% CI) across both exomes and genomes.\nfaf99_max_gen_anc\n: Genetic ancestry group with the maximum filtering allele frequency (99% CI) across both exomes and genomes.\njoint_fafmax_data_type\n: Data type associated with joint FAF information. Value will be \"both\" if variant had a defined FAF in both the exomes and genomes, otherwise will be either \"exomes\" or \"genomes\".\na_index\n: The original index of this alternate allele in the multiallelic representation (1 is the first alternate allele or the only alternate allele in a biallelic variant).\nwas_split\n: True if this variant was originally multiallelic, otherwise False.\nrsid\n: dbSNP reference SNP identification (rsID) numbers.\nfilters\n: Variant filters; AC0: Allele count is zero after filtering out low-confidence genotypes (GQ < 20; DP < 10; and AB < 0.2 for het calls), AS_VQSR: Failed allele-specific VQSR filtering thresholds of -4.0598 for SNPs and 0.1078 for indels, InbreedingCoeff: GATK InbreedingCoeff < -0.3. An empty set in this field indicates that the variant passed all variant filters.\ninfo\n: Struct containing typical GATK allele-specific (AS) info fields and additional variant QC fields.\nFS\n: Phred-scaled p-value of Fisher's exact test for strand bias.\nMQ\n: Root mean square of the mapping quality of reads across all samples.\nMQRankSum\n: Z-score from Wilcoxon rank sum test of alternate vs. reference read mapping qualities.\nQUALapprox\n: Sum of PL[0] values; used to approximate the QUAL score.\nQD\n: Variant call confidence normalized by depth of sample reads supporting a variant.\nReadPosRankSum\n: Z-score from Wilcoxon rank sum test of alternate vs. reference read position bias.\nSB\n: Aggregate counts of strand depth across all non-homozygous-reference calls. The values are the of the depth of reference allele on forward strand, depth of the reference allele on reverse strand, depth of all alternate alleles on forward strand, depth of all alternate alleles on reverse strand.\nSOR\n: Strand bias estimated by the symmetric odds ratio test.\nVarDP\n: Depth over variant genotypes (does not include depth of reference samples).\nAS_FS\n: Allele-specific phred-scaled p-value of Fisher's exact test for strand bias.\nAS_MQ\n: Allele-specific root mean square of the mapping quality of reads across all samples.\nAS_MQRankSum\n: Allele-specific z-score from Wilcoxon rank sum test of alternate vs. reference read mapping qualities.\nAS_pab_max\n: Maximum p-value over callset for binomial test of observed allele balance for a heterozygous genotype, given expectation of 0.5.\nAS_QUALapprox\n: Allele-specific sum of PL[0] values; used to approximate the QUAL score.\nAS_QD\n: Allele-specific variant call confidence normalized by depth of sample reads supporting a - variant.\nAS_ReadPosRankSum\n: Allele-specific z-score from Wilcoxon rank sum test of alternate vs. reference read position bias.\nAS_SB_TABLE\n: Allele-specific forward/reverse read counts for strand bias tests.\nAS_SOR\n: Allele-specific strand bias estimated by the symmetric odds ratio test.\nAS_VarDP\n: Allele-specific depth over variant genotypes (does not include depth of reference samples).\nsingleton\n: Variant is seen once in the callset.\ntransmitted_singleton\n: Variant was a callset-wide doubleton that was transmitted within a family from a parent to a child (i.e., a singleton amongst unrelated samples in cohort).\nsibling_singleton\n: Variant was a callset-wide doubleton that was present only in two siblings (i.e., a singleton amongst unrelated samples in cohort).\nHolder for sib singletons\nomni\n: Variant is present on the Omni 2.5 genotyping array and found in 1000 Genomes data.\nmills\n: Indel is present in the Mills and Devine data.\nmonoallelic\n: All samples are homozygous alternate for the variant.\nonly_het\n: All samples are heterozygous for the variant (no homozygous reference or alternate genotype calls).\nAS_VQSLOD\n: Allele-specific log-odds ratio of being a true variant versus being a false positive under the trained VQSR Gaussian mixture model.\ninbreedingcoeff\n: Inbreeding coefficient, the excess heterozygosity at a variant site, computed as 1 - (the number of heterozygous genotypes) / (the number of heterozygous genotypes expected under Hardy-Weinberg equilibrium).\nvrs\n: Struct containing information related to the Global Alliance for Genomic Health (GA4GH) Variant Representation Specification (\nVRS\n) standard.\nVRS_Allele_IDS\n: The computed identifiers for the GA4GH VRS Alleles corresponding to the values in the alleles column.\nVRS_Starts\n: Interresidue coordinates used as the location starts for the GA4GH VRS Alleles corresponding to the values in the alleles column.\nVRS_Ends\n: Interresidue coordinates used as the location ends for the GA4GH VRS Alleles corresponding to the values in the alleles column\nVRS_States\n: The literal sequence states used for the GA4GH VRS Alleles corresponding to the values in the alleles column.\nvep\n: Consequence annotations from Ensembl VEP. More details about VEP output is described\nhere\n. VEP was run using the LOFTEE plugin and information about the additional LOFTEE annotations can be found\nhere\n.\nvqsr_results\n: VQSR related variant annotations.\nAS_VQSLOD\n: Allele-specific log-odds ratio of being a true variant versus being a false positive under the trained VQSR Gaussian mixture model.\nAS_culprit\n: Allele-specific worst-performing annotation in the VQSR Gaussian mixture model.\npositive_train_site\n: Variant was used to build the positive training set of high-quality variants for VQSR.\nnegative_train_site\n: Variant was used to build the negative training set of low-quality variants for VQSR.\nallele_info\n: Allele information.\nvariant_type\n: Variant type (snv, indel, multi-snv, multi-indel, or mixed).\nn_alt_alleles\n: Total number of alternate alleles observed at variant locus.\nhas_star\n: Variant type included an upstream deletion.\nallele_type\n: Allele type (snv, insertion, deletion, or mixed).\nwas_mixed\n: Variant type was mixed.\nregion_flags\n: Struct containing flags about regions.\nnon_par\n: Variant falls within a non-pseudoautosomal region.\nlcr\n: Variant falls within a low complexity region.\nsegdup\n: Variant falls within a segmental duplication region.\nfail_interval_qc\n: Less than 85% of samples meet 20X coverage if variant is in autosomal or PAR region or 10X coverage for non-PAR regions of chromosomes X and Y.\noutside_ukb_capture_region\n: Variant falls outside of UK Biobank exome capture regions.\noutside_broad_capture_region\n: Variant falls outside of Broad exome capture regions.\nhistograms\n: Variant information histograms.\nqual_hists\n: Genotype quality metric histograms for high quality genotypes.\ngq_hist_all\n: Histogram for GQ calculated on high quality genotypes.\nbin_edges\n: Bin edges for the GQ histogram calculated on high quality genotypes are: 0|5|10|15|20|25|30|35|40|45|50|55|60|65|70|75|80|85|90|95|100.\nbin_freq\n: Bin frequencies for the GQ histogram calculated on high quality genotypes. The number of records found in each bin.\nn_smaller\n: Count of GQ values falling below the lowest histogram bin edge, calculated on high quality genotypes.\nn_larger\n: Count of GQ values falling above the highest histogram bin edge, calculated on high quality genotypes.\ndp_hist_all\n: Histogram for DP calculated on high quality genotypes.\nbin_edges\n: Bin edges for the DP histogram calculated on high quality genotypes are: 0|5|10|15|20|25|30|35|40|45|50|55|60|65|70|75|80|85|90|95|100.\nbin_freq\n: Bin frequencies for the DP histogram calculated on high quality genotypes. The number of records found in each bin.\nn_smaller\n: Count of DP values falling below the lowest histogram bin edge, calculated on high quality genotypes.\nn_larger\n: Count of DP values falling above the highest histogram bin edge, calculated on high quality genotypes.\ngq_hist_alt\n: Histogram for GQ in heterozygous individuals calculated on high quality genotypes.\nbin_edges\n: Bin edges for the histogram of GQ in heterozygous individuals calculated on high quality genotypes are: 0|5|10|15|20|25|30|35|40|45|50|55|60|65|70|75|80|85|90|95|100.\nbin_freq\n: Bin frequencies for the histogram of GQ in heterozygous individuals calculated on high quality genotypes. The number of records found in each bin.\nn_smaller\n: Count of GQ values in heterozygous individuals falling below the lowest histogram bin edge, calculated on high quality genotypes.\nn_larger\n: Count of GQ values in heterozygous individuals falling above the highest histogram bin edge, calculated on high quality genotypes.\ndp_hist_alt\n: Histogram for DP in heterozygous individuals calculated on high quality genotypes.\nbin_edges\n: Bin edges for the histogram of DP in heterozygous individuals calculated on high quality genotypes are: 0|5|10|15|20|25|30|35|40|45|50|55|60|65|70|75|80|85|90|95|100.\nbin_freq\n: Bin frequencies for the histogram of DP in heterozygous individuals calculated on high quality genotypes. The number of records found in each bin.\nn_smaller\n: Count of DP values in heterozygous individuals falling below the lowest histogram bin edge, calculated on high quality genotypes.\nn_larger\n: Count of DP values in heterozygous individuals falling above highest histogram bin edge, calculated on high quality genotypes.\nab_hist_alt\n: Histogram for AB in heterozygous individuals calculated on high quality genotypes.\nbin_edges\n: Bin edges for the histogram of AB in heterozygous individuals calculated on high quality genotypes are: 0.00|0.05|0.10|0.15|0.20|0.25|0.30|0.35|0.40|0.45|0.50|0.55|0.60|0.65|0.70|0.75|0.80|0.85|0.90|0.95|1.00.\nbin_freq\n: Bin frequencies for the histogram of AB in heterozygous individuals calculated on high quality genotypes. The number of records found in each bin.\nn_smaller\n: Count of AB values in heterozygous individuals falling below the lowest histogram bin edge, calculated on high quality genotypes.\nn_larger\n: Count of AB values in heterozygous individuals falling above the highest histogram bin edge, calculated on high quality genotypes.\nraw_qual_hists\n: Genotype quality metric histograms for all genotypes as opposed to high quality genotypes.\ngq_hist_all\n: Histogram for GQ calculated on all genotypes.\nbin_edges\n: Bin edges for the GQ histogram calculated on all genotypes are: 0|5|10|15|20|25|30|35|40|45|50|55|60|65|70|75|80|85|90|95|100.\nbin_freq\n: Bin frequencies for the GQ histogram calculated on all genotypes. The number of records found in each bin.\nn_smaller\n: Count of GQ values falling below lowest histogram bin edge, for GQ calculated on all genotypes.\nn_larger\n: Count of GQ values falling above highest histogram bin edge, for GQ calculated on all genotypes.\ndp_hist_all: Histogram for DP calculated on all genotypes.\nbin_edges: Bin edges for the DP histogram calculated on all genotypes are: 0|5|10|15|20|25|30|35|40|45|50|55|60|65|70|75|80|85|90|95|100\nbin_freq\n: Bin frequencies for the DP histogram calculated on all genotypes. The number of records found in each bin.\nn_smaller\n: Count of DP values falling below lowest histogram bin edge, for DP calculated on all genotypes.\nn_larger\n: Count of DP values falling above highest histogram bin edge, for DP calculated on all genotypes.\ngq_hist_alt\n: Histogram for GQ in heterozygous individuals calculated on all genotypes.\nbin_edges\n: Bin edges for the histogram of GQ in heterozygous individuals calculated on all genotypes are: 0|5|10|15|20|25|30|35|40|45|50|55|60|65|70|75|80|85|90|95|100.\nbin_freq\n: Bin frequencies for the histogram of GQ in heterozygous individuals calculated on all genotypes. The number of records found in each bin.\nn_smaller\n: Count of GQ values in heterozygous individuals falling below lowest histogram bin edge, calculated on all genotypes.\nn_larger\n: Count of GQ values in heterozygous individuals falling above highest histogram bin edge, calculated on all genotypes.\ndp_hist_alt\n: Histogram for DP in heterozygous individuals calculated on all genotypes.\nbin_edges\n: Bin edges for the histogram of DP in heterozygous individuals calculated on all genotypes are: 0|5|10|15|20|25|30|35|40|45|50|55|60|65|70|75|80|85|90|95|100.\nbin_freq\n: Bin frequencies for the histogram of DP in heterozygous individuals calculated on all genotypes. The number of records found in each bin.\nn_smaller\n: Count of DP values in heterozygous individuals falling below lowest histogram bin edge, calculated on all genotypes.\nn_larger\n: Count of DP values in heterozygous individuals falling above highest histogram bin edge, calculated on all genotypes.\nab_hist_alt\n: Histogram for AB in heterozygous individuals calculated on all genotypes.\nbin_edges\n: Bin edges for the histogram of AB in heterozygous individuals calculated on all genotypes are: 0.00|0.05|0.10|0.15|0.20|0.25|0.30|0.35|0.40|0.45|0.50|0.55|0.60|0.65|0.70|0.75|0.80|0.85|0.90|0.95|1.00.\nbin_freq\n: Bin frequencies for the histogram of AB in heterozygous individuals calculated on all genotypes. The number of records found in each bin.\nn_smaller\n: Count of AB values in heterozygous individuals falling below lowest histogram bin edge, calculated on all genotypes.\nn_larger\n: Count of AB values in heterozygous individuals falling above highest histogram bin edge, calculated on all genotypes.\nage_hists\n: Histograms containing age information for release samples.\nage_hist_het\n: Histogram for age in all heterozygous release samples calculated on high quality genotypes.\nbin_edges\n: Bin edges for the age histogram.\nbin_freq\n: Bin frequencies for the age histogram. This is the number of records found in each bin.\nn_smaller\n: Count of age values falling below lowest histogram bin edge.\nn_larger\n: Count of age values falling above highest histogram bin edge.\nage_hist_hom\n: Histogram for age in all homozygous release samples calculated on high quality genotypes. If variant is in the pseudoautosomal regions of chrX or chrY, this histogram also includes age counts of hemizygous samples.\nbin_edges\n: Bin edges for the age histogram.\nbin_freq\n: Bin frequencies for the age histogram. This is the number of records found in each bin.\nn_smaller\n: Count of age values falling below lowest histogram bin edge.\nn_larger\n: Count of age values falling above highest histogram bin edge.\nin_silico_predictors\n: Variant prediction annotations. Struct contains prediction scores from multiple in silico predictors for variants that are predicted to be missense, impacting protein function, evolutionarily conserved, or splice-altering. We chose scores for either MANE Select or canonical transcripts if a prediction score was available for multiple transcripts.\ncadd\n:\nScore\nused to predict deleteriousness of SNVs and indels.\nphred\n: CADD Phred-like scaled C-scores ranging from 1 to 99 based on the rank of each variant relative to all possible 8.6 billion substitutions in the human reference genome. Larger values indicate increased predicted deleteriousness.\nraw_score\n: Unscaled CADD scores indicating whether a variant is likely to be \"observed\" (negative values) vs \"simulated\" (positive values). Larger values indicate increased predicted deleteriousness.\nrevel_max\n: An ensemble\nscore\nfor predicting the pathogenicity of missense variants (based on 13 other variant predictors). Score ranges from 0 to 1, and larger values are predicted to be more likely to be deleterious. We prioritize max scores for MANE Select transcripts where possible and otherwise report a score for the canonical transcript.\nsplice_ai_ds_max\n: Maximum delta\nscore\nacross 4 splicing consequences, which reflects the probability of the variant being splice-altering. If a variant was predicted to fall within multiple genes, score is across all relevant genes. Score ranges from 0 to 1. In the SpliceAI paper, a detailed characterization of the delta scores is provided for 0.2 (high recall), 0.5 (recommended), and 0.8 (high precision) cutoffs.\npangolin_largest_ds\n: Largest delta\nscore\nacross 2 splicing consequences, which reflects the probability of the variant being splice-altering. If a variant is predicted to fall within multiple genes, score is across all relevant genes. Note that there is different behavior from spliceAI: splice gain is noted as the increase in splice usage (scores range from 0 to 1) and splice loss as the decrease in splice usage (scores range from 0 to -1). The Pangolin authors proposed a cutoff of >|0.2| for the predicted increase or decrease in splice site usage.\nphylop\n: Base-wise conservation\nscore\nacross the 241 placental mammals in the\nZoonomia\nproject. Score ranges from -20 to 9.28, and reflects acceleration (faster evolution than expected under neutral drift, assigned negative scores) as well as conservation (slower than expected evolution, assigned positive scores).\nsift_max\n:\nScore\nreflecting the scaled probability of the amino acid substitution being tolerated, ranging from 0 to 1. Scores below 0.05 are predicted to impact protein function. We prioritize max scores for MANE Select transcripts where possible and otherwise report a score for the canonical transcript.\npolyphen_max\n:\nScore\nthat predicts the possible impact of an amino acid substitution on the structure and function of a human protein, ranging from 0.0 (tolerated) to 1.0 (deleterious). We prioritize max scores for MANE Select transcripts where possible and otherwise report a score for the canonical transcript.\ngnomAD v4.0 genomes Hail Table annotations\nThe v4 genomes Hail Table annotation schema is the same as the exomes schema, with only a few minor differences:\nGlobal fields\ninterval_qc_parameters\n: Only the v4 exomes HT has this global annotation\nRow fields\nfafmax\n: This annotation is stratified by subset in the v4 exomes, but the v4 genomes annotation does not have any subset stratification\njoint\nfrequency\nfields: These annotations will have the joint or combined exome and genome annotations on both release Hail Tables if the variant was present in both data types. If the variant was only present in one data type, then the annotation will contain the frequency information for just that data type (e.g., the 'joint_freq' will contain frequency information for genomes only on the v4 genomes Hail Table if that variant was only seen in the genomes\nregion_flags\n: The v4 exomes Hail Table has the following fields that are not present in the struct on the v4 genomes Hail Table:\nfail_interval_qc\noutside_ukb_capture_region\noutside_broad_capture_region\nallele_info\n: The v4 exomes Hail Table has an additional field in this struct, 'has_star', that is not present in the struct on the v4 genomes Hail Table\ninfo\n: Sibling singletons were used to train the variant QC models for the v4 exomes but were not used in the v4 genomes variant QC\nExpand to see details for past versions\nCategory\nDefinition\n2.1 Options\n3.1 Options\ngroup\nGenotype's filter\nraw\nadj\n1\n, raw\nsex\nInferred sex/sex karyotype\n2\nfemale, male\nXX, XY\nsubset\nSample subsets within release\ngnomad\n,\ncontrols\n,\nnon_neuro\n,\nnon_topmed\n,\nnon_cancer\n(exomes only)\nnon_v2\n, non_topmed,\nnon_neuro\n,\nnon_cancer\n,\ncontrols_and_biobanks\npop\ngnomAD inferred global ancestry\nafr\n,\nami\n,\namr\n,\nasj\n,\neas\n,\nfin\n,\nnfe\n,\noth\n,\nsas\nafr\n,\nami\n,\namr\n,\nasj\n,\neas\n,\nfin\n,\nmid\n,\nnfe\n,\noth\n,\nsas\nsubpops\ngnomAD inferred sub-continental ancestries\nExomes\n:\nnfe options\n:\nbgr\n,\nest\n,\nnwe\n,\nonf\n,\nseu\n,\nswe\neas options\n:\nkor\n,\njpn\n,\noea\nGenomes\n:\nnfe options\n:\nest\n,\nnwe\n,\nseu\n,\nonf\nN/A\npop\n(1KG subset only)\nThe 1KG project's population labels\nN/A\nacb\n,\nasw\n,\nbeb\n,\ncdx\n,\nceu\n,\nchb\n,\nchs\n,\nclm\n,\nesn\n,\nfin\n,\ngbr\n,\ngih\n,\ngwd\n,\nibs\n,\nitu\n,\njpt\n,\nkhv\n,\nlwk\n,\nmsl\n,\nmxl\n,\npel\n,\npjl\n,\npur\n,\nstu\n,\ntsi\n,\nyri\npop\n(HGDP subset only)\nThe HGDP's population labels\nN/A\nadygei, balochi, bantukenya, bantusafrica, basque, bedouin, biakapygmy, brahui, burusho, cambodian, colombian, dai, daur, druze, french, han, hazara, hezhen, italian, japanese, kalash, karitiana, lahu, makrani, mandenka, maya, mbutipygmy, melanesian, miaozu, mongola, mozabite, naxi, orcadian, oroqen, palestinian, papuan, pathan, pima, russian, san, sardinian, she, sindhi, surui, tu, tujia, tuscan, uygur, xibo, yakut, yizu, yoruba\ndownsampling\nDownsampled sample counts\nN/A\n10, 20, 50, 100, 158, 200, 456, 500, 1000, 1047, 1736, 2000, 2419, 2604, 5000, 5316, 7647, 10000, 15000, 20000, 25000, 30000, 34029 40000, 50000, 60000, 70000, 75000\nVersion 2.1 sample grouping combinations and\nfreq\narray access\nThe available v2.1 grouping combinations within the '\nfreq\n' array annotation are listed below. To access the full callset's data, use “\ngnomad\n” as the subset. Raw frequency information is only available for subsets; adj\n1\nfrequency information is provided for all other combinations and does not need to be specified.\nsubset\n, e.g. “\ngnomad\n”\nsubset_group\n, e.g. “\ncontrols_raw\n”\nsubset_pop\n, e.g. “\ngnomad_afr\n”\nsubset_pop_subpop\n, e.g. “\nnon_topmed_eas_jpn\n”\nsubset_pop_sex\n, e.g. “\nnon_neuro_nfe_female\n”\nTo access the 'freq' array using the '\nfreq_index_dict\n', you need to retrieve the value of your desired label combination key. The example below accesses the entry of the high quality genotypes of XX individuals (sex: female2) labeled as\nAFR\n(pop:\nAFR\n) in the entire callset (subset: gnomad) for gnomAD v2.1.1 genomes:\n# Load the v2.1.1 public release HT\nfrom gnomad.resources.grch37.gnomad import public_release\nht = public_release(“genomes”).ht()\n\n# Use the key 'gnomad_afr_female' to retrieve the index of this group's frequency data in 'freq'\nht = ht.annotate(afr_XX_freq=ht.freq[ht.freq_index_dict['gnomad_afr_female']])\nThe above example will retrieve the entire frequency struct for each variant. To grab a certain statistic, such as AC, specify the statistic after the value:\nht = ht.annotate(afr_XX_AC=ht.freq[ht.freq_index_dict['gnomad_afr_female']].AC)\nThis same approach can be applied to the filtering allele frequency (FAF) array, '\nfaf\n', by using the '\nfaf_index_dict\n'.\nVersion 3.1 sample grouping combinations and\nfreq\narray access\nThe available v3 grouping combinations within the 'freq' array annotation are listed below. Unlike v2.1, adj1 must be provided as the “group” for all combinations except when requesting raw frequency information, which is only available for the main callset and subsets.\ngroup\n, e.g. “\nadj\n”, “\nraw\n”\nsex-group\n, e.g. “\nXX-adj\n”\nsubset-group\n, e.g. “\nnon_v2-raw\n”\npop-group\n, e.g. “\nafr-adj\n”\npop-sex-group\n, e.g. “\nami-XX-adj\n”\ndownsampling<sub>3</sub>-group-pop\n, e.g. “\n200-adj-eas\n”,\nsubset-pop<sub>4</sub>-group\n, e.g. “\nnon_topmed-sas-adj\n”\nsubset-sex-group\n, e.g. “\nnon_cancer-XY-adj\n”\nsubset-pop4-sex-group\n, e.g. “\ncontrols_and_biobanks-mid-XX-adj\n”,\nTo access the '\nfreq\n' array using the '\nfreq_index_dict\n', you need to retrieve the value of your desired label combination key. The example below accesses the entry of the high quality genotypes (group: adj) of XX individuals (sex: XX) labeled as AFR (pop: AFR) in gnomAD v3.1.2:\n# Load the v3.1.2 public release HT\nfrom gnomad.resources.grch38.gnomad import public_release\nht = public_release(“genomes”).ht()\n\n# Use the key 'afr-XX-adj' to retrieve the index of this groups frequency data in 'freq'\nht = ht.annotate(afr_XX_freq=ht.freq[ht.freq_index_dict['afr-XX-adj']])\nThe above example will retrieve the entire frequency struct for each variant. To grab a certain statistic, such as AC, specify the statistic after the value:\nht = ht.annotate(afr_XX_AC=ht.freq[ht.freq_index_dict['afr-XX-adj']].AC)\nThis same approach can be applied to the filtering allele frequency (FAF) array, '\nfaf\n', by using the '\nfaf_index_dict\n'.\nIncludes only genotypes with depth >= 10, genotype quality >= 20 and minor allele balance > 0.2 for heterozygous genotypes.\nThe labels we use to classify individuals by chromosomal sex changed from “male” and “female” to “XY” and “XX.” More details available in this\nblog post\n.\nSome downsamplings exceed population counts and thus are not available for those populations.\nFor HGDP and 1KG subsets, project specified populations are available in place of gnomAD inferred global populations. The HGDP populations are detailed\nhere\n. The 1KG populations are described\nhere\n.\nHail Table annotation descriptions\nThe gnomAD v3 Hail Table annotations are defined below:\nGlobal fields\n:\nfreq_meta\n: Allele frequency metadata. An ordered list containing the frequency aggregation group for each element of the ‘freq’ array row annotation.\nfreq_index_dict\n: Dictionary keyed by specified label grouping combinations (group: adj/raw, pop: gnomAD inferred global population, sex: sex karyotype), with values describing the corresponding index of each grouping entry in the ‘freq’ array row annotation.\nfaf_index_dict\n: Dictionary keyed by specified label grouping combinations (group: adj/raw, pop: gnomAD inferred global population, sex: sex karyotype), with values describing the corresponding index of each grouping entry in the filtering allele frequency (‘faf’) row annotation.\nfaf_meta\n: Filtering allele frequency metadata. An ordered list containing the frequency aggregation group for each element of the ‘faf’ array row annotation.\nVEP version\n: VEP version that was run on the callset.\nvep_csq_header\n: VEP header for VCF export.\ndbsnp_version\n: dbSNP version used in the callset.\nfiltering_model\n: The variant filtering model used and its specific cutoffs.\nmodel_name\n: Variant filtering model name used in the 'filters' row annotation, indicating the variant was filtered by this model during variant QC.\nscore_name\n: Annotation name of the score used for variant filtering.\nsnv_cutoff\n: SNV filtering cutoff information.\nbin\n: Filtering percentile cutoff for SNVs.\nmin_score\n: Minimum score at SNV filtering percentile cutoff.\nindel_cutoff\n: Indel filtering cutoff information.\nbin\n: Filtering percentile cutoff for indels.\nmin_score\n: Minimum score at indel filtering percentile cutoff.\nmodel_id\n: Variant filtering model ID for score data (used for internal specification of the model).\nsnv_training_variables\n: Variant annotations used as features in the SNV filtering model.\nindel_training_variables\n: Variant annotations used as features in the indel filtering model.\nage_distribution\n: Callset-wide age histogram calculated on release samples.\nbin_edges\n: Bin edges for the age histogram.\nbin_freq\n: Bin frequencies for the age histogram. This is the number of records found in each bin.\nn_smaller\n: Count of age values falling below lowest histogram bin edge.\nn_larger\n: Count of age values falling above highest histogram bin edge.\nfreq_sample_count\n: A sample count per sample grouping defined in the 'freq_meta' global annotation.\nRow fields\n:\nlocus\n: Variant locus. Contains contig and position information.\nalleles\n: Variant alleles.\nfreq\n: Array of allele frequency information (AC, AN, AF, homozygote count) for each frequency aggregation group in the gnomAD release.\nAC\n: Alternate allele count in release.\nAF\n: Alternate allele frequency, (AC/AN), in release.\nAN\n: Total number of alleles in release.\nhomozygote_count\n: Count of homozygous alternate individuals in release.\nraw_qual_hists\n: Genotype quality metric histograms for all genotypes as opposed to high quality genotypes.\ngq_hist_all\n: Histogram for GQ calculated on all genotypes.\nbin_edges\n: Bin edges for the GQ histogram calculated on all genotypes are: 0|5|10|15|20|25|30|35|40|45|50|55|60|65|70|75|80|85|90|95|100.\nbin_freq\n: Bin frequencies for the GQ histogram calculated on all genotypes. The number of records found in each bin.\nn_smaller\n: Count of GQ values falling below lowest histogram bin edge, for GQ calculated on all genotypes.\nn_larger\n: Count of GQ values falling above highest histogram bin edge, for GQ calculated on all genotypes.\ndp_hist_all\n: Histogram for DP calculated on all genotypes.\nbin_edges\n: Bin edges for the DP histogram calculated on all genotypes are: 0|5|10|15|20|25|30|35|40|45|50|55|60|65|70|75|80|85|90|95|100\nbin_freq\n: Bin frequencies for the DP histogram calculated on all genotypes. The number of records found in each bin.\nn_smaller\n: Count of DP values falling below lowest histogram bin edge, for DP calculated on all genotypes.\nn_larger\n: Count of DP values falling above highest histogram bin edge, for DP calculated on all genotypes.\ngq_hist_alt\n: Histogram for GQ in heterozygous individuals calculated on all genotypes.\nbin_edges\n: Bin edges for the histogram of GQ in heterozygous individuals calculated on all genotypes are: 0|5|10|15|20|25|30|35|40|45|50|55|60|65|70|75|80|85|90|95|100.\nbin_freq\n: Bin frequencies for the histogram of GQ in heterozygous individuals calculated on all genotypes. The number of records found in each bin.\nn_smaller\n: Count of GQ values in heterozygous individuals falling below lowest histogram bin edge, calculated on all genotypes.\nn_larger\n: Count of GQ values in heterozygous individuals falling above highest histogram bin edge, calculated on all genotypes.\ndp_hist_alt\n: Histogram for DP in heterozygous individuals calculated on all genotypes.\nbin_edges\n: Bin edges for the histogram of DP in heterozygous individuals calculated on all genotypes are: 0|5|10|15|20|25|30|35|40|45|50|55|60|65|70|75|80|85|90|95|100.\nbin_freq\n: Bin frequencies for the histogram of DP in heterozygous individuals calculated on all genotypes. The number of records found in each bin.\nn_smaller\n: Count of DP values in heterozygous individuals falling below lowest histogram bin edge, calculated on all genotypes.\nn_larger\n: Count of DP values in heterozygous individuals falling above highest histogram bin edge, calculated on all genotypes.\nab_hist_alt\n: Histogram for AB in heterozygous individuals calculated on all genotypes.\nbin_edges\n: Bin edges for the histogram of AB in heterozygous individuals calculated on all genotypes are: 0.00|0.05|0.10|0.15|0.20|0.25|0.30|0.35|0.40|0.45|0.50|0.55|0.60|0.65|0.70|0.75|0.80|0.85|0.90|0.95|1.00.\nbin_freq\n: Bin frequencies for the histogram of AB in heterozygous individuals calculated on all genotypes. The number of records found in each bin.\nn_smaller\n: Count of AB values in heterozygous individuals falling below lowest histogram bin edge, calculated on all genotypes.\nn_larger\n: Count of AB values in heterozygous individuals falling above highest histogram bin edge, calculated on all genotypes.\ngrpmax\n: Allele frequency information (AC, AN, AF, homozygote count) for the non-bottlenecked genetic ancestry group with maximum allele frequency. Excludes Amish (ami), Ashkenazi Jewish (asj), European Finnish (fin), Middle Eastern (mid), and \"Other\" (oth) group.\nAC\n: Alternate allele count in the population with the maximum allele frequency.\nAF\n: Maximum alternate allele frequency, (AC/AN), across populations in gnomAD.\nAN\n: Total number of alleles in the population with the maximum allele frequency.\nhomozygote_count\n: Count of homozygous individuals in the population with the maximum allele frequency.\npop\n: Population with maximum allele frequency\nfaf95\n: Filtering allele frequency (using Poisson 95% CI) for the population with the maximum allele frequency.\nqual_hists\n: Genotype quality metric histograms for high quality genotypes.\ngq_hist_all\n: Histogram for GQ calculated on high quality genotypes.\nbin_edges\n: Bin edges for the GQ histogram calculated on high quality genotypes are: 0|5|10|15|20|25|30|35|40|45|50|55|60|65|70|75|80|85|90|95|100.\nbin_freq\n: Bin frequencies for the GQ histogram calculated on high quality genotypes. The number of records found in each bin.\nn_smaller\n: Count of GQ values falling below the lowest histogram bin edge, calculated on high quality genotypes.\nn_larger\n: Count of GQ values falling above the highest histogram bin edge, calculated on high quality genotypes.\ndp_hist_all\n: Histogram for DP calculated on high quality genotypes.\nbin_edges\n: Bin edges for the DP histogram calculated on high quality genotypes are: 0|5|10|15|20|25|30|35|40|45|50|55|60|65|70|75|80|85|90|95|100.\nbin_freq\n: Bin frequencies for the DP histogram calculated on high quality genotypes. The number of records found in each bin.\nn_smaller\n: Count of DP values falling below the lowest histogram bin edge, calculated on high quality genotypes.\nn_larger\n: Count of DP values falling above the highest histogram bin edge, calculated on high quality genotypes.\ngq_hist_alt\n: Histogram for GQ in heterozygous individuals calculated on high quality genotypes.\nbin_edges\n: Bin edges for the histogram of GQ in heterozygous individuals calculated on high quality genotypes are: 0|5|10|15|20|25|30|35|40|45|50|55|60|65|70|75|80|85|90|95|100.\nbin_freq\n: Bin frequencies for the histogram of GQ in heterozygous individuals calculated on high quality genotypes. The number of records found in each bin.\nn_smaller\n: Count of GQ values in heterozygous individuals falling below the lowest histogram bin edge, calculated on high quality genotypes.\nn_larger\n: Count of GQ values in heterozygous individuals falling above the highest histogram bin edge, calculated on high quality genotypes.\ndp_hist_alt\n: Histogram for DP in heterozygous individuals calculated on high quality genotypes.\nbin_edges\n: Bin edges for the histogram of DP in heterozygous individuals calculated on high quality genotypes are: 0|5|10|15|20|25|30|35|40|45|50|55|60|65|70|75|80|85|90|95|100.\nbin_freq\n: Bin frequencies for the histogram of DP in heterozygous individuals calculated on high quality genotypes. The number of records found in each bin.\nn_smaller\n: Count of DP values in heterozygous individuals falling below the lowest histogram bin edge, calculated on high quality genotypes.\nn_larger\n: Count of DP values in heterozygous individuals falling above highest histogram bin edge, calculated on high quality genotypes.\nab_hist_alt\n: Histogram for AB in heterozygous individuals calculated on high quality genotypes.\nbin_edges\n: Bin edges for the histogram of AB in heterozygous individuals calculated on high quality genotypes are: 0.00|0.05|0.10|0.15|0.20|0.25|0.30|0.35|0.40|0.45|0.50|0.55|0.60|0.65|0.70|0.75|0.80|0.85|0.90|0.95|1.00.\nbin_freq\n: Bin frequencies for the histogram of AB in heterozygous individuals calculated on high quality genotypes. The number of records found in each bin.\nn_smaller\n: Count of AB values in heterozygous individuals falling below the lowest histogram bin edge, calculated on high quality genotypes.\nn_larger\n: Count of AB values in heterozygous individuals falling above the highest histogram bin edge, calculated on high quality genotypes.\nfaf\n: Filtering allele frequency.\nfaf95\n: Filtering allele frequency (using Poisson 95% CI).\nfaf99\n: Filtering allele frequency (using Poisson 99% CI).\na_index\n: The original index of this alternate allele in the multiallelic representation (1 is the first alternate allele or the only alternate allele in a biallelic variant).\nwas_split\n: True if this variant was originally multiallelic, otherwise False.\nrsid\n: dbSNP reference SNP identification (rsID) numbers.\nfilters\n: Variant filters; AC0: Allele count is zero after filtering out low-confidence genotypes (GQ < 20; DP < 10; and AB < 0.2 for het calls), AS_VQSR: Failed allele-specific VQSR filtering thresholds of -2.7739 for SNPs and -1.0606 for indels, InbreedingCoeff: GATK InbreedingCoeff < -0.3, PASS: Passed all variant filters.\ninfo\n: Struct containing typical GATK allele-specific (AS) info fields and additional variant QC fields.\nQUALapprox\n: Sum of PL[0] values; used to approximate the QUAL score.\nSB\n: Per-sample component statistics which comprise the Fisher's exact test to detect strand bias. Values are: depth of reference allele on forward strand, depth of reference allele on reverse strand, depth of alternate allele on forward strand, depth of alternate allele on reverse strand.\nMQ\n: Root mean square of the mapping quality of reads across all samples.\nMQRankSum\n: Z-score from Wilcoxon rank sum test of alternate vs. reference read mapping qualities.\nVarDP\n: Depth over variant genotypes (does not include depth of reference samples).\nAS_ReadPosRankSum\n: Allele-specific z-score from Wilcoxon rank sum test of alternate vs. reference read position bias.\nAS_pab_max\n: Maximum p-value over callset for binomial test of observed allele balance for a heterozygous genotype, given expectation of 0.5.\nAS_QD\n: Allele-specific variant call confidence normalized by depth of sample reads supporting a variant.\nAS_MQ\n: Allele-specific root mean square of the mapping quality of reads across all samples.\nQD\n: Variant call confidence normalized by depth of sample reads supporting a variant.\nAS_MQRankSum\n: Allele-specific z-score from Wilcoxon rank sum test of alternate vs. reference read mapping qualities.\nFS\n: Phred-scaled p-value of Fisher's exact test for strand bias.\nAS_FS\n: Allele-specific phred-scaled p-value of Fisher's exact test for strand bias.\nReadPosRankSum\n: Z-score from Wilcoxon rank sum test of alternate vs. reference read position bias.\nAS_QUALapprox\n: Allele-specific sum of PL[0] values; used to approximate the QUAL score.\nAS_SB_TABLE\n: Allele-specific forward/reverse read counts for strand bias tests.\nAS_VarDP\n: Allele-specific depth over variant genotypes (does not include depth of reference samples).\nAS_SOR\n: Allele-specific strand bias estimated by the symmetric odds ratio test.\nSOR\n: Strand bias estimated by the symmetric odds ratio test.\nsingleton\n: Variant is seen once in the callset.\ntransmitted_singleton\n: Variant was a callset-wide doubleton that was transmitted within a family from a parent to a child (i.e., a singleton amongst unrelated samples in cohort).\nomni\n: Variant is present on the Omni 2.5 genotyping array and found in 1000 Genomes data.\nmills\n: Indel is present in the Mills and Devine data.\nmonoallelic\n: All samples are homozygous alternate for the variant.\nAS_VQSLOD\n: Allele-specific log-odds ratio of being a true variant versus being a false positive under the trained VQSR Gaussian mixture model.\nInbreedingCoeff\n: Inbreeding coefficient, the excess heterozygosity at a variant site, computed as 1 - (the number of heterozygous genotypes) / (the number of heterozygous genotypes expected under Hardy-Weinberg equilibrium).\nvep\n: Consequence annotations from Ensembl VEP. More details about VEP output is described\nhere\n. VEP was run using the LOFTEE plugin and information about the additional LOFTEE annotations can be found\nhere\n.\nvqsr\n: VQSR related variant annotations.\nAS_VQSLOD\n: Allele-specific log-odds ratio of being a true variant versus being a false positive under the trained VQSR Gaussian mixture model.\nAS_culprit\n: Allele-specific worst-performing annotation in the VQSR Gaussian mixture model.\nNEGATIVE_TRAIN_SITE\n: Variant was used to build the negative training set of low-quality variants for VQSR.\nPOSITIVE_TRAIN_SITE\n: Variant was used to build the positive training set of high-quality variants for VQSR.\nregion_flag\n: Struct containing flags for problematic regions.\nlcr\n: Variant falls within a low complexity region.\nsegdup\n: Variant falls within a segmental duplication region.\nallele_info\n: Allele information.\nvariant_type\n: Variant type (snv, indel, multi-snv, multi-indel, or mixed).\nallele_type\n: Allele type (snv, insertion, deletion, or mixed).\nn_alt_alleles\n: Total number of alternate alleles observed at variant locus.\nwas_mixed\n: Variant type was mixed.\nage_hist_het\n: Histogram for age in all heterozygous release samples calculated on high quality genotypes.\nbin_edges\n: Bin edges for the age histogram.\nbin_freq\n: Bin frequencies for the age histogram. This is the number of records found in each bin.\nn_smaller\n: Count of age values falling below lowest histogram bin edge.\nn_larger\n: Count of age values falling above highest histogram bin edge.\nage_hist_hom\n: Histogram for age in all homozygous release samples calculated on high quality genotypes.\nbin_edges\n: Bin edges for the age histogram.\nbin_freq\n: Bin frequencies for the age histogram. This is the number of records found in each bin.\nn_smaller\n: Count of age values falling below lowest histogram bin edge.\nn_larger\n: Count of age values falling above highest histogram bin edge.\ncadd\n:\nphred\n: Cadd Phred-like scores ('scaled C-scores') ranging from 1 to 99, based on the rank of each variant relative to all possible 8.6 billion substitutions in the human reference genome. Larger values are more deleterious.\nraw_score\n: Raw CADD scores are interpretable as the extent to which the annotation profile for a given variant suggests that the variant is likely to be 'observed' (negative values) vs 'simulated' (positive values). Larger values are more deleterious.\nhas_duplicate\n:Whether the variant has more than one CADD score associated with it.\nrevel\n:\nrevel_score\n: dbNSFP's Revel score from 0 to 1. Variants with higher scores are predicted to be more likely to be deleterious.\nhas_duplicate\n: Whether the variant has more than one revel_score associated with it.\nsplice_ai\n:\nsplice_ai\n: The maximum delta score, interpreted as the probability of the variant being splice-altering.\nsplice_consequence\n: The consequence term associated with the max delta score in 'splice_ai_max_ds'.\nhas_duplicate\n: Whether the variant has more than one splice_ai score associated with it.\nprimate_ai\n:\nprimate_ai_score\n: PrimateAI's deleteriousness score from 0 (less deleterious) to 1 (more deleterious).\nhas_duplicate\n: Whether the variant has more than one primate_ai_score associated with it."
    }
]