[
    {
        "associated data": "associated data   ",
        "title": "The Role of Genetics in the Management of Heart Failure Patients",
        "url": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC10607512",
        "reference_links__associated data": "",
        "reference__associated data": "",
        "abstract": "abstract   Over the last decades, the relevance of genetics in cardiovascular diseases has expanded, especially in the context of cardiomyopathies. Its relevance extends to the management of patients diagnosed with heart failure (HF), given its capacity to provide invaluable insights into the etiology of cardiomyopathies and identify individuals at a heightened risk of poor outcomes. Notably, the identification of an etiological genetic variant necessitates a comprehensive evaluation of the family lineage of the affected patients. In the future, these genetic variants hold potential as therapeutic targets with the capability to modify gene expression. In this complex setting, collaboration among cardiologists, specifically those specializing in cardiomyopathies and HF, and geneticists becomes paramount to improving individual and family health outcomes, as well as therapeutic clinical results. This review is intended to offer geneticists and cardiologists an updated perspective on the value of genetic research in HF and its implications in clinical practice.Keywords:heart failure, genetics, diagnosis, prognosis, therapy",
        "reference_links__abstract": "",
        "reference__abstract": "",
        "introduction": "introduction   Over recent decades, genetics has taken on an increasingly prominent role in the field of cardiovascular diseases, with a specific emphasis on the management of cardiomyopathies. Notably, an increasing number of identified mutations, which affect a range of genes encoding myocardial proteins, have been pinpointed as causative factors for the onset of cardiomyopathies [1]. Such genetic variants carry multiple clinical connotations [2]. From a diagnostic perspective, their presence necessitates screening of the proband’s family members [1,2,3] to assess cosegregation and transmission, and the potential manifestation of cardiomyopathy among family members. Additionally, certain genetic variants hold significant prognostic relevance [4,5], playing a role in determining therapeutic strategies for patients. In the near future, these genetic variants may serve as focal points for gene therapies.Given this evolving landscape, the emergence of cardiomyopathy specialists and dedicated outpatient clinics is becoming more prevalent. Yet, it is vital to highlight that the diagnosis of cardiomyopathy in numerous patients is intrinsically linked to that of a “de novo” heart failure (HF) [6]. In fact, cardiomyopathies stand as one of the leading causes of HF, encompassing cases with both reduced and preserved ejection fraction. Consequently, HF specialists should be increasingly aware of the clinical implications related to the genetics of cardiomyopathies, especially in terms of identifying genetic variants that influence the onset and progression of these conditions.Given the intricacies of this domain, patient management necessitates a multidisciplinary methodology [7,8,9]. Collaboration among cardiologists, with a distinct emphasis on those specializing in cardiomyopathies and HF, as well as geneticists, is paramount to optimizing strategies for individuals, their families, and therapeutic clinical interventions. This review endeavors to present geneticists and cardiologists with an updated perspective on the significance of genetic research in HF and its implications in clinical practice.",
        "reference_links__introduction": "1 /pmc/articles/PMC9375305/, 2 /pmc/articles/PMC8434420/, 1 /pmc/articles/PMC9375305/, 2 /pmc/articles/PMC8434420/, 3 https://pubmed.ncbi.nlm.nih.gov/34906520, 4 //doi.org/10.1016%2Fj.gim.2021.10.020, 5 https://pubmed.ncbi.nlm.nih.gov/31155932, 6 //doi.org/10.1161%2FCIRCULATIONAHA.118.039410, 7 https://pubmed.ncbi.nlm.nih.gov/22281253, 8 //doi.org/10.1016%2Fj.jacc.2011.08.078, 9 https://scholar.google.com/scholar_lookup?journal=J.+Card+Fail.&title=Universal+definition+and+classification+of+heart+failure:+A+report+of+the+Heart+Failure+Society+of+America,+Heart+Failure+Association+of+the+European+Society+of+Cardiology,+Japanese+Heart+Failure+Society+and+Writing+Committee+of+the+Universal+Definition+of+Heart+Failure&author=B.+Bozkurt&author=A.J.+Coats&author=H.+Tsutsui&author=M.+Abdelhamid&author=S.+Adamopoulos&volume=27&publication_year=2021&pages=387-413&",
        "reference__introduction": "Genotype-first approach IFrequency, penetrance, and variable expressivity of dilated cardiomyopathy-associated putative pathogenic gene variants in UK Biobank participants.Circulation.2022;146:110–124., Phenotypic expression and outcomes in individuals with rare genetic variants of hypertrophic cardiomyopathy.JAmCollCardiol.2021;78:1097–1110., Genotype-first approach IFrequency, penetrance, and variable expressivity of dilated cardiomyopathy-associated putative pathogenic gene variants in UK Biobank participants.Circulation.2022;146:110–124., Phenotypic expression and outcomes in individuals with rare genetic variants of hypertrophic cardiomyopathy.JAmCollCardiol.2021;78:1097–1110., Correspondence on “ACMG SF v3.0 list for reporting of secondary findings in clinical exome and genome sequencing: A policy statement of the American College of Medical Genetics and Genomics (ACMG)” by Miller et al.GenetMed, Development and validation of a new risk prediction score for life-threatening ventricular tachyarrhythmias in laminopathies.Circulation.2019;140:293–302., Risk factors for malignant ventricular arrhythmias in lamin A/C mutation carriers a European cohort study.JAmCollCardiol.2012;59:493–500., Universal definition and classification of heart failure: A report of the Heart Failure Society of America, Heart Failure Association of the European Society of Cardiology, Japanese Heart Failure Society and Writing Committee of the Universal Definition of Heart Failure.JCard Fail, Inpatient detection of cardiac-inherited disease: The impact of improving family history taking.Open Heart, Psychosocial impact of specialized cardiac genetic clinics for hypertrophic cardiomyopathy.GenetMed, Clinical Cardiovascular Genetic Counselors Take a Leading Role in Team-based Variant Classification.JGenetCouns",
        "advancements and applications of genetics in cardiovascular disease": "advancements and applications of genetics in cardiovascular disease   It has been slightly over 20 years since the completion of the Human Genome Project on 14 April 2003 [10]. Thanks to advancements in scientific investigative techniques, we now possess the ability to analyze and interpret data derived from the genome, including complete DNA sequences and the functional interactions between various genes. The introduction of targeted therapy [11,12], or “personalized medicine”, aiming to combine established clinical-pathological indices with cutting-edge molecular profiling [13], emerged from the insights gained through the Human Genome Project. This evolution enables the creation of individualized diagnostic, prognostic, and therapeutic strategies tailored to each patient. Currently, an array of genome-wide platforms is available, which facilitates an exploration of the genome’s influence on the phenotypic and clinical presentation of diseases [14].In light of these developments, there is an augmented imperative to evaluate individual risk factors and nuances among individuals. This is achieved primarily through the development and computation of genomic risk scores (GRSs) [15,16], which enhance precision, efficacy, and predictability concerning potential diseases. Identifying individuals at heightened risk for prevalent chronic diseases paves the way for targeted preventive measures, such as increased health monitoring, early therapeutic interventions, lifestyle modifications [17,18], and specialized diagnostic procedures. Furthermore, when combined with risk scores, genetic data can predict a patient’s response to therapy and potential side effects from certain medications. This insight empowers clinicians to select the most appropriate pharmacological treatment and dosage tailored to the patient’s needs.Managing a patient with an inherited cardiovascular disease necessitates consideration of the following crucial factors:Genetics plays a fundamental role in this broad spectrum of pathologies due to the social, economic, and familial burden associated with the condition [25]. When delivering care to an entire family or a set of individuals with a specific genetic variant or phenotype, it is essential to prioritize early risk stratification. This approach is particularly relevant for pinpointing individuals or groups at risk of sudden cardiac death (SCD), symptoms signaling the advancement of HF, or the need for heart transplantation. Some patients might only come to the forefront if the focus remains strictly on treating the proband (the first family member identified by a clinician due to a potential genetic disorder, or the one undergoing genetic testing to confirm the diagnosis). Consequently, it is crucial to delve into genetics on a case-by-case, family-by-family basis. This ensures a comprehensive understanding of each patient’s genetic backdrop, ultimately aiming to proactively address the possible ramifications of the condition, especially in cases of delayed diagnosis.2.1. Assessment of Pathogenic Genetic VariantsEvery individual possesses variants within their genome, ranging from single nucleotide substitutions (single nucleotide variants [SNVs] or single nucleotide polymorphisms [SNPs]) [26,27] to duplications or deletions spanning entire chromosomes. On average, each person carries about 100 de novo SNVs that emerge during their development [27]. Given that protein-coding regions make up roughly 1% of the genome, but contain 85% of disease-causing variants, targeted sequencing frequently focuses on these areas [28].Predominant approaches include sequencing the protein-coding regions of the roughly 20,000 known genes, termed whole-exome sequencing (WES) [29] or focusing on a select set of genes associated with a specific clinical condition, often called a “gene panel” (typically focusing on exons only) [30]. These techniques can identify minor variants, such as SNVs and minor insertions and deletions. However, the identification of larger and more intricate variants, such as the complete deletion of an exon or complex genomic rearrangements, can be more challenging [31,32].The Sanger sequencing technique has been widely used since 1977 for direct sequencing of specific genes. It also serves to validate mutations detected by alternate sequencing approaches and is pivotal in genetic investigations, particularly when a mutated gene is already identified within a family lineage [29,33]. With the advent of next-generation sequencing (NGS) techniques [34] in the early 2000s [35,36], there has been a shift toward methods that bolster sequencing for increased parallelism and scalability. Presently, high-throughput sequencing stands as the predominant method in many diagnostic contexts [37,38].NGS techniques are adept at detecting small variants, including SNVs and minor insertions and deletions. These techniques comprise the following:TGP (targeted gene panel): this method examines genes linked to a specific phenotype. However, its scope is primarily confined to selected genes known for their variants, necessitating ongoing updates. The process entails designing a gene panel correlated with a distinct disease and conducting parallel sequencing. It is commonly employed as the primary diagnostic test for probands [31,39].WES: this method is adept at diagnosing probands presenting with diverse disorders, including pediatric and syndromic cardiomyopathies. It encompasses all genes with the objective of sequencing the complete exome. Through an integrated process, data corresponding to the entire exome can be produced, eliminating the need for additional analyses when updated information becomes available [40,41].Whole-genome sequencing (WGS): this technique sequences the complete genome, offering diagnostic insights for probands with varied disorders and detailed data on pharmacokinetic variants. While comprehensive, WGS comes with a greater expense and necessitates intricate data analysis. If panel sequencing yields negative results, both WES and WGS stand as viable subsequent diagnostic options [42].Table 1summarizes characteristics, advantages, and disadvantages of each technique.Table 1Characteristics, advantages, and disadvantages of the most used techniques for detection of genetic variants.TechniqueCharacteristicApplicationsAdvantageDisadvantagesWESSequencing of the entire exonic genome portionMendelian diseases with unknown genesMultifactorial diseasesIdentification of such susceptible genesCan be re-evaluated in the future, even in the case of a negative resultLess expensive than WGSNot very sensitiveInterpretation of VUSWGSSequencing of the entire genome, both exonic and intronicMendelian diseases with unknown genesMultifactorial diseasesIdentification of such susceptible genesGene regulation studiesCan be re-evaluated in the future, even in the case of a negative resultNot very sensitiveNeed for adequate data collection platformsThe most expensiveTGPPanel of known genes that can be sequenced simultaneouslyTwo types:Mendelian diseases with known genesPolygenic diseasesThe most sensitiveCustomizableLowest costInterpretation of VUSNeed to update the panelHigher costs than WES/WGSTargeted Data Analysis Panel constructed with genes known to be associated with a specific disease following a WESExtend the analysis to the rest of the exome in a research contextNeed to carry out a preliminary WESTargeted ResequencingEnrichment of specific genomic regions before sequencingAnalysis of multiple patients at the same timeUse of benchtop sequencersLess expensive than targeted data analysisContinuous update of new genes associated with a pathologyOpen in a separate windowTGP: targeted gene panel; WES: whole exome sequencing; WGS: whole genome sequencing.Alternative quantification approaches that are not based on sequencing include multiplex ligation-dependent probe amplification (MLPA) or array comparative genomic hybridization (aCGH) [32]. These approaches may offer enhanced sensitivity and can complement traditional sequencing methods. Some techniques utilize polymerase chain reaction (PCR) for detecting variants. Allele-specific PCR is an economical and scalable option for specific variant detection. In contrast, digital PCR, encompassing methods such as digital droplet PCR, facilitates precise quantification of target DNA sequence copy numbers relative to a single-copy reference locus. Not only is this technique cost-effective, but it is also adept at detecting subtle dosage variations, making it vital for confirming the existence of potential novel copy number variations (CNVs) identified through sequencing [43].Other genetic investigation techniques involve competitive DNA hybridization using oligonucleotide probes with known sequences. While these approaches might have limited utility in identifying rare variants for Mendelian diagnoses, they are extensively employed in studying common variants. Examples include their application in genome-wide association studies (GWAS), computation of polygenic risk scores (PRSs), and pharmacogenetics [44].2.1.1. Sequencing ModalitiesThe analytical process begins with the collection of a small sample of peripheral blood or saliva from the patient. At times, samples from parents or close family members may also be required. The DNA essential for sequencing is then extracted from this sample. Upon acquiring the sequences, they undergo analysis and interpretation based on the most current genetic data in the international medical-scientific literature, focusing on the relevant diseases or symptoms. Identified pathological variants are subsequently validated in the original sample using alternative technological methods.In the context of targeted NGS (targeted gene panel, TGP), the assessment of diseases with pronounced genetic heterogeneity and recognized genes is undertaken using designated panels. These panels are of two main types:Presequencing panels (targeted resequencing): this approach enables the simultaneous analysis of multiple patients by selectively enriching specific genomic regions prior to sequencing.In silico panels (targeted data analysis): this method is applied after exome sequencing and focuses on genes directly associated with the disease under investigation, generally allowing for the analysis of a restricted number of samples in each run [44].The presequencing panel’s predominant advantage is its cost-effectiveness, attributed to the utilization of desktop sequencers. This method also ensures high coverage in pivotal genomic regions. However, a notable limitation is the consistent requirement to update the panel every time a gene is newly associated with a relevant disease. Conversely, the in-silico panel, while being costlier—given that it typically analyzes only one or two patients simultaneously to attain satisfactory coverage—boasts the benefit of enabling the investigation of newly discovered disease genes in previously sequenced patients. This is achieved without necessitating any alterations to the platform, making it a more economical choice over the long term in comparison to presequencing panels.Five critical factors influence the selection of the appropriate sequencing method (WES, target sequencing, or WGS): cost, purpose, sensitivity, probability of obtaining incidental findings (IFs) and variants of uncertain significance (VUSs), and data storage [45].-Cost: The difference in cost is influenced by the reagents used. The use of TGP is more economical if the number of samples per run is optimized. In economic terms, WGS is the most expensive, and although WES is pricier than panels, it can be advantageous depending on the type of study to be performed [46].-Purpose: Typically, NGS techniques are employed for diseases with high genetic heterogeneity or Mendelian-based genetic diseases (or those suspected to be genetic) where the causative genes remain unidentified. For diseases with established genetic etiology, either custom-designed panels, WES, or WGS can be utilized [45].-Sensitivity: Sensitivity largely depends on the coverage of the sequences under investigation, that is, the number of reads for specific DNA sections and the overlap extent between these reads. A greater number of reads for a specific region translates to higher sensitivity for that DNA segment [45]. During panel analysis, a reduced genome proportion under investigation leads to enhanced coverage and sensitivity. Thus, if a disease is believed to result from a mosaic genomic alteration, NGS panel analysis offers higher sensitivity compared to WES.-IFs and VUSs: The probability of identifying IFs and VUSs depends on the genome proportion both analyzed and queried. Analysis based on panels has a reduced association with IFs, since the investigated sequences are directly relevant to the clinical presentation of the proband. In general, a broader sequence analysis correlates with a higher number of IFs and VUSs. Notably, VUSs can also appear in targeted analyses of specific gene panels [45].-Data storage: The extent of the genome analyzed directly influences the volume of data generated. Consequently, suitable platforms for data storage are essential, particularly for analyses yielding substantial data, such as those conducted via WES and, more prominently, WGS [45].2.1.2. Identification and Interpretation of Pathogenic Genetic Variants in Clinical DiagnosticsVarious software tools, including Bowtie2, BWA, MAQ, and SOAP2, assist in mapping a patient’s sequences to reference sequences found in databases. Through this method, the patient’s exome is aligned, signifying the alignment phase. After successful alignment, sequence variants can be detected, representing all deviations from the human reference sequence for each gene. This process is known as “variant calling”, an operation that is automated within NGS analysis.Upon detecting approximately 140,000 genetic variants in an individual (a figure representative of the average number derived from WES) through the previously mentioned variant calling operation, it becomes essential to determine their clinical significance. These variants are characterized based on the following:Their allele frequency within the general population;Their presence or absence in recognized human mutational databases (such as gnomAD, ClinVar [47], or OMIM [48]); andTheir potential influence on protein function as determined by in silico analyses, which produce computational predictions of protein folding using tools such as PolyPhen [49], MutationTaster [50], or PROVEAN [51].Variants that may have clinical significance are carefully isolated, interpreted, and subsequently reported within a diagnostic framework. The Variant Interpreter software v2.14.0.4 (Illumina) serves as an example tool for this purpose. It facilitates the alignment of sequences to the reference genome (GRCh37/hg19). Additionally, allele frequencies are mapped against the population database gnomAD v2.1.1 (Genome Aggregation Database), all performed automatically by the software.Guidelines set by the American College of Medical Genetics and Genomics dictate that identified variants should be articulated using specific terminologies such as “pathogenic”, “likely pathogenic”, “uncertain significance”, “likely benign”, and “benign” [52]. In the context of WES/WGS studies, a filtering approach is recommended. For variant interpretation, references are primarily drawn from the established scientific literature, databases such as ClinVar, HGMD, and LOVD, as well as dedicated gene- or disease-specific databases when they are accessible. When considering allele frequencies, the gnomAD v2.1.1 population database and the internal laboratory database are typically referenced. It is crucial to note that the nomenclature and classification of variants, especially those labeled as having “uncertain significance”, might undergo changes influenced by updates in reference sequences and emerging scientific findings. During trio analyses, the genomic data of parents are predominantly utilized to determine the inheritance pattern of variants observed in the proband [52]. Furthermore, secondary variants, which might be indicative of phenotypes not directly related to the primary clinical query, are documented when a comprehensive clinic exome analysis is specifically requested and consented to. Confirmatory tests are performed using secondary DNA extraction to validate the potential clinical cause in a patient.2.2. Variants of Uncertain Significance (VUS)A mutation denotes a permanent alteration in the nucleotide sequence, whereas a polymorphism represents a variant with a frequency exceeding 1% in the population. Both terms are now more commonly referred to as “variant”, further defined with specific qualifiers such as “pathogenic”, “likely pathogenic”, “uncertain significance”, “likely benign”, or “benign”. Some laboratories may incorporate additional levels, particularly for internal use, such as subclassifying VUSs. The designations “likely pathogenic” and “likely benign” imply a confidence level greater than 90% that the variant is, respectively, pathogenic or benign. Importantly, at present, there is no robust data that provides a quantitative assignment of variant certainty to any of the five categories, largely due to the varied nature of many diseases. Over time, as experimental and statistical methods evolve, they will offer a more objective means of assessing the pathogenicity of variants. The precision of definitions and the desired confidence levels will continue to evolve based on deeper clinical insights and consensus [52].VUSs are typically overlooked in clinical decision-making, as further information is required to categorize them definitively as either pathogenic or benign. However, the presence of uncertain sarcomere mutations or multiple VUSs in patients with hypertrophic cardiomyopathy (HCM) has been correlated with earlier disease onset and more severe outcomes. Therefore, a deeper understanding of these VUSs becomes imperative for optimized clinical management and better patient outcomes [53]. In an effort to bridge this knowledge gap, experimental tools designed for high-throughput screening of HCM mutations and their pathogenicity have been introduced. These instruments leverage cutting-edge computational methods that harness genetic association networks and polygenic risk prediction models, shedding light on the intricate world of genetic variations linked to diseases. One such tool, VariantClassifier (VarClass), exemplifies this approach [54].CardioBoost uses a disease-specific variant classifier algorithm tailored to predict the pathogenicity of missense variants linked to inherited cardiomyopathies and arrhythmias. One of its distinct advantages is that, when focused on heart disease, this specific variant classifier surpasses the performance of leading whole-genome tools. This superiority underscores the significant potential for improved pathogenicity predictions through disease-specific approaches [55]. On the other hand, some tools harness detailed structural information about proteins, examining how mutations might affect protein folding and stability to make their pathogenicity predictions [53].Advancements in technologies leveraging artificial intelligence have enhanced our ability to determine the pathogenicity of mutations in cardiac sarcomere proteins. Given the existing challenges in validating numerous computational algorithms, a methodological approach was undertaken to benchmark variant prediction capabilities, assessing their efficiency in identifying the potential pathogenicity of variants. Through this assessment, certain algorithms stood out for their proficiency in discerning the pathogenicity of HCM variants. Leading tools in this regard include ClinPred, MISTIC, FATHMM, MPC, and MetaLR. Importantly, the combined use of these high-performing tools markedly improves the accuracy of pinpointing the most pertinent VUSs for subsequent analysis [56].2.3. Classification, Implications, and Clinical Utility of Genetic Variants in Cardiovascular DiseaseWhen a genetic variant correlates with an observed phenotype, laboratories typically categorize it using a five-tier system. If strong evidence supports the variant’s causative role in the condition, it will be labeled as either “pathogenic” or “likely pathogenic”. Conversely, if robust evidence suggests that the variant is not the causative agent for the disease, it will be termed “benign” or “likely benign”. In instances where the evidence is either conflicting or not conclusive, the variant is designated as having “uncertain significance”, often abbreviated as “VUS”. It is crucial to note that VUSs should not be used for cascade testing, and rarely hold clinical significance for the proband [57].Upon identification of a pathogenic or likely pathogenic variant, initiating clinical evaluations and cascade genetic testing for family members is recommended. Family members who test positive for the variant should undergo long-term monitoring, especially if they exhibit the clinical phenotype. In contrast, family members who do not have the variant can generally be exempted from further genetic investigations [22,58].In cases where a VUS is identified, supplementary analyses, such as segregation studies and, where feasible, functional studies, should be conducted. Decisions regarding genetic testing and clinical screenings for family members are based on the findings from these analyses. Equally significant, re-evaluation of other potential causes of the disease is warranted when a genetic variant is absent or a genetic test is inconclusive. Clinical screenings of family members should also be considered. For instances showcasing a typical cardiomyopathy phenotype, long-term monitoring is advised. However, if no other family members are affected, frequent, detailed screenings might be reduced or concluded earlier, while those at higher risk should continue regular screenings [59].PRSs, also known as GRSs, are becoming increasingly relevant in the evaluation of multiple genetic variants [60]. These scores consider variants across the genome, each contributing a small amount to disease risk, to compute a cumulative risk score. However, the definitive clinical utility of PRSs in the management of cardiomyopathies remains to be established [61,62,63,64].In the contemporary medical landscape, identifying a genetic variant or assessing an individual’s susceptibility to genetic diseases equates to equipping the patient or their family with a genetic profile (genotype). This profile subsequently stratifies risk considering the identified genetic variant, related diseases, coexisting health conditions, and resultant manifestations (phenotype). Such stratifications can indicate events such as SCD or the onset of clinically evident HF. Furthermore, this genetic “identity card” can dictate whether a patient receives a recommendation for an implantable cardioverter-defibrillator (ICD) insertion, along with all the consequential implications it entails [65].2.4. Diagnosis and CounselingIncorporating genetics into the care regimen for these patients necessitates a structured follow-up and extended surveillance, both for the proband (the initial patient diagnosed with the condition) and their family. This approach not only fosters a more profound comprehension of the disease, but also paves the way for specific and individualized treatments, thereby enhancing both the patient’s prognosis and their clinical management. When diagnosing a patient with cardiomyopathy through genetic testing, the scope extends beyond merely identifying the patient’s present condition. It encompasses continuous genetic assessments for family members and the initiation of a broad counseling framework for both the patient and their family [66,67,68].For those diagnosed with cardiomyopathy, the genetic trajectory, both for the proband and their relatives, invariably begins with genetic counseling. This step is pivotal, as grappling with an inherited cardiomyopathy can present numerous challenges. Genetic counseling, conducted by healthcare professionals with specific training, strives to assist patients and their families in comprehending and adjusting to the medical, psychosocial, and familial consequences of genetic diseases. It encompasses a range of topics, including understanding inheritance risks, educational sessions on genetic diseases, guidance during genetic testing processes, interpreting genetic variant results, compiling a comprehensive three-generation family medical history, and offering psychosocial support to patients and their families [69].Addressing the communication strategy with family members is a critical component of genetic counseling. The index patient, often referred to as the proband, might choose not to inform at-risk relatives about the inherited condition and the availability of family screening for a variety of reasons [70,71,72]. This situation is concerning, especially given the severe complications and risk of SCD associated with many inherited cardiac conditions. Since many inherited cardiomyopathies exhibit an autosomal dominant inheritance pattern, it is essential to emphasize the importance of both clinical and genetic testing for immediate family members. Barriers to effective communication might encompass strained family dynamics, guilt about potentially transmitting a causative variant to children, associated emotional distress, and difficulty in understanding the implications of results [70,72].Following the identification of a pathogenic or likely pathogenic variant in an index patient through investigations of relevant disease-associated genes specific to the phenotype, cascade genetic testing can be recommended for first-degree relatives at risk. If a first-degree relative is deceased, evaluating close relatives of the deceased individual should also be taken into account. Continuous genetic screening should be considered for descendants of those relatives confirmed to carry a pathogenic or likely pathogenic variant. Relatives lacking the variant can be discharged from further follow-up, while those with the variant should undergo regular clinical evaluations. Improper use of genetic testing within a family might induce undue anxiety and concerns, potentially leading to challenges due to misunderstandings of genetic interpretations [70].2.5. Gene TherapyGene therapy is a prominent strategy within advanced therapies. At its core, it aims to address the root cause of a disease by providing affected cells with a functional version of a gene. Methods of gene editing include RNA therapy, CRISPR/Cas9 techniques, antisense therapies, and the introduction of innovative drugs [73], as summarized inFigure 1. While many clinical phenotypes primarily rely on generic and symptomatic medications, treatments that focus on the underlying cause and offer targeted interventions (specifically, etiology-based and precision therapies) are still in their developmental stages.Open in a separate windowFigure 1The figure summarizes the current approaches of gene therapy.Research on inherited cardiomyopathies has encountered obstacles due to the lack of suitable in vitro human cardiac cell or tissue models, especially those that replicate patient-specific anomalies. A promising solution is the generation of human-induced pluripotent stem cell-derived cardiomyocytes (hiPSC-CMs) that are tailored to individual patients [73].Specialized models of hiPSC-CMs, designed to match specific patients or diseases, have been developed, encompassing mutations in genes encoding cardiac sarcomeric and cytoskeletal proteins, ion channels, nuclear proteins, mitochondrial proteins, and lysosomal proteins. The integration of hiPSC-CM technology with genome-editing methods such as the CRISPR/Cas9 system has yielded deeper insights into the genetic origins of diverse cardiomyopathies, leading to the creation of isogenic control lines [74].Transitioning from a cellular perspective to three-dimensional engineered heart tissues, made possible by integrating polymer-based scaffolds with hiPSC-CMs, offers more clinically relevant models for cardiomyopathy studies [75,76].Furthermore, the capacity to modify DNA through genome editing, especially with the CRISPR/Cas9 system, marks substantial progress in cardiovascular medicine. This spans a better comprehension of genetic diseases and the advancement of targeted therapeutic interventions. CRISPR/Cas9, in particular, is instrumental in therapeutic genome engineering for a range of cardiovascular conditions [77,78,79].For example, gene editing techniques, such as exon skipping, have demonstrated potential in conditions such as Duchenne muscular dystrophy (DMD), in which mutations in thedystrophingene result in the lack of the dystrophin protein [80,81]. Through exon skipping, a truncated but functional protein can be produced. In both animal models and preclinical trials, the application of CRISPR/Cas9 to specifically edit exons in thedystrophingene has shown promise for the future treatment of DMD patients [81].Additionally, nucleic acid-based drugs, especially oligonucleotides, have opened up new avenues for interfering with disease-related genes, either at the genome or gene expression level. These oligonucleotides have the ability to target various facets of gene expression, including RNA blockade, splice switching, and exon skipping. Various nucleic acid-based drugs have been formulated and approved for different diseases, and their potential applications for cardiomyopathies are under investigation.Furthermore, advancements in our understanding of the genetics, epigenetics, and proteomics of cardiomyopathies have paved the way for the development of innovative compounds aimed at previously considered “undruggable” elements. These innovative compounds span a range that includes small molecules, gene-specific therapies, and protein stabilizers. A particular study [82] demonstrated a gene therapy approach that utilized the delivery ofModulator of Growth 1(MOG1) gene through adeno-associated virus serotype 9 (AAV9) vectors to upregulate MOG1 itself. This chaperone molecule interacts with protein NaV1.5, facilitating its transportation to the cell surface. This gene therapy method notably mitigated symptoms of cardiac arrhythmia and contractile dysfunction in heterozygous humanized knock-in (KI) mice possessing the SCN5A p.D1275N mutation. The introduction of such a compact chaperone protein presents promising prospects for addressing genes responsible for diseases, especially those pertinent to conditions such as Brugada syndrome, arrhythmias, and certain forms of cardiomyopathy [82].Table 2showcases several ongoing clinical trials, either recruiting or already completed, underscoring the continual emergence of novel therapeutic hypotheses in scientific research, with a growing emphasis on targeted therapy strategies (http://clinicaltrials.gov[83], accessed on 15 September 2023). The AAV lacks an envelope and can be tailored to deliver DNA to designated cells. Although various natural serotypes of AAV exist with slight biological differences, they can all be managed using a unified protocol.Table 2Ongoing trials evaluating the effects of gene therapy in cardiomyopathies.TechniqueSettingTreatmentGenePhase StudyOngoing Study IDAAVFriedreich’s ataxia DCMAAVrh.10hFXNFrataxin(FXN)I{\"type\":\"clinical-trial\",\"attrs\":{\"text\":\"NCT05302271\",\"term_id\":\"NCT05302271\"}}NCT05302271[84]AAV serotype 1LGMD2DrAAV1.tMCK.hαSGAlpha-sarcoglycan(haSG)I{\"type\":\"clinical-trial\",\"attrs\":{\"text\":\"NCT00494195\",\"term_id\":\"NCT00494195\"}}NCT00494195[85]AAVARVCRP-A601Plakophilin-2a(PKP2a)I{\"type\":\"clinical-trial\",\"attrs\":{\"text\":\"NCT05885412\",\"term_id\":\"NCT05885412\"}}NCT05885412[86]AAV serotype 1Limb girdle muscular dystrophy type 2CGamma-sarcoglycan vector injectionSGCGI{\"type\":\"clinical-trial\",\"attrs\":{\"text\":\"NCT01344798\",\"term_id\":\"NCT01344798\"}}NCT01344798[87]AAVAdv-HFMYDICARSERCA2aI/II{\"type\":\"clinical-trial\",\"attrs\":{\"text\":\"NCT02346422\",\"term_id\":\"NCT02346422\"}}NCT02346422[88]AAV serotype 1CHFAAV1-CMV-SERCA2aSERCA2aII{\"type\":\"clinical-trial\",\"attrs\":{\"text\":\"NCT01966887\",\"term_id\":\"NCT01966887\"}}NCT01966887[89]AAVFriedreich’s ataxia with evidence of cardiomyopathyLX2006 (AAVrh.10hFXN)hFXNI/II{\"type\":\"clinical-trial\",\"attrs\":{\"text\":\"NCT05445323\",\"term_id\":\"NCT05445323\"}}NCT05445323[90]Drug PF-07265803REALM-DCMARRY-371797Lamin A/CIII{\"type\":\"clinical-trial\",\"attrs\":{\"text\":\"NCT03439514\",\"term_id\":\"NCT03439514\"}}NCT03439514[91]AAVMYBPC3 nHCMTN-201MYBPC3I{\"type\":\"clinical-trial\",\"attrs\":{\"text\":\"NCT05836259\",\"term_id\":\"NCT05836259\"}}NCT05836259[92]Genetic (VEGF1)CHFVEGF1phVEGF165I{\"type\":\"clinical-trial\",\"attrs\":{\"text\":\"NCT00279539\",\"term_id\":\"NCT00279539\"}}NCT00279539[93]AAV serotype 9Danon DiseaseRP-A501LAMP2BI{\"type\":\"clinical-trial\",\"attrs\":{\"text\":\"NCT03882437\",\"term_id\":\"NCT03882437\"}}NCT03882437[94]Open in a separate windowAAV: adeno-associated virus gene transfer vector; Adv-HF: advanced heart failure; CHF: chronic heart failure; LGMD2D: limb girdle muscular dystrophy type 2D; REALM-DCM: dilated cardiomyopathy withlamin A/Cgene mutation; SGCG:gamma-sarcoglycan protein.Overall, gene therapies for cardiomyopathies appear promising, opening up possibilities for gene-specific treatments, and even treatments tailored to specific pathogenic variants. Despite existing challenges, continuous research and technological innovations consistently advance our understanding and capabilities in cardiovascular genetics and treatment methodologies.",
        "reference_links__advancements and applications of genetics in cardiovascular disease": "10 /pmc/articles/PMC4762189/, 11 https://pubmed.ncbi.nlm.nih.gov/18281919, 12 //doi.org/10.1097%2FGIM.0b013e3181612cc7, 13 https://pubmed.ncbi.nlm.nih.gov/29234989, 14 //doi.org/10.1007%2Fs10897-017-0175-7, 15 https://pubmed.ncbi.nlm.nih.gov/15496913, 16 //doi.org/10.1038%2Fnature03001, 17 https://pubmed.ncbi.nlm.nih.gov/31513489, 18 //doi.org/10.1161%2FCIRCRESAHA.119.315077, 25 //doi.org/10.1007%2Fs10897-018-0297-6, 26 https://pubmed.ncbi.nlm.nih.gov/20559999, 27 //doi.org/10.1007%2Fs12265-009-9134-5, 27 //doi.org/10.1007%2Fs12265-009-9134-5, 28 https://pubmed.ncbi.nlm.nih.gov/12707239, 29 //doi.org/10.1161%2F01.CIR.0000066323.15244.54, 30 https://pubmed.ncbi.nlm.nih.gov/29661763, 31 //doi.org/10.1161%2FCIRCGEN.117.001896, 32 https://pubmed.ncbi.nlm.nih.gov/19616675, 29 //doi.org/10.1161%2F01.CIR.0000066323.15244.54, 33 //doi.org/10.1016%2Fj.amjcard.2009.03.055, 34 https://pubmed.ncbi.nlm.nih.gov/22128210, 35 //doi.org/10.1136%2Fheartjnl-2011-300368, 36 /pmc/articles/PMC8194370/, 37 https://pubmed.ncbi.nlm.nih.gov/32732075, 38 //doi.org/10.1016%2Fj.amjms.2020.07.004, 31 //doi.org/10.1161%2FCIRCGEN.117.001896, 39 https://pubmed.ncbi.nlm.nih.gov/28912179, 40 //doi.org/10.1161%2FCIRCRESAHA.117.309711, 41 /pmc/articles/PMC3322360/, 42 /pmc/articles/PMC3042601/, 32 https://pubmed.ncbi.nlm.nih.gov/19616675, 43 /pmc/articles/PMC2768590/, 44 /pmc/articles/PMC7405896/, 44 /pmc/articles/PMC7405896/, 45 https://pubmed.ncbi.nlm.nih.gov/28087426, 46 //doi.org/10.1016%2Fj.hrthm.2017.01.010, 45 https://pubmed.ncbi.nlm.nih.gov/28087426, 45 https://pubmed.ncbi.nlm.nih.gov/28087426, 45 https://pubmed.ncbi.nlm.nih.gov/28087426, 45 https://pubmed.ncbi.nlm.nih.gov/28087426, 47 /pmc/articles/PMC6467913/, 48 /pmc/articles/PMC4108431/, 49 /pmc/articles/PMC431765/, 50 https://pubmed.ncbi.nlm.nih.gov/27332903, 51 //doi.org/10.1056%2FNEJMoa1510687, 52 /pmc/articles/PMC1464427/, 52 /pmc/articles/PMC1464427/, 52 /pmc/articles/PMC1464427/, 53 /pmc/articles/PMC2581791/, 54 https://pubmed.ncbi.nlm.nih.gov/25163546, 55 //doi.org/10.1093%2Feurheartj%2Fehu301, 53 /pmc/articles/PMC2581791/, 56 https://pubmed.ncbi.nlm.nih.gov/1727235, 57 //doi.org/10.1056%2FNEJM199201093260201, 22 /pmc/articles/PMC4476546/, 58 /pmc/articles/PMC7253449/, 59 /pmc/articles/PMC6247660/, 60 https://pubmed.ncbi.nlm.nih.gov/27854360, 61 //doi.org/10.1038%2Fgim.2016.190, 62 /pmc/articles/PMC5560080/, 63 /pmc/articles/PMC2715261/, 64 https://pubmed.ncbi.nlm.nih.gov/31112425, 65 //doi.org/10.1161%2FCIRCGEN.119.002510, 66 https://pubmed.ncbi.nlm.nih.gov/24941179, 67 //doi.org/10.1056%2FNEJMra1312543, 68 /pmc/articles/PMC5522848/, 69 https://www.ncbi.nlm.nih.gov/clinvar/, 70 https://www.omim.org, 71 http://genetics.bwh.harvard.edu/pph2/, 72 https://www.mutationtaster.org, 70 https://www.omim.org, 72 https://www.mutationtaster.org, 70 https://www.omim.org, 73 https://www.jcvi.org/research/provean, 73 https://www.jcvi.org/research/provean, 74 /pmc/articles/PMC4544753/, 75 /pmc/articles/PMC10432852/, 76 /pmc/articles/PMC6397233/, 77 /pmc/articles/PMC7790749/, 78 /pmc/articles/PMC9433717/, 79 /pmc/articles/PMC6777462/, 80 https://pubmed.ncbi.nlm.nih.gov/22555655, 81 //doi.org/10.1038%2Fgim.2012.47, 81 //doi.org/10.1038%2Fgim.2012.47, 82 https://pubmed.ncbi.nlm.nih.gov/10448023, 82 https://pubmed.ncbi.nlm.nih.gov/10448023, 83 //doi.org/10.1053%2Feuhj.1999.1677, 84 https://pubmed.ncbi.nlm.nih.gov/33692568, 85 //doi.org/10.1038%2Fs41588-021-00783-5, 86 /pmc/articles/PMC7382531/, 87 /pmc/articles/PMC8240954/, 88 /pmc/articles/PMC6769824/, 89 https://pubmed.ncbi.nlm.nih.gov/32469608, 90 //doi.org/10.1161%2FCIRCGEN.120.002922, 91 https://pubmed.ncbi.nlm.nih.gov/11102258, 92 //doi.org/10.1053%2Feuhj.2000.2476, 93 /pmc/articles/PMC7138527/, 94 https://pubmed.ncbi.nlm.nih.gov/22030325",
        "reference__advancements and applications of genetics in cardiovascular disease": "10 International Human Genome Sequencing Consortium  Finishing the euchromatic sequence of the human genome.Nature.2004;431:931–945doi: 10.1038/nature03001.[PubMed] [CrossRef][Google Scholar], Leducq Transatlantic Network of Excellence to Cure Phospholamban-Induced Cardiomyopathy (CURE-PLaN)CircRes, Phospholamban antisense oligonucleotides improve cardiac function in murine cardiomyopathy.NatCommun.2021;12:5180., A new initiative on precision medicine.NEnglJMed, Genome-wide association studies in pharmacogenomics: Successes and lessons.PharmacogenetGenom, Cumulative effects of common genetic variants on risk of sudden cardiac death.IntJCardiolHeart Vasc.2015;7:88–91., Coronary heart disease genetic risk score predicts cardiovascular disease risk in men, not women.CircGenomPrecis Med, Evolving decisions: Perspectives of active and athletic individuals with inherited heart disease who exercise against recommendations.JGenetCouns, Exercise in hypertrophic cardiomyopathy.JCardiovascTranslRes, Classification, epidemiology, and global burden of cardiomyopathies.CircRes, Variation in genome-wide mutation rates within and between human families.NatGenet, Abecasis G.R., Altshuler D., Auton A., Brooks L.D., Durbin R.M., Gibbs R.A., Hurles M.E., McVean GA map of human genome variation from population-scale sequencing.Nature, Abecasis G.R., Altshuler D., Auton A., Brooks L.D., Durbin R.M., Gibbs R.A., Hurles M.E., McVean GA map of human genome variation from population-scale sequencing.Nature, Genetic diagnosis by whole exome capture and massively parallel DNA sequencing.ProcNatlAcadSciUSA.2009;106:19096–19101., A brief history of human disease genetics.Nature.2020;577:179–189., Next-generation sequencing of a large gene panel in patients initially diagnosed with idiopathic ventricular fibrillation.Heart Rhythm, Multi-platform discovery of haplotype-resolved structural variation in human genomes.NatCommun.2019;10:1784., Genome structural variation discovery and genotyping.NatRevGenet, A brief history of human disease genetics.Nature.2020;577:179–189., DNA sequencing with chain-terminating inhibitors.ProcNatlAcadSciUSA, A prospective study of sudden cardiac death among children and young adults.NEnglJMed.2016;374:2441–2452., Genome sequencing in microfabricated high-density picolitre reactors.Nature.2005;437:376–380., Accurate whole human genome sequencing using reversible terminator chemistry.Nature.2008;456:53–59., Atlas of the clinical genetics of human dilated cardiomyopathy.EurHeart J.2015;36:1123–1135., The frequency of familial dilated cardiomyopathy in a series of patients with idiopathic dilated cardiomyopathy.NEnglJMed, Multi-platform discovery of haplotype-resolved structural variation in human genomes.NatCommun.2019;10:1784., Characterizing the loss-of-function impact of 5’ untranslated region variants in 15,708 individuals.NatCommun.2020;11:2523., Modifier genes for sudden cardiac death.EurHeart J, Recommendations for reporting of secondary findings in clinical exome and genome sequencing, 2016 update (ACMG SF v2.0): A policy statement of the American College of Medical Genetics and Genomics.GenetMed.2017;19:249–255., Assessment of large copy number variants in patients with apparently isolated congenital left-sided cardiac lesions reveals clinically relevant genomic events.AmJMedGenetA.2017;173:2176–2188., Genome structural variation discovery and genotyping.NatRevGenet, Single nucleotide polymorphism arrays: A decade of biological, computational and technological advances.Nucleic Acids Res, Assessment and validation of a phenotype-enhanced variant classification framework to promote or demote RYR2 missense variants of uncertain significance.CircGenomPrecisMed, Assessment and validation of a phenotype-enhanced variant classification framework to promote or demote RYR2 missense variants of uncertain significance.CircGenomPrecisMed, Diagnostic clinical genome and exome sequencing.NEnglJMed, Uses of Next-Generation Sequencing Technologies for the Diagnosis of Primary Immunodeficiencies.FrontImmunol, Diagnostic clinical genome and exome sequencing.NEnglJMed, Diagnostic clinical genome and exome sequencing.NEnglJMed, Diagnostic clinical genome and exome sequencing.NEnglJMed, Diagnostic clinical genome and exome sequencing.NEnglJMed, 47 [(accessed on 15 September 2023)];Available online:https://www.ncbi.nlm.nih.gov/clinvar/, 48 [(accessed on 15 September 2023)]Available online:https://www.omim.org, 49 [(accessed on 15 September 2023)]Available online:http://genetics.bwh.harvard.edu/pph2/, 50 [(accessed on 15 September 2023)]Available online:https://www.mutationtaster.org, 51 [(accessed on 15 September 2023)]Available online:https://www.jcvi.org/research/provean, Standards and guidelines for the interpretation of sequence variants: A joint consensus recommendation of the American College of Medical Genetics and Genomics and the Association for Molecular Pathology.GenetMed.2015;17:405–424., Standards and guidelines for the interpretation of sequence variants: A joint consensus recommendation of the American College of Medical Genetics and Genomics and the Association for Molecular Pathology.GenetMed.2015;17:405–424., Standards and guidelines for the interpretation of sequence variants: A joint consensus recommendation of the American College of Medical Genetics and Genomics and the Association for Molecular Pathology.GenetMed.2015;17:405–424., Basic science methods for the characterization of variants of uncertain significance in hypertrophic cardiomyopathy.FrontCardiovascMed, Selecting variants of unknown significance through network-based gene-association significantly improves risk prediction for disease-control cohorts.SciRep, Disease-specific variant pathogenicity prediction significantly improves variant interpretation in inherited cardiac conditions.GenetMed.2021;23:69–79., Basic science methods for the characterization of variants of uncertain significance in hypertrophic cardiomyopathy.FrontCardiovascMed, Clinical significance of genetic variation in hypertrophic cardiomyopathy: Comparison of computational tools to prioritize missense variants.FrontCardiovascMed, Perceptions of genetic variant reclassification in patients with inherited cardiac disease.EurJHumGenet, A cost-effectiveness model of genetic testing for the evaluation of families with hypertrophic cardiomyopathy.Heart, Genetic testing for inherited heart diseases: Longitudinal impact on health-related quality of life.GenetMed, Task Force Report: The legal implications of medical guidelines—A Task Force of the European Society of Cardiology.EurHeart J, The Polygenic Score Catalog as an open database for reproducibility and systematic evaluation.NatGenet.2021;53:420–425., Transethnic genome-wide association study provides insights in the genetic architecture and heritability of long QT syndrome.Circulation.2020;142:324–338., HCMR InvestigatorsCommon genetic variants and modifiable risk factors underpin hypertrophic cardiomyopathy susceptibility and expressivity.NatGenet.2021;53:135–142., Predicting cardiac electrical response to sodiumchannel blockade and Brugada syndrome using polygenic risk scores.EurHeart J.2019;40:3097–3107., Corrected QT interval-polygenic risk score and its contribution to type 1, type 2, and type 3 long-QT syndrome in probands and genotype-positive family members.CircGenomPrecisMed, Meta-analysis of the implantable cardioverter defibrillator secondary prevention trials.EurHeart J.2000;21:2071–2078., High penetrance and similar disease progression in probands and in family members with arrhythmogenic cardiomyopathy.EurHeart J, From hypertrophic cardiomyopathy centers to inherited cardiovascular disease centers in EuropeA small or a major step? A position paper from the Nucleus of the Working Group on Myocardial and Pericardial Diseases of the Portuguese Society of Cardiology.RevPortCardiol, Plan of action for inherited cardiovascular diseases: Synthesis of recommendations and action algorithms.RevEspCardiol, Interventions to improve risk communication in clinical genetics: Systematic review.Patient EducCouns.2008;71:4–25., Family communication in inherited cardiovascular conditions in Ireland.JGenetCouns, Communicating genetic test results within the family: Is it lost in translation? A survey of relatives in the randomized six-step study.FamCancer, Relationships between health literacy and genomics-related knowledge, self-efficacy, perceived importance, and communication in a medically underserved population.JHealth Commun, Family communication in inherited cardiovascular conditions in Ireland.JGenetCouns, Relationships between health literacy and genomics-related knowledge, self-efficacy, perceived importance, and communication in a medically underserved population.JHealth Commun, Family communication in inherited cardiovascular conditions in Ireland.JGenetCouns, Targeted therapies in genetic dilated and hypertrophic cardiomyopathies: From molecular mechanisms to therapeutic targetsA position paper from the Heart Failure Association (HFA) and the Working Group on Myocardial Function of the European Society of Cardiology (ESC)EurJHeart Fail, Targeted therapies in genetic dilated and hypertrophic cardiomyopathies: From molecular mechanisms to therapeutic targetsA position paper from the Heart Failure Association (HFA) and the Working Group on Myocardial Function of the European Society of Cardiology (ESC)EurJHeart Fail, Genome editing with CRISPR-Cas nucleases, base editors, transposases and prime editors.NatBiotechnol, Truncated titin proteins and titin haploinsufficiency are targets for functional recovery in human cardiomyopathy due to TTN mutations.SciTranslMed.2021;13:eabd3079., Titin mutations in iPS cells define sarcomere insufficiency as a cause of dilated cardiomyopathy.Science.2015;349:982–986., Induction of pluripotent stem cells from adult human fibroblasts by defined factors.Cell, Isogenic human pluripotent stem cell pairs reveal the role of a KCNH2 mutation in long-QT syndrome.EMBO J.2013;32:3161–3175., Disease modeling of a mutation in α-actinin 2 guides clinical therapy in hypertrophic cardiomyopathy.EMBO MolMed.2019;11:e11115., Somatic gene editing ameliorates skeletal and cardiac muscle failure in pig and human models of Duchenne muscular dystrophy.NatMed.2020;26:207–214., In vivo genome editing improves muscle function in a mouse model of Duchenne muscular dystrophy.Science.2016;351:403–407., In vivo genome editing improves muscle function in a mouse model of Duchenne muscular dystrophy.Science.2016;351:403–407., Gene therapy targeting protein trafficking regulator MOG1 in mouse models of Brugada syndrome, arrhythmias, and mild cardiomyopathy.SciTranslMed, Gene therapy targeting protein trafficking regulator MOG1 in mouse models of Brugada syndrome, arrhythmias, and mild cardiomyopathy.SciTranslMed, 83 [(accessed on 15 September 2023)];Available online:https://clinicaltrials.gov, 84 [(accessed on 15 September 2023)];Available online:  https://clinicaltrials.gov/study/{\"type\":\"clinical-trial\",\"attrs\":{\"text\":\"NCT05302271\",\"term_id\":\"NCT05302271\"}}NCT05302271?cond=Cardiomyopathies&intr=gene%20therapy&rank=1, 85 [(accessed on 15 September 2023)];Available online:  https://clinicaltrials.gov/study/{\"type\":\"clinical-trial\",\"attrs\":{\"text\":\"NCT00494195\",\"term_id\":\"NCT00494195\"}}NCT00494195?cond=Cardiomyopathies&intr=gene%20therapy&rank=4, 86 [(accessed on 15 September 2023)];Available online:  https://clinicaltrials.gov/study/{\"type\":\"clinical-trial\",\"attrs\":{\"text\":\"NCT05885412\",\"term_id\":\"NCT05885412\"}}NCT05885412?cond=Cardiomyopathies&intr=gene%20therapy&page=2&rank=11, 87 [(accessed on 15 September 2023)];Available online:  https://clinicaltrials.gov/study/{\"type\":\"clinical-trial\",\"attrs\":{\"text\":\"NCT01344798\",\"term_id\":\"NCT01344798\"}}NCT01344798?cond=Cardiomyopathies&intr=gene%20therapy&page=1&rank=7, 88 [(accessed on 15 September 2023)];Available online:  https://clinicaltrials.gov/study/{\"type\":\"clinical-trial\",\"attrs\":{\"text\":\"NCT02346422\",\"term_id\":\"NCT02346422\"}}NCT02346422?cond=Cardiomyopathies&intr=gene%20therapy&page=1&rank=9, 89 [(accessed on 15 September 2023)];Available online:  https://clinicaltrials.gov/study/{\"type\":\"clinical-trial\",\"attrs\":{\"text\":\"NCT05445323\",\"term_id\":\"NCT05445323\"}}NCT05445323?cond=Cardiomyopathies&intr=gene%20therapy&rank=3, 90 [(accessed on 15 September 2023)];Available online:  https://clinicaltrials.gov/study/{\"type\":\"clinical-trial\",\"attrs\":{\"text\":\"NCT01966887\",\"term_id\":\"NCT01966887\"}}NCT01966887?cond=Cardiomyopathies&intr=gene%20therapy&rank=2, 91 [(accessed on 15 September 2023)];Available online:  https://clinicaltrials.gov/study/{\"type\":\"clinical-trial\",\"attrs\":{\"text\":\"NCT03439514\",\"term_id\":\"NCT03439514\"}}NCT03439514?cond=Cardiomyopathies&intr=gene%20therapy&page=2&rank=12, 92 [(accessed on 15 September 2023)];Available online:  https://clinicaltrials.gov/study/{\"type\":\"clinical-trial\",\"attrs\":{\"text\":\"NCT05836259\",\"term_id\":\"NCT05836259\"}}NCT05836259?cond=Cardiomyopathies&intr=gene%20therapy&page=2&rank=13, 93 [(accessed on 15 September 2023)];Available online:  https://clinicaltrials.gov/study/{\"type\":\"clinical-trial\",\"attrs\":{\"text\":\"NCT00279539\",\"term_id\":\"NCT00279539\"}}NCT00279539?cond=Cardiomyopathies&intr=gene%20therapy&page=2&rank=20, 94 [(accessed on 15 September 2023)];Available online:  https://clinicaltrials.gov/study/{\"type\":\"clinical-trial\",\"attrs\":{\"text\":\"NCT03882437\",\"term_id\":\"NCT03882437\"}}NCT03882437?cond=Cardiomyopathies&intr=gene%20therapy&page=3&rank=21",
        "genetics cardiomyopathies and heart failure": "genetics cardiomyopathies and heart failure   Within the context of cardiovascular diseases, the role of genetics in cardiomyopathies has become increasingly pronounced. Cardiomyopathies represent a varied group of heart muscle conditions that manifest with different levels of systolic and/or diastolic cardiac dysfunction. The etiology of many cardiomyopathies is rooted in genetics, frequently resulting from mutations in genes that encode ion channels, sarcomeres, or cytoskeletal elements alongside established acquired causes. The surge in cardiomyopathy research can be attributed to cutting-edge investigative techniques such as induced pluripotent stem cells, 3D cell printing, support structures, and the creation of engineered cardiac tissues [73].Cardiomyopathy is characterized as a myocardial disorder in which the heart muscle exhibits structural and functional abnormalities occurring distinctly from factors such as coronary artery disease, hypertension, valvular disease, or congenital heart disease that could provide alternative explanations for the myocardial abnormalities observed [95]. Cardiomyopathies are responsible for approximately one-third of clinically observed HF cases. Recent guidelines from the European Society of Cardiology (ESC) reaffirm conventional cardiomyopathy classifications such as hypertrophic cardiomyopathy (HCM), dilated cardiomyopathy (DCM), restrictive cardiomyopathy (RCM), and arrhythmogenic right ventricular cardiomyopathy (ARVC). Additionally, there is a proposition to introduce the term “non-dilated left ventricular cardiomyopathy” (NDLVC). This would cater to those previously labeled under various terms such as DCM without left-ventricular dilation, arrhythmogenic DCM (that does not fit the ARVC criteria), arrhythmogenic left ventricular cardiomyopathy (ALVC), and left-dominant ARVC.HCM is prevalent in approximately 0.2% to 1.4% of the general population [96,97]. Up to 60% of HCM cases can be traced back to pathogenic genetic variants, predominantly stemming from mutations in sarcomeric genes, typically inherited in an autosomal dominant manner. While most cases are genetic, approximately 10% can be attributed to other causes, such as neuromuscular disorders, storage diseases, and certain hereditary syndromes. Among those with HCM, 40–70% present with obstructive HCM (manifested either at rest or during exercise), characterized by a marked reduction in ventricular cavity size. Conversely, 30–60% exhibit nonobstructive HCM. The primary genes implicated in HCM aremyosin heavy chain 7(MYH7) andmyosin-binding protein C3(MYBPC3) [98,99].DCM’s prevalence in Europe is estimated to fall between 0.036% and 0.4% [100,101].In this demographic, only 30–40% of cases are linked to rare pathogenic genetic variants, suggesting a substantial role of polygenic or common variant influences. Disease acceleration can be attributed to modifiers such as epigenetic factors or acquired elements such as pregnancy, hypertension, alcohol abuse, and toxin exposure. Although genetic variants are more prevalent in families impacted by DCM, about 20% of these variants are also discernible in nonfamilial cases [100].The prevalence of NDLVC is yet to be precisely established. Genes associated with this phenotype includedesmin(DES),lamin A/C(LMNA),phospholamban(PLN),filamin C(FLNC) with truncating variants, anddesmoplakin(DSP) variants, which are frequently linked to left ventricular fibrosis. Recognizing a pathogenic or likely pathogenic genetic variant enhances the accuracy of prognosis and outcome predictions [102].ARVC is an inherited condition associated with genes encoding desmosomal proteins, with an estimated prevalence of approximately 0.078% [103,104]. The genes implicated in ARVC are responsible for the proteins of the cardiac desmosome, such asplakophilin-2(PKP2), DSP,plakoglobin(JUP), anddesmoglein-2(DSG2). Other genes, includingtransmembrane protein 43(TMEM43) [105], PLN [106], and DES [107], have been identified as having pathogenic or likely pathogenic variants.RCM is relatively rare among adults. It typically exhibits autosomal dominant inheritance, though autosomal recessive or sporadic cases are also observed. RCM is linked to mutations in genes for sarcomeric structural and regulatory proteins, as well as cytoskeletal filaments. The most frequently implicated gene istroponin I(TNNI3) [108] or, less frequently,troponin T type 2(TNNT2),titin(TTN), andmyopalladin(MYPN).3.1. Genetic Factors Predisposing to Heart FailureIn patients with cardiomyopathy and those with a genetic variant (i.e., carrier), it is crucial to identify those at an elevated risk of developing HF. The proportion of patients possessing a genetic variant linked to cardiomyopathies who eventually develop HF can differ substantially. This variability can be attributed to multiple factors, including the specific genetic variant in question, its severity, the patient’s family history, age, and other individual risk determinants [100]. At present, there are no well-established and scientifically validated multiparametric risk scores that can precisely predict which patients will manifest HF. Nevertheless, a comprehensive evaluation of individual risk should incorporate several parameters. In this context, family history and genetic information can be instrumental in identifying heightened risk. It is well-established that having a first-degree relative with HF augments the risk relative to the broader population [100,109]. A cross-sectional cohort study, which encompassed 458 participants, each with at least one parent diagnosed with HF, revealed that asymptomatic participants exhibited a higher likelihood of increased left ventricular systolic dysfunction, left ventricular internal dimensions, and left ventricular mass [109]. The study did not explicitly indicate whether patients with HF possessed specific genetic variants. However, a clear hypothesis emerged, suggesting that the inheritance of certain genetic factors (those linked to maladaptive reactions to environmental or biological stressors) implies a causal relationship between these genetic elements and the disease’s progression [109].This familial predisposition could potentially stem from shared genetic variants. Various genetic variants have been associated with different types of cardiomyopathies, which can significantly influence the course and outcome of the disease. For example, in DCM, there is evidence that patients with TTN truncation variants might be more susceptible to developing HF when exposed to stressors such as alcohol, pregnancy, or cardiotoxic drugs. Furthermore, those with DCM who carry sarcomeric rare variants orRNA-binding motif protein 20(RBM20) variants generally experience a more rapid disease progression, sometimes leading to the necessity for interventions such as heart transplantation. Variations in the LMNA gene can have diverse effects on cardiomyocyte structure and function. Notably, non-missense LMNA variants have been identified as predictors of severe ventricular arrhythmias (VAs) and have been integrated into risk assessment models [110].In the context of HCM, a large multicenter cohort study has shown that a sarcomere mutation is associated with an earlier onset of the disease and serves as a strong predictor of unfavorable clinical outcomes, including the occurrence of VAs and HF [111]. The MYH7 gene is a significant genetic factor responsible for encoding theβ-myosin heavy-chain(β-MHC) subunit of cardiac myosin. Alterations in this myosin directly influence myocardial mechanical function, contributing to impaired myocardial performance that can result in HF [112].Individuals carrying MYBPC3 missense VUSs demonstrate an elevated incidence of adverse clinical outcomes. These outcomes include VAs, HF, all-cause mortality, atrial fibrillation, and stroke, similar to those with pathogenic MYBPC3 variants [113]. Evidence indicates that patients with MYH7 gene mutations present with more severe disease manifestations compared to those with MYBPC3 mutations [114]. Moreover, patients harboring MYH7 or MYBPC3 mutations also face a heightened risk of SCD [115].In the context of ARVC, it has been observed that patients with mutations in the DSP,desmocollin-2(DSC2), and DSG2 genes more commonly exhibit a diminished left ventricular ejection fraction (LVEF) of ≤45% on cardiac magnetic resonance (CMR) imaging in comparison to those with PKP2-related ARVC (27% vs. 4%,p< 0.01) [116].A recent meta-analysis revealed that mapping of TNN variants identified specific regions within the TNNT2 and TNNI3 genes associated with increased pathogenicity in RCM and a heightened risk of SCD. TNNC1-positive probands presented with the earliest age of onset and the highest incidences of death, transplantation, or ventricular fibrillation events. Notably, these individuals were diagnosed at younger ages and experienced adverse clinical outcomes, with some facing fatal outcomes during infancy [117].Patients with genetic variants predisposing them to an elevated risk of HF and SCD warrant vigilant monitoring to facilitate early diagnosis [118]. It is pertinent to highlight that morpho-functional alterations can manifest long before the emergence of congestive symptoms. Furthermore, the reported absence of symptoms often mirrors a gradual adaptation to the constraints imposed by the cardiac condition, a process that might begin during adolescence [119].Monitoring should leverage a multimodal imaging approach, integrating both transthoracic echocardiography and CMR. Transthoracic echocardiography yields invaluable diagnostic information for cardiomyopathies, and aids in identifying patients at an elevated risk of HF. In conditions such as DCM, a decrease in LVEF is a vital indicator of HF severity, signifying compromised ventricular contractility and concomitant ventricular wall thinning [118,120].Advanced myocardial deformation imaging techniques, such as speckle tracking and tissue Doppler, are particularly adept at assessing global longitudinal strain. These methods prove to be more discerning than EF in detecting nuanced ventricular dysfunction and are ideal for preliminary screenings. In contrast, CMR offers superior tissue characterization. It is indispensable for diagnosing conditions such as NDLVC, ARVC, myocarditis, amyloidosis, and sarcoidosis. Furthermore, these imaging techniques are essential for gauging the progression of diseases and the success of therapeutic approaches. The pattern and extent of late gadolinium enhancement (LGE) provide valuable insights into the prognosis for arrhythmia and the severity of HF. Periodic monitoring through echocardiography or magnetic resonance imaging can uncover abnormalities in cardiac dimensions or operations ahead of apparent symptom manifestation, thereby identifying a subclinical phenotype [120]. Additionally, laboratory assessments, including natriuretic peptides and troponin levels, are beneficial for overseeing cardiomyopathies and pinpointing HF [121].3.2. Genetics in Assessing the Risk of Heart Failure ProgressionGenetics can be pivotal in guiding the clinical management of patients diagnosed with cardiomyopathy, especially those with established HF. Understanding both the patient’s clinical phenotype and genetic background provides the HF specialist with a unique profile (genotype) for that specific patient, enabling more accurate predictions regarding disease progression and outcomes.Currently, there are no predefined and scientifically validated multiparametric risk scores that can accurately project which patients will develop HF or experience clinical deterioration [100,109]. Nonetheless, certain genetic variants have been linked to a heightened risk of malignant VAs and progression to advanced HF [4,110].Routine clinical evaluations, complemented by echocardiography or CMR every 1–2 years and cardiopulmonary exercise testing every 2–3 years, serve as reliable tools to detect early indicators of disease progression. In this context, timely clinical evaluation and preventive strategies are of paramount importance. Leveraging genetic insights allows for enhanced risk stratification in patients with cardiomyopathy [122].3.3. Arrhythmic Risk StratificationIn individuals with cardiomyopathies, atrial fibrillation stands out as the most prevalent arrhythmia across all phenotypes. This condition is linked to an elevated risk of HF, cardioembolic events, and increased mortality. The primary concern for clinicians, however, is managing the risk of VAs leading to SCD, as well as sustained VAs and electrical storms [123]. Indeed, while the implantation of an ICD is advocated for secondary prevention, determining its use in patients who have not yet experienced sustained symptomatic VAs remains a complex clinical decision.In DCM, individuals carrying pathogenic variants such as DSP, LMNA, PLN,folliculin(FLCN), TMEM43, and RBM20 demonstrate an increased incidence of notable arrhythmic events [124,125]. This elevated risk is observed irrespective of their LVEF, and these patients also tend to follow a more challenging clinical trajectory compared to DCM patients not carrying these specific genetic variants. Genes associated with an increased risk of arrhythmias include those encoding nuclear envelope proteins (TMEM43, LMNA, andemerin[EMD]), as well as cytoskeletal and desmosomal proteins (PKP2, DSP, DSC2, and DSG2) [122].Patients with DCM-causing variants in these high-risk genes should be viewed as having a pronounced genetic predisposition to SCD. The decision to implant an ICD for primary prevention in those with LMNA-related cardiomyopathies might be informed by the LMNA-risk ventricular tachyarrhythmia (VTA) calculator, which evaluates the risk of experiencing a life-threatening VTA within a 5-year period [122]. This calculator provides a more nuanced risk assessment compared to the prevailing standard of care [4], which identifies high risk based on the presence of ≥2 of the following factors: male gender, non-missense mutations, nonsustained ventricular tachycardia, and an LVEF of ≤45%. Notably, LMNA mutations have been linked to premature atrial and ventricular arrhythmias, early-onset conduction abnormalities, an elevated risk of SCD, and progression to end-stage HF. Consequently, the LMNA-risk VTA calculator was developed specifically for this patient subset, aiming to quantify the likelihood of SCD, relevant ICD shocks, or manifestations of hemodynamically unstable VTA (https://lmna-risk-vta.fr[126], accessed on 15 September 2023).In individuals without a high-risk genotype and an LVEF ≥ 35%, the use of LGE on CMR imaging becomes an essential tool for risk assessment [127]. It is recommended that genetic testing, encompassing at least the PLN, LMNA, FLNC, and RBM20 genes, be conducted for patients with DCM and atrioventricular (AV) conduction delay before the age of 50, or if a family history of SCD in a first-degree relative is present [122]. For DCM patients carrying a pathogenic LMNA gene mutation, considering the placement of an ICD for primary prevention is essential, particularly if the projected 5-year risk of encountering life-threatening VA is ≥10%. This consideration is heightened when the coexistence of nonsustained ventricular tachycardia (NSVT) with an LVEF of ≤50% or an AV conduction delay is observed [122,128]. Additional determinants, such as syncope, the presence of NSVT, or a significant incidence of ventricular ectopy (VE), can further influence the decision regarding ICD implantation [122,125].MYH7-related dilated cardiomyopathy (MYH7-DCM) is characterized by an early onset, pronounced phenotypic manifestation, limited left ventricular reverse remodeling, and a frequent progression to end-stage HF (ESHF). Complications related to HF are more common than the occasional VAs [129].In HCM, NSVT identified during extended (24/48 h) ambulatory electrocardiogram (ECG) monitoring, particularly in individuals below 30 years of age and those who experience NSVT during physical exertion, is significantly associated with an increased risk of SCD [130]. A risk-prediction model, known as the HCM Risk-SCD, takes into account parameters such as left ventricular wall thickness, the gradient of the left ventricular outflow tract (LVOT), left atrial dimensions, unexplained episodes of fainting (syncope), NSVT, age, and a family history of SCD [131]. However, the HCM Risk-SCD model does not consider certain elements, including the presence of an apical aneurysm, compromised left ventricular systolic function, and pronounced LGE on CMR.In addition to these tools, the presence of single or multiple sarcomeric mutations also plays a significant role in the stratification of SCD risk [132].In the context of ARVC, genetic testing reveals mutations in 4–16% of cases [133]. These identified mutations are associated with a heightened propensity for VAs to manifest at an earlier age. Identifying ARVC patients at heightened risk for SCD is challenging, due to the scarcity of comprehensive evidence outlining definitive risk factors for life-threatening VAs. Beyond genetic variants, clinical presentations, such as arrhythmic syncope and both right ventricular and left ventricular dysfunction, have been recognized as significant contributors to an increased arrhythmic risk [122].3.4. Implications of Genetic Variants in Clinical DecisionsAs previously mentioned, determining the genetic variants within a patient through genetic testing provides a distinctive “identity card”, revealing potential clinical phenotypic traits of the individual. Such characteristics might predispose them to malignant VAs, potential SCD, and the initiation and progression of HF symptoms.Table 3showcases a gene panel related to specific cardiomyopathies. It differentiates genes that predominantly manifest with an arrhythmic risk profile, those leaning toward an HF clinical outcome, and mutations that predispose individuals to both conditions [108,110,113,116,129,134,135,136]. This underscores the importance of genetic investigations in predicting prognosis, accurately classifying the patient’s genotype, initiating early medical surveillance, and preemptively addressing potential adverse cardiovascular events.Table 3Clinical relevance of mutations for risk of arrhythmic events and heart failure progression in cardiomyopathies.CardiomyopathyGene (Protein)Arrhythmic RiskHeart Failure RiskDCMLMNA (Lamin A/C)X [110]TTN (Titin) truncating mutationsX [106,134]RBM20 (RNA-binding motif protein 20)X [134]X [134]PLN (Phospholamban)X [135]FLNC (Filamin C)X [135]TMEM43 (Transmembrane protein 43)X [106]EMD (Emerin)X [136]DSG2 (Desmoglein 2)X [106]DSP (Desmoplakin)X [106]DES (Desmin)X [106]MYH7 (Beta-myosin heavy chain)X [129]HCMMYBPC3 (Cardiac myosin binding protein C)X [106]X [113]MYH7 (Beta-myosin heavy chain)X [106]X [129]RCMTNNT2 (Troponin T2)X [106]TNNI3 (Troponin T3)X [108]ARVCDSC2 (Desmocollin 2)X [116]DSG2 (Desmoglein 2)X [116]DSP (Desmoplakin)X [116]Open in a separate windowDCM: dilated cardiomyopathy; HCM: hypertrophic cardiomyopathy; RCM: restrictive cardiomyopathy; ARVC: arrhythmogenic cardiomyopathy.Individuals harboring mutations in genes such as DSP, LMNA, PLN, FLCN, RBM20, and TMEM43 are more susceptible to significant arrhythmic events, irrespective of their LVEF, and tend to follow a more challenging clinical trajectory than those with DCM who are genotype-negative. Specifically, a patient with a mutation in the LMNA gene faces an elevated risk of SCD. As a result, the criteria for ICD implantation for these individuals will be more stringent compared to those without such a mutation, but who are still at high risk for SCD. Consequently, patients in this category should consider ICD implantation as a precaution, even when their LVEF is above 35% [4,122].Recognizing one’s genetic profile and inherent predispositions will gain paramount importance in the future, as numerous scientific studies have already highlighted. For instance, in peripartum cardiomyopathy, which was historically viewed as an environmental condition, there is a notable prevalence of truncating variants in genes associated with DCM. Such variants correlate with a diminished rate of left ventricular recovery. By comprehending these genetic nuances, clinicians can stratify patients with peripartum cardiomyopathy and tailor therapeutic approaches accordingly [137].Thus, it becomes essential to embrace the idea of individual genetic predispositions. This suggests that specific genetic variants might have a direct correlation with either favorable or unfavorable outcomes. This is even applicable to less prevalent cardiomyopathies, where previously only external or secondary causes were considered as potential etiologies [138].",
        "reference_links__genetics cardiomyopathies and heart failure": "73 https://www.jcvi.org/research/provean, 95 //doi.org/10.1016%2Fj.repc.2011.09.005, 96 https://pubmed.ncbi.nlm.nih.gov/26856793, 97 //doi.org/10.1016%2Fj.recesp.2015.11.031, 98 https://pubmed.ncbi.nlm.nih.gov/18207694, 99 //doi.org/10.1016%2Fj.pec.2007.11.026, 100 https://pubmed.ncbi.nlm.nih.gov/27271705, 101 //doi.org/10.1007%2Fs10897-016-9974-5, 100 https://pubmed.ncbi.nlm.nih.gov/27271705, 102 /pmc/articles/PMC5010833/, 103 /pmc/articles/PMC5546792/, 104 /pmc/articles/PMC9305112/, 105 https://pubmed.ncbi.nlm.nih.gov/32572269, 106 //doi.org/10.1038%2Fs41587-020-0561-9, 107 https://pubmed.ncbi.nlm.nih.gov/34731013, 108 //doi.org/10.1126%2Fscitranslmed.abd3079, 100 https://pubmed.ncbi.nlm.nih.gov/27271705, 100 https://pubmed.ncbi.nlm.nih.gov/27271705, 109 /pmc/articles/PMC4618316/, 109 /pmc/articles/PMC4618316/, 109 /pmc/articles/PMC4618316/, 110 https://pubmed.ncbi.nlm.nih.gov/18035408, 111 //doi.org/10.1016%2Fj.cell.2007.11.019, 112 /pmc/articles/PMC3981141/, 113 /pmc/articles/PMC6895603/, 114 /pmc/articles/PMC7212064/, 115 /pmc/articles/PMC4883596/, 116 https://pubmed.ncbi.nlm.nih.gov/35675436, 117 //doi.org/10.1126%2Fscitranslmed.abf3136, 118 https://clinicaltrials.gov, 119 https://clinicaltrials.gov/ct2/show/NCT05302271, 118 https://clinicaltrials.gov, 120 https://clinicaltrials.gov/ct2/show/NCT00494195, 120 https://clinicaltrials.gov/ct2/show/NCT00494195, 121 https://clinicaltrials.gov/ct2/show/NCT05885412, 100 https://pubmed.ncbi.nlm.nih.gov/27271705, 109 /pmc/articles/PMC4618316/, 4 //doi.org/10.1016%2Fj.gim.2021.10.020, 110 https://pubmed.ncbi.nlm.nih.gov/18035408, 122 https://clinicaltrials.gov/ct2/show/NCT01344798, 123 https://clinicaltrials.gov/ct2/show/NCT02346422, 124 https://clinicaltrials.gov/ct2/show/NCT05445323, 125 https://clinicaltrials.gov/ct2/show/NCT01966887, 122 https://clinicaltrials.gov/ct2/show/NCT01344798, 122 https://clinicaltrials.gov/ct2/show/NCT01344798, 4 //doi.org/10.1016%2Fj.gim.2021.10.020, 126 https://clinicaltrials.gov/ct2/show/NCT03439514, 127 https://clinicaltrials.gov/ct2/show/NCT05836259, 122 https://clinicaltrials.gov/ct2/show/NCT01344798, 122 https://clinicaltrials.gov/ct2/show/NCT01344798, 128 https://clinicaltrials.gov/ct2/show/NCT00279539, 122 https://clinicaltrials.gov/ct2/show/NCT01344798, 125 https://clinicaltrials.gov/ct2/show/NCT01966887, 129 https://clinicaltrials.gov/ct2/show/NCT03882437, 130 https://pubmed.ncbi.nlm.nih.gov/17916581, 131 //doi.org/10.1093%2Feurheartj%2Fehm342, 132 https://pubmed.ncbi.nlm.nih.gov/3812242, 133 //doi.org/10.1016%2FS0002-9149(87)80107-8, 122 https://clinicaltrials.gov/ct2/show/NCT01344798, 108 //doi.org/10.1126%2Fscitranslmed.abd3079, 110 https://pubmed.ncbi.nlm.nih.gov/18035408, 113 /pmc/articles/PMC6895603/, 116 https://pubmed.ncbi.nlm.nih.gov/35675436, 129 https://clinicaltrials.gov/ct2/show/NCT03882437, 134 https://pubmed.ncbi.nlm.nih.gov/17034699, 135 //doi.org/10.1258%2F004947506778604904, 136 https://pubmed.ncbi.nlm.nih.gov/9714088, 110 https://pubmed.ncbi.nlm.nih.gov/18035408, 106 //doi.org/10.1038%2Fs41587-020-0561-9, 134 https://pubmed.ncbi.nlm.nih.gov/17034699, 134 https://pubmed.ncbi.nlm.nih.gov/17034699, 134 https://pubmed.ncbi.nlm.nih.gov/17034699, 135 //doi.org/10.1258%2F004947506778604904, 135 //doi.org/10.1258%2F004947506778604904, 106 //doi.org/10.1038%2Fs41587-020-0561-9, 136 https://pubmed.ncbi.nlm.nih.gov/9714088, 106 //doi.org/10.1038%2Fs41587-020-0561-9, 106 //doi.org/10.1038%2Fs41587-020-0561-9, 106 //doi.org/10.1038%2Fs41587-020-0561-9, 129 https://clinicaltrials.gov/ct2/show/NCT03882437, 106 //doi.org/10.1038%2Fs41587-020-0561-9, 113 /pmc/articles/PMC6895603/, 106 //doi.org/10.1038%2Fs41587-020-0561-9, 129 https://clinicaltrials.gov/ct2/show/NCT03882437, 106 //doi.org/10.1038%2Fs41587-020-0561-9, 108 //doi.org/10.1126%2Fscitranslmed.abd3079, 116 https://pubmed.ncbi.nlm.nih.gov/35675436, 116 https://pubmed.ncbi.nlm.nih.gov/35675436, 116 https://pubmed.ncbi.nlm.nih.gov/35675436, 4 //doi.org/10.1016%2Fj.gim.2021.10.020, 122 https://clinicaltrials.gov/ct2/show/NCT01344798, 137 //doi.org/10.1161%2F01.CIR.98.5.391, 138 https://pubmed.ncbi.nlm.nih.gov/19270053",
        "reference__genetics cardiomyopathies and heart failure": "Targeted therapies in genetic dilated and hypertrophic cardiomyopathies: From molecular mechanisms to therapeutic targetsA position paper from the Heart Failure Association (HFA) and the Working Group on Myocardial Function of the European Society of Cardiology (ESC)EurJHeart Fail, Classification of the cardiomyopathies: A position statement from the European Society of Cardiology Working Group on Myocardial and Pericardial Diseases.EurHeart J.2008;29:270–276., Prevalence of hypertrophic cardiomyopathy in a population of adult Japanese workers as detected by echocardiographic screening.AmJCardiol, Clinical and echocardiographic study of hypertrophic cardiomyopathy in Tanzania.TropDoct, Patients with familial hypertrophic cardiomyopathy caused by a Phe110Ile missense mutation in the cardiac troponin T gene have variable cardiac morphologies and a favorable prognosis.Circulation, Recommendations for the evaluation of left ventricular diastolic function by echocardiography.EurJEchocardiogr, Dilated cardiomyopathy: The complexity of a diverse genetic architecture.NatRevCardiol, A population-based study in Olmsted County, Minnesota, 1975–1984.Circulation, Dilated cardiomyopathy: The complexity of a diverse genetic architecture.NatRevCardiol, Desmoplakin cardiomyopathy, a fibrotic and inflammatory form of cardiomyopathy distinct from typical dilated or arrhythmogenic right ventricular cardiomyopathy.Circulation.2020;141:1872–1884., Prevalence of right ventricular dysplasiacardiomyopathy in a non-referral hospital.IntJCardiol, Prevalence of cardiomyopathy in Italian asymptomatic children with electrocardiographic T-wave inversion at preparticipation screening.Circulation.2012;125:529–538., Arrhythmogenic right ventricular cardiomyopathy type 5 is a fully penetrant, lethal arrhythmic disorder caused by a missense mutation in the TMEM43 gene.AmJHumGenet.2008;82:809–821., International evidence based reappraisal of genes associated with arrhythmogenic right ventricular cardiomyopathy using the clinical genome resource framework.CircGenomPrecisMed.2021;14:e003273., Severe cardiac phenotype with right ventricular predominance in a large cohort of patients with a single missense mutation in the DES gene.Heart Rhythm.2009;6:1574–1583., Idiopathic restrictive cardiomyopathy is part of the clinical expression of cardiac troponin I mutations.JClinInvestig, Dilated cardiomyopathy: The complexity of a diverse genetic architecture.NatRevCardiol, Dilated cardiomyopathy: The complexity of a diverse genetic architecture.NatRevCardiol, Association of parental heart failure with risk of heart failure in offspring.NEnglJMed, Association of parental heart failure with risk of heart failure in offspring.NEnglJMed, Association of parental heart failure with risk of heart failure in offspring.NEnglJMed, Cardiolaminopathies: Weighing in on the Concept of Genotype-First Screening.JAmCollCardiol, Hypertrophic Cardiomyopathy: An Overview of Genetics and Management.Biomolecules, Genetic Association of Beta-Myosin Heavy-Chain Gene (MYH7) with Cardiac Dysfunction.Genes, An Update on MYBPC3 Gene Mutation in Hypertrophic Cardiomyopathy.IntJMolSci.2023;24:10510., Genetic determinants of clinical phenotype in hypertrophic cardiomyopathy.BMC CardiovascDisord.2020;20:516., Genes frequently associated with sudden death in primary hypertrophic cardiomyopathy.ArchCardiolMex, Genotype-phenotype correlation in arrhythmogenic right ventricular cardiomyopathy-risk of arrhythmias and heart failure.JMedGenet.2022;59:858–864., Evidence for troponin C (TNNC1) as a gene for autosomal recessive restrictive cardiomyopathy with fatal outcome in infancy.AmJMedGenetA.2016;170:3241–3248., Genetic predisposition study of heart failure and its association with cardiomyopathy.EgyptHeart J, The case for myocardial ischemia in hypertrophic cardiomyopathy.JAmCollCardiol, Genetic predisposition study of heart failure and its association with cardiomyopathy.EgyptHeart J, Genetic cardiomyopathies causing heart failure.CircRes, Genetic cardiomyopathies causing heart failure.CircRes, Traditional and Emerging Biomarkers in Asymptomatic Left Ventricular Dysfunction-Promising Non-Coding RNAs and Exosomes as Biomarkers in Early Phases of Cardiac Damage.IntJMolSci, Dilated cardiomyopathy: The complexity of a diverse genetic architecture.NatRevCardiol, Association of parental heart failure with risk of heart failure in offspring.NEnglJMed, Development and validation of a new risk prediction score for life-threatening ventricular tachyarrhythmias in laminopathies.Circulation.2019;140:293–302., Cardiolaminopathies: Weighing in on the Concept of Genotype-First Screening.JAmCollCardiol, 2023 ESC Guidelines for the management of cardiomyopathies: Developed by the task force on the management of cardiomyopathies of the European Society of Cardiology (ESC)EurHeart J.2023;44:3503–3626., 2022 ESC Guidelines for the management of patients with ventricular arrhythmias and the prevention of sudden cardiac death.EurHeart J.2022;43:3997–4126., Long-term arrhythmic and nonarrhythmic outcomes of lamin A/C mutation carriers.JAmCollCardiol.2016;68:2299–2307., Prediction of ventricular arrhythmia in phospholamban p.Arg14del mutation carriersreaching the frontiers of individual risk prediction.EurHeart J.2021;42:2842–2850., 2023 ESC Guidelines for the management of cardiomyopathies: Developed by the task force on the management of cardiomyopathies of the European Society of Cardiology (ESC)EurHeart J.2023;44:3503–3626., 2023 ESC Guidelines for the management of cardiomyopathies: Developed by the task force on the management of cardiomyopathies of the European Society of Cardiology (ESC)EurHeart J.2023;44:3503–3626., Development and validation of a new risk prediction score for life-threatening ventricular tachyarrhythmias in laminopathies.Circulation.2019;140:293–302., 126 [(accessed on 15 September 2023)]Available online:https://lmna-risk-vta.fr, Combination of late gadolinium enhancement and genotype improves prediction of prognosis in non-ischaemic dilated cardiomyopathy.EurJHeart Fail, 2023 ESC Guidelines for the management of cardiomyopathies: Developed by the task force on the management of cardiomyopathies of the European Society of Cardiology (ESC)EurHeart J.2023;44:3503–3626., 2023 ESC Guidelines for the management of cardiomyopathies: Developed by the task force on the management of cardiomyopathies of the European Society of Cardiology (ESC)EurHeart J.2023;44:3503–3626., FLNC pathogenic variants in patients with cardiomyopathies: Prevalence and genotype-phenotype correlations.ClinGenet.2019;96:317–329., 2023 ESC Guidelines for the management of cardiomyopathies: Developed by the task force on the management of cardiomyopathies of the European Society of Cardiology (ESC)EurHeart J.2023;44:3503–3626., Prediction of ventricular arrhythmia in phospholamban p.Arg14del mutation carriersreaching the frontiers of individual risk prediction.EurHeart J.2021;42:2842–2850., Natural History of MYH7-Related Dilated Cardiomyopathy.JAmCollCardiol.2022;80:1447–1461., Exercise-induced ventricular arrhythmias and risk of sudden cardiac death in patients with hypertrophic cardiomyopathy.EurHeart J, 131 [(accessed on 15 September 2023)]Available online:https://qxmd.com/calculate/calculator_303/hcm-risk-scd, Prognostic value of quantitative contrast-enhanced cardiovascular magnetic resonance for the evaluation of sudden death risk in patients with hypertrophic cardiomyopathy.Circulation.2014;130:484–495., Impact of genotype on clinical course in arrhythmogenic right ventricular dysplasia/ cardiomyopathy-associated mutation carriers.EurHeart J.2015;36:847–855., 2023 ESC Guidelines for the management of cardiomyopathies: Developed by the task force on the management of cardiomyopathies of the European Society of Cardiology (ESC)EurHeart J.2023;44:3503–3626., Idiopathic restrictive cardiomyopathy is part of the clinical expression of cardiac troponin I mutations.JClinInvestig, Cardiolaminopathies: Weighing in on the Concept of Genotype-First Screening.JAmCollCardiol, An Update on MYBPC3 Gene Mutation in Hypertrophic Cardiomyopathy.IntJMolSci.2023;24:10510., Genotype-phenotype correlation in arrhythmogenic right ventricular cardiomyopathy-risk of arrhythmias and heart failure.JMedGenet.2022;59:858–864., Natural History of MYH7-Related Dilated Cardiomyopathy.JAmCollCardiol.2022;80:1447–1461., Clinical Implication of Genetic Testing in Dilated Cardiomyopathy.IntJHeart Fail, Complex roads from genotype to phenotype in dilated cardiomyopathy: Scientific update from the Working Group of Myocardial Function of the European Society of Cardiology.CardiovascRes.2018;114:1287–1303., Association of Genetic Variants with Outcomes in patients with nonischemic dilated cardiomyopathy.JAmCollCardiol.2021;78:1682–1699., Cardiolaminopathies: Weighing in on the Concept of Genotype-First Screening.JAmCollCardiol, International evidence based reappraisal of genes associated with arrhythmogenic right ventricular cardiomyopathy using the clinical genome resource framework.CircGenomPrecisMed.2021;14:e003273., Clinical Implication of Genetic Testing in Dilated Cardiomyopathy.IntJHeart Fail, Clinical Implication of Genetic Testing in Dilated Cardiomyopathy.IntJHeart Fail, Clinical Implication of Genetic Testing in Dilated Cardiomyopathy.IntJHeart Fail, Complex roads from genotype to phenotype in dilated cardiomyopathy: Scientific update from the Working Group of Myocardial Function of the European Society of Cardiology.CardiovascRes.2018;114:1287–1303., Complex roads from genotype to phenotype in dilated cardiomyopathy: Scientific update from the Working Group of Myocardial Function of the European Society of Cardiology.CardiovascRes.2018;114:1287–1303., International evidence based reappraisal of genes associated with arrhythmogenic right ventricular cardiomyopathy using the clinical genome resource framework.CircGenomPrecisMed.2021;14:e003273., Association of Genetic Variants with Outcomes in patients with nonischemic dilated cardiomyopathy.JAmCollCardiol.2021;78:1682–1699., International evidence based reappraisal of genes associated with arrhythmogenic right ventricular cardiomyopathy using the clinical genome resource framework.CircGenomPrecisMed.2021;14:e003273., International evidence based reappraisal of genes associated with arrhythmogenic right ventricular cardiomyopathy using the clinical genome resource framework.CircGenomPrecisMed.2021;14:e003273., International evidence based reappraisal of genes associated with arrhythmogenic right ventricular cardiomyopathy using the clinical genome resource framework.CircGenomPrecisMed.2021;14:e003273., Natural History of MYH7-Related Dilated Cardiomyopathy.JAmCollCardiol.2022;80:1447–1461., International evidence based reappraisal of genes associated with arrhythmogenic right ventricular cardiomyopathy using the clinical genome resource framework.CircGenomPrecisMed.2021;14:e003273., An Update on MYBPC3 Gene Mutation in Hypertrophic Cardiomyopathy.IntJMolSci.2023;24:10510., International evidence based reappraisal of genes associated with arrhythmogenic right ventricular cardiomyopathy using the clinical genome resource framework.CircGenomPrecisMed.2021;14:e003273., Natural History of MYH7-Related Dilated Cardiomyopathy.JAmCollCardiol.2022;80:1447–1461., International evidence based reappraisal of genes associated with arrhythmogenic right ventricular cardiomyopathy using the clinical genome resource framework.CircGenomPrecisMed.2021;14:e003273., Idiopathic restrictive cardiomyopathy is part of the clinical expression of cardiac troponin I mutations.JClinInvestig, Genotype-phenotype correlation in arrhythmogenic right ventricular cardiomyopathy-risk of arrhythmias and heart failure.JMedGenet.2022;59:858–864., Genotype-phenotype correlation in arrhythmogenic right ventricular cardiomyopathy-risk of arrhythmias and heart failure.JMedGenet.2022;59:858–864., Genotype-phenotype correlation in arrhythmogenic right ventricular cardiomyopathy-risk of arrhythmias and heart failure.JMedGenet.2022;59:858–864., Development and validation of a new risk prediction score for life-threatening ventricular tachyarrhythmias in laminopathies.Circulation.2019;140:293–302., 2023 ESC Guidelines for the management of cardiomyopathies: Developed by the task force on the management of cardiomyopathies of the European Society of Cardiology (ESC)EurHeart J.2023;44:3503–3626., Peripartum Cardiomyopathy From a Genetic Perspective.CircJ, Do Genes Influence Susceptibility to Myocarditis?JACC BasicTranslSci",
        "heart failure and genetics beyond cardiomyopathies": "heart failure and genetics beyond cardiomyopathies   HF emerges as a multifaceted outcome shaped by the interplay of genetic, acquired, and environmental dimensions. Common genetic variants can precipitate its onset, suggesting that these variants, in conjunction with environmental factors, amplify the susceptibility to HF. Empirical evidence robustly underscores the hereditary dimensions of HF. The Framingham database [139,140], for instance, revealed a marked 70% increase in the likelihood of HF development in individuals with a family history of the condition. Nonetheless, it is pivotal to recognize that numerous cases are also influenced by lifestyle and external environmental determinants. The trajectory of HF evolution is determined by individual predispositions coupled with the intrinsic factors of accompanying comorbidities. Genetic predispositions can influence susceptibility to the initial event that triggers HF, dictate the progression post-onset, and modulate the efficacy of therapeutic strategies [141].Figure 2summarizes the complexity of the influence of genetic background observed in HF patients.Open in a separate windowFigure 2Influence of genetic background on heart failure onset and progression.Differentiating between acquired and inherited forms of HF presents a nuanced challenge. We advocate for a comprehensive exploration to uncover the potential genetic underpinnings of the condition. This approach assists in identifying family members at heightened risk for HF well before the manifestation of clinical symptoms [122]. Additionally, strategic counseling for patients might encompass recommendations such as avoiding competitive sports, initiating cardioprotective treatments to modulate the disease’s progression, mitigating cardiac decompensation or remodeling phases, and taking proactive measures to minimize the risk of SCD [142].",
        "reference_links__heart failure and genetics beyond cardiomyopathies": "139 //doi.org/10.1093%2Fejechocard%2Fjep007, 140 https://pubmed.ncbi.nlm.nih.gov/23900355, 141 //doi.org/10.1038%2Fnrcardio.2013.105, 122 https://clinicaltrials.gov/ct2/show/NCT01344798, 142 https://pubmed.ncbi.nlm.nih.gov/2766509",
        "reference__heart failure and genetics beyond cardiomyopathies": "Temporal trends in coronary heart disease mortality and sudden cardiac death from 1950 to 1999: The Framingham Heart Study.Circulation, Framingham risk score and prediction of lifetime risk for coronary heart disease.AmJCardiol, Genetics and heart failure: A concise guide for the clinician.CurrCardiolRev, 2023 ESC Guidelines for the management of cardiomyopathies: Developed by the task force on the management of cardiomyopathies of the European Society of Cardiology (ESC)EurHeart J.2023;44:3503–3626., Genetic determinants of heart failure: Facts and numbers.ESC Heart Fail",
        "current guidelines and recommendations": "current guidelines and recommendations   The recent ESC guidelines dedicated to cardiomyopathies provide comprehensive recommendations regarding genetic testing. For individuals with cardiomyopathy, undergoing genetic testing, often for confirmatory or diagnostic purposes, offers multiple benefits: it aids in affirming the diagnosis, providing prognostic insights, guiding therapeutic choices, and assisting reproductive decisions [122]. While genetic testing might not significantly alter the management approach for patients suffering from HF, especially in advanced stages, its indication remains crucial if it could benefit family members. This consideration gains prominence for relatives under prolonged monitoring, especially when the genetic cause remains unidentified. However, such concerns can be mitigated if a family-wide genetic diagnosis is ascertained [143].Upon detection of a pathogenic or likely pathogenic variant in an index patient after analyzing pertinent disease genes aligned with their specific phenotype, cascade genetic testing for first-degree relatives at potential risk becomes feasible, accompanied by preliminary genetic counseling. In cases where a first-degree relative has passed away, consideration should also be given to assessing the immediate relatives of the deceased individual (i.e., the second-degree relatives of the index patient) [122].Genetic counseling, provided by trained healthcare professionals [8], is recommended for families either affected by or suspected to have an inherited cardiomyopathy, regardless of whether they opt for genetic testing. The process of genetic testing for cardiomyopathies should occur under the guidance of a multidisciplinary team proficient in genetic testing methodologies, the interpretation of sequence variants, and the clinical implications of such tests [122]. Typically, this approach is most effectively managed within specialized cardiomyopathy services, or within a network model with equivalent expertise. It is essential that individuals undergoing genetic testing for cardiomyopathy receive both pre- and post-test counseling [144,145].For the index patient, genetic testing is recommended when it aids in diagnosis, prognosis, therapeutic planning, reproductive management, or the cascade genetic assessment of their relatives [146,147].Genetic testing is proposed for deceased individuals diagnosed with cardiomyopathy postmortem, especially if it benefits the management of surviving family members. In situations where the testing does not directly aid in diagnosis, prognosis, therapeutic strategy, or cascade genetic analysis of relatives, such testing can still be contemplated if it yields an overall benefit to the patient [148]. There are multiple potential outcomes when conducting genetic testing on the proband. A comprehensive decisional algorithm and workflow are detailed in the ESC Guidelines [8].Both the ESC guidelines concerning cardiomyopathy and HF emphasize the relevance of genetic insights in deciding upon ICD implantation. As highlighted previously, if certain genetic variants correlate with a heightened risk of SCD, ICD consideration might extend to DCM patients with an LVEF > 35% [122].The guidelines from the American Heart Association (AHA), American College of Cardiology (ACC), and Heart Rhythm Society (HSSA) for managing HF, released in 2022, recommend that for patients with a suspected genetic or hereditary cardiomyopathy, a thorough analysis of the family history, encompassing a minimum of three generations, should be conducted, and a family pedigree should be established [7]. The purpose of these analyses is to identify patients for whom genetic testing could yield significant insights. For certain patients diagnosed with genetic or hereditary cardiomyopathies, genetic screening of their first-degree relatives is advised. The primary goal of this screening is the early detection of cardiac conditions, facilitating swift interventions that could curb the progression of HF and reduce the risk of SCD [7].Currently, no medical treatments tailored to an individual’s genetic makeup or gene therapy are endorsed.",
        "reference_links__current guidelines and recommendations": "122 https://clinicaltrials.gov/ct2/show/NCT01344798, 143 //doi.org/10.1161%2F01.CIR.80.3.564, 122 https://clinicaltrials.gov/ct2/show/NCT01344798, 8 //doi.org/10.1016%2Fj.jacc.2011.08.078, 122 https://clinicaltrials.gov/ct2/show/NCT01344798, 144 /pmc/articles/PMC7286080/, 145 https://pubmed.ncbi.nlm.nih.gov/15561339, 146 //doi.org/10.1016%2Fj.ijcard.2003.10.037, 147 https://pubmed.ncbi.nlm.nih.gov/22179535, 148 //doi.org/10.1161%2FCIRCULATIONAHA.111.055673, 8 //doi.org/10.1016%2Fj.jacc.2011.08.078, 122 https://clinicaltrials.gov/ct2/show/NCT01344798, 7 https://pubmed.ncbi.nlm.nih.gov/22281253, 7 https://pubmed.ncbi.nlm.nih.gov/22281253",
        "reference__current guidelines and recommendations": "2023 ESC Guidelines for the management of cardiomyopathies: Developed by the task force on the management of cardiomyopathies of the European Society of Cardiology (ESC)EurHeart J.2023;44:3503–3626., Results of clinical genetic testing of 2,912 probands with hypertrophic cardiomyopathy: Expanded panels offer limited additional sensitivity.GenetMed.2015;17:880–888., 2023 ESC Guidelines for the management of cardiomyopathies: Developed by the task force on the management of cardiomyopathies of the European Society of Cardiology (ESC)EurHeart J.2023;44:3503–3626., Psychosocial impact of specialized cardiac genetic clinics for hypertrophic cardiomyopathy.GenetMed, 2023 ESC Guidelines for the management of cardiomyopathies: Developed by the task force on the management of cardiomyopathies of the European Society of Cardiology (ESC)EurHeart J.2023;44:3503–3626., Psychosocial impact of predictive genetic testing in hereditary heart diseases: The PREDICT study.JClinMed.2020;9:1365., Genetic counselling: The psychological impact of meeting patients’ expectations.JMedGenet, Genetic counselling and testing in cardiomyopathies: A position statement of the European Society of Cardiology Working Group on Myocardial and Pericardial Diseases.EurHeart J.2010;31:2715–2726., Public Professional Policy Committee (PPPC) of the European Society of Human Genetics (ESHG)Genetic testing in asymptomatic minors: Background considerations towards ESHG recommendations.EurJHumGenet, Clinical impact of post-mortem genetic testing in cardiac death and cardiomyopathy.Open Med.2020;15:435–446., Psychosocial impact of specialized cardiac genetic clinics for hypertrophic cardiomyopathy.GenetMed, 2023 ESC Guidelines for the management of cardiomyopathies: Developed by the task force on the management of cardiomyopathies of the European Society of Cardiology (ESC)EurHeart J.2023;44:3503–3626., Inpatient detection of cardiac-inherited disease: The impact of improving family history taking.Open Heart, Inpatient detection of cardiac-inherited disease: The impact of improving family history taking.Open Heart",
        "genetics and heart failure in clinical practice": "genetics and heart failure in clinical practice   In patients affected by HF caused by cardiomyopathy, the presence of pathogenic genetic variants holds significant implications for clinical management. Successful genetic testing invariably involves at least three key professionals: the geneticist, the cardiomyopathy specialist, and the HF specialist. Their collective expertise becomes invaluable in both patient and family management, as illustrated inFigure 3. The geneticist’s role, detailed throughout this review, is central to identifying pathogenic variants and offering appropriate counseling to patients and their families [8]. Over recent years, the collaboration between cardiomyopathy and HF specialists has gained momentum, proving instrumental in defining genotype–phenotype correlations, evaluating VUS [45] cosegregation, and conducting family screenings. The involvement of the HF specialist, in particular, carries multifaceted significance.Open in a separate windowFigure 3The management of inherited cardiomyopathy should be based on a multidisciplinary approach in which the specialists for heart failure and cardiomyopathies cooperate with the geneticist, in the different stage of heart failure, in order to better manage the patients and their family members. HF: heart failure; QoL: quality of life; SCD: sudden cardiac death; VAD: ventricular assist device.Primarily, specialists in HF must comprehend the clinical implications of specific genetic variants in a patient’s medical trajectory. Moreover, the identification of a genetic variant is paramount for family members when a patient with cardiomyopathy progresses to HF. Collaboration with the geneticist gains further significance in the context of potential advancements in gene therapy. The HF specialist plays a critical role in educating patients and their families, facilitating a comprehensive understanding of the disease, its associated risks, and available treatments. Additionally, the HF specialist can contribute to research endeavors aimed at discerning the association between genetics and cardiomyopathies, contribute to genetic data collection, deepen insights into these conditions, and ensure individualized patient care.Furthermore, certain inherited cardiovascular diseases might manifest with multiorgan involvement. This underscores the importance of a collaborative framework where diverse medical professionals—from geneticists and HF specialists to cardiomyopathy experts—collaborate to devise optimal therapeutic strategies for affected individuals.",
        "reference_links__genetics and heart failure in clinical practice": "8 //doi.org/10.1016%2Fj.jacc.2011.08.078, 45 https://pubmed.ncbi.nlm.nih.gov/28087426",
        "reference__genetics and heart failure in clinical practice": "Psychosocial impact of specialized cardiac genetic clinics for hypertrophic cardiomyopathy.GenetMed, Diagnostic clinical genome and exome sequencing.NEnglJMed",
        "conclusions": "conclusions   In accordance with the recent ESC guidelines on the management of cardiomyopathies, considering the clinical trajectory of this condition and its notable prevalence, especially as a proportion of HF cases, elucidating the genetic background of individuals affected by cardiomyopathies has gained paramount importance [122]. A collaborative approach involving HF specialists, geneticists, and echocardiographers is crucial for a comprehensive clinical evaluation and informed prognosis of these patients. While the future seems promising, the current landscape lacks formally approved and definitive gene therapies for this disease. The precision of patient evaluations and prognostications will likely be enhanced with rigorous data collection, progressive scientific research, and the expansion of known pathological variants and VUSs. Given the nuances of variable expressivity and the challenge of incomplete penetrance, it is vital to incorporate these factors into the overall management strategy for cardiomyopathies. Such an integrated approach not only provides advantages to patients and their families, but also aids in the early detection of potential complications.",
        "reference_links__conclusions": "122 https://clinicaltrials.gov/ct2/show/NCT01344798",
        "reference__conclusions": "2023 ESC Guidelines for the management of cardiomyopathies: Developed by the task force on the management of cardiomyopathies of the European Society of Cardiology (ESC)EurHeart J.2023;44:3503–3626.",
        "funding statement": "funding statement   This research received no external funding.",
        "reference_links__funding statement": "",
        "reference__funding statement": "",
        "author contributions": "author contributions   Conceptualization, G.P., R.S., M.I. and M.M.; data curation, G.P. and M.F.D.; writing—original draft preparation, G.P., M.F.D., R.S. and M.I.; writing—review and editing, M.C., N.D.B. and M.M.; supervision, N.D.B., M.I. and M.M. All authors have read and agreed to the published version of the manuscript.",
        "reference_links__author contributions": "",
        "reference__author contributions": "",
        "institutional review board statement": "institutional review board statement   Not applicable.",
        "reference_links__institutional review board statement": "",
        "reference__institutional review board statement": "",
        "informed consent statement": "informed consent statement   Not applicable.",
        "reference_links__informed consent statement": "",
        "reference__informed consent statement": "",
        "data availability statement": "data availability statement   Not applicable.",
        "reference_links__data availability statement": "",
        "reference__data availability statement": "",
        "conflicts of interest": "conflicts of interest   The authors declare no conflict of interest.",
        "reference_links__conflicts of interest": "",
        "reference__conflicts of interest": "",
        "footnotes": "footnotes   Disclaimer/Publisher’s Note:The statements, opinions and data contained in all publications are solely those of the individual author(s) and contributor(s) and not of MDPI and/or the editor(s). MDPI and/or the editor(s) disclaim responsibility for any injury to people or property resulting from any ideas, methods, instructions or products referred to in the content.",
        "reference_links__footnotes": "",
        "reference__footnotes": "",
        "references": "references   1.Shah R.A., Asatryan B., Sharaf Dabbagh G., Aung N., Khanji M.Y., Lopes L.R., Van Duijvenboden S., Holmes A., Muser D., Landstrom A.P., et al. Genotype-first approach I. Frequency, penetrance, and variable expressivity of dilated cardiomyopathy-associated putative pathogenic gene variants in UK Biobank participants.Circulation.2022;146:110–124. doi: 10.1161/CIRCULATIONAHA.121.058143.[PMC free article][PubMed] [CrossRef][Google Scholar]2.De Marvao A., McGurk K.A., Zheng S.L., Thanaj M., Bai W., Duan J., Biffi C., Mazzarotto F., Statton B., Dawes T.J.W., et al. Phenotypic expression and outcomes in individuals with rare genetic variants of hypertrophic cardiomyopathy.J. Am. Coll. Cardiol.2021;78:1097–1110. doi: 10.1016/j.jacc.2021.07.017.[PMC free article][PubMed] [CrossRef][Google Scholar]3.McGurk K.A., Zheng S.L., Henry A., Josephs K., Edwards M., De Marvao A., Whiffin N., Roberts A., Lumbers T.R., O’Regan D.P., et al. Correspondence on “ACMG SF v3.0 list for reporting of secondary findings in clinical exome and genome sequencing: A policy statement of the American College of Medical Genetics and Genomics (ACMG)” by Miller et al.Genet. Med.2022;24:744–746. doi: 10.1016/j.gim.2021.10.020.[PubMed] [CrossRef][Google Scholar]4.Wahbi K., Ben Yaou R., Gandjbakhch E., Anselme F., Gossios T., Lakdawala N.K., Stalens C., Sacher F., Babuty D., Trochu J.N., et al. Development and validation of a new risk prediction score for life-threatening ventricular tachyarrhythmias in laminopathies.Circulation.2019;140:293–302. doi: 10.1161/CIRCULATIONAHA.118.039410.[PubMed] [CrossRef][Google Scholar]5.Van Rijsingen I.A., Arbustini E., Elliott P.M., Mogensen J., Hermans-van Ast J.F., Van Der Kooi A.J., Van Tintelen J.P., Van den Berg M.P., Pilotto A., Pasotti M., et al. Risk factors for malignant ventricular arrhythmias in lamin A/C mutation carriers a European cohort study.J. Am. Coll. Cardiol.2012;59:493–500. doi: 10.1016/j.jacc.2011.08.078.[PubMed] [CrossRef][Google Scholar]6.Bozkurt B., Coats A.J., Tsutsui H., Abdelhamid M., Adamopoulos S., Albert N., Anker S.D., Atherton J., Böhm M., Butler J., et al. Universal definition and classification of heart failure: A report of the Heart Failure Society of America, Heart Failure Association of the European Society of Cardiology, Japanese Heart Failure Society and Writing Committee of the Universal Definition of Heart Failure.J. Card Fail.2021;27:387–413.[Google Scholar]7.Waddell-Smith K.E., Donoghue T., Oates S., Graham A., Crawford J., Stiles M.K., Aitken A., Skinner J.R. Inpatient detection of cardiac-inherited disease: The impact of improving family history taking.Open Heart.2016;3:e000329. doi: 10.1136/openhrt-2015-000329.[PMC free article][PubMed] [CrossRef][Google Scholar]8.Ingles J., Lind J.M., Phongsavan P., Semsarian C. Psychosocial impact of specialized cardiac genetic clinics for hypertrophic cardiomyopathy.Genet. Med.2008;10:117–120. doi: 10.1097/GIM.0b013e3181612cc7.[PubMed] [CrossRef][Google Scholar]9.Reuter C., Grove M.E., Orland K., Spoonamore K., Caleshu C. Clinical Cardiovascular Genetic Counselors Take a Leading Role in Team-based Variant Classification.J. Genet. Couns.2018;27:751–760. doi: 10.1007/s10897-017-0175-7.[PubMed] [CrossRef][Google Scholar]10.International Human Genome Sequencing Consortium  Finishing the euchromatic sequence of the human genome.Nature.2004;431:931–945. doi: 10.1038/nature03001.[PubMed] [CrossRef][Google Scholar]11.Doevendans P.A., Glijnis P.C., Kranias E.G. Leducq Transatlantic Network of Excellence to Cure Phospholamban-Induced Cardiomyopathy (CURE-PLaN)Circ. Res.2019;125:720–724. doi: 10.1161/CIRCRESAHA.119.315077.[PubMed] [CrossRef][Google Scholar]12.Grote Beverborg N., Später D., Knöl R., Hidalgo A., Yeh S.T., Elbeck Z., Silljé H.H.W., Eijgenraam T.R., Siga H., Zurek M., et al. Phospholamban antisense oligonucleotides improve cardiac function in murine cardiomyopathy.Nat. Commun.2021;12:5180. doi: 10.1038/s41467-021-25439-0.[PMC free article][PubMed] [CrossRef][Google Scholar]13.Collins F.S., Varmus H. A new initiative on precision medicine.N. Engl. J. Med.2015;372:793–795. doi: 10.1056/NEJMp1500523.[PMC free article][PubMed] [CrossRef][Google Scholar]14.Motsinger-Reif A.A., Jorgenson E., Relling M.V., Kroetz D.L., Weinshilboum R., Cox N.J., Roden D.M. Genome-wide association studies in pharmacogenomics: Successes and lessons.Pharmacogenet. Genom.2013;23:383–394. doi: 10.1097/FPC.0b013e32833d7b45.[PMC free article][PubMed] [CrossRef][Google Scholar]15.Huertas-Vazquez A., Nelson C.P., Sinsheimer J.S., Reinier K., Uy-Evanado A., Teodorescu C., Ayala J., Hall A.S., Gunson K., Jui J., et al. Cumulative effects of common genetic variants on risk of sudden cardiac death.Int. J. Cardiol. Heart Vasc.2015;7:88–91. doi: 10.1016/j.ijcha.2015.03.001.[PMC free article][PubMed] [CrossRef][Google Scholar]16.Hajek C., Guo X., Yao J., Hai Y., Johnson W.C., Frazier-Wood A.C., Post W.S., Psaty B.M., Taylor K.D., Rotter J.I. Coronary heart disease genetic risk score predicts cardiovascular disease risk in men, not women.Circ. Genom. Precis Med.2018;11:e002324. doi: 10.1161/CIRCGEN.118.002324.[PMC free article][PubMed] [CrossRef][Google Scholar]17.Subas T., Luiten R., Hanson-Kahn A., Wheeler M., Caleshu C. Evolving decisions: Perspectives of active and athletic individuals with inherited heart disease who exercise against recommendations.J. Genet. Couns.2019;28:119–129. doi: 10.1007/s10897-018-0297-6.[PubMed] [CrossRef][Google Scholar]18.Day S.M. Exercise in hypertrophic cardiomyopathy.J. Cardiovasc. Transl. Res.2009;2:407–414. doi: 10.1007/s12265-009-9134-5.[PubMed] [CrossRef][Google Scholar]19.Richard P., Charron P., Carrier L., Ledeuil C., Cheav T., Pichereau C., Benaiche A., Isnard R., Dubourg O., Burban M., et al. Hypertrophic cardiomyopathy: Distribution of disease genes, spectrum of mutations, and implications for a molecular diagnosis strategy.Circulation.2003;107:2227–2232. doi: 10.1161/01.CIR.0000066323.15244.54.[PubMed] [CrossRef][Google Scholar]20.Van Velzen H.G., Schinkel A.F.L., Baart S.J., Oldenburg R.A., Frohn-Mulder I.M.E., van Slegtenhorst M.A., Michels M. Outcomes of contemporary family screening in hypertrophic cardiomyopathy.Circ. Genom. Precis. Med.2018;11:e001896. doi: 10.1161/CIRCGEN.117.001896.[PubMed] [CrossRef][Google Scholar]21.Gimeno J.R., Lacunza J., García-Alberola A., Cerdán M.C., Oliva M.J., García-Molina E., López-Ruiz M., Castro F., González-Carrillo J., de la Morena G., et al. Penetrance and risk profile in inherited cardiac diseases studied in a dedicated screening clinic.Am. J. Cardiol.2009;104:406–410. doi: 10.1016/j.amjcard.2009.03.055.[PubMed] [CrossRef][Google Scholar]22.Ingles J., McGaughran J., Scuffham P.A., Atherton J., Semsarian C. A cost-effectiveness model of genetic testing for the evaluation of families with hypertrophic cardiomyopathy.Heart.2012;98:625–630. doi: 10.1136/heartjnl-2011-300368.[PubMed] [CrossRef][Google Scholar]23.Stiles M.K., Wilde A.A.M., Abrams D.J., Ackerman M.J., Albert C.M., Behr E.R., Chugh S.S., Cornel M.C., Gardner K., Ingles J., et al. 2020 APHRS/HRS expert consensus statement on the investigation of decedents with sudden unexplained death and patients with sudden cardiac arrest, and of their families.Heart Rhythm.2021;18:e1–e50. doi: 10.1016/j.hrthm.2020.10.010.[PMC free article][PubMed] [CrossRef][Google Scholar]24.Fumagalli C., Olivotto I. The importance of sex differences in patients with hypertrophic cardiomyopathy–Tailoring management and future perspectives.Am. J. Med. Sci.2020;360:433–434. doi: 10.1016/j.amjms.2020.07.004.[PubMed] [CrossRef][Google Scholar]25.McKenna W.J., Maron B.J., Thiene G. Classification, epidemiology, and global burden of cardiomyopathies.Circ. Res.2017;121:722–730. doi: 10.1161/CIRCRESAHA.117.309711.[PubMed] [CrossRef][Google Scholar]26.Conrad D.F., Keebler J.E., DePristo M.A., Lindsay S.J., Zhang Y., Casals F., Idaghdour Y., Hartl C.L., Torroja C., Garimella K.V., et al. Variation in genome-wide mutation rates within and between human families.Nat. Genet.2011;43:712–714.[PMC free article][PubMed][Google Scholar]27.1000 Genomes Project Consortium. Abecasis G.R., Altshuler D., Auton A., Brooks L.D., Durbin R.M., Gibbs R.A., Hurles M.E., McVean G. A map of human genome variation from population-scale sequencing.Nature.2010;467:1061–1073. doi: 10.1038/nature09534.[PMC free article][PubMed] [CrossRef][Google Scholar]28.Choi M., Scholl U.I., Ji W., Liu T., Tikhonova I.R., Zumbo P., Nayir A., Bakkaloğlu A., Ozen S., Sanjad S., et al. Genetic diagnosis by whole exome capture and massively parallel DNA sequencing.Proc. Natl. Acad. Sci. USA.2009;106:19096–19101. doi: 10.1073/pnas.0910672106.[PMC free article][PubMed] [CrossRef][Google Scholar]29.Claussnitzer M., Cho J.H., Collins R., Cox N.J., Dermitzakis E.T., Hurles M.E., Kathiresan S., Kenny E.E., Lindgren C.M., MacArthur D.G., et al. A brief history of human disease genetics.Nature.2020;577:179–189. doi: 10.1038/s41586-019-1879-7.[PMC free article][PubMed] [CrossRef][Google Scholar]30.Visser M., Dooijes D., van der Smagt J.J., van der Heijden J.F., Doevendans P.A., Loh P., Asselbergs F.W., Hassink R.J. Next-generation sequencing of a large gene panel in patients initially diagnosed with idiopathic ventricular fibrillation.Heart Rhythm.2017;14:1035–1040. doi: 10.1016/j.hrthm.2017.01.010.[PubMed] [CrossRef][Google Scholar]31.Chaisson M.J.P., Sanders A.D., Zhao X., Malhotra A., Porubsky D., Rausch T., Gardner E.J., Rodriguez O.L., Guo L., Collins R.L., et al. Multi-platform discovery of haplotype-resolved structural variation in human genomes.Nat. Commun.2019;10:1784. doi: 10.1038/s41467-018-08148-z.[PMC free article][PubMed] [CrossRef][Google Scholar]32.Alkan C., Coe B.P., Eichler E.E. Genome structural variation discovery and genotyping.Nat. Rev. Genet.2011;12:363–376. doi: 10.1038/nrg2958.[PMC free article][PubMed] [CrossRef][Google Scholar]33.Sanger F., Nicklen S., Coulson A.R. DNA sequencing with chain-terminating inhibitors.Proc. Natl. Acad. Sci. USA.1977;74:5463–5467. doi: 10.1073/pnas.74.12.5463.[PMC free article][PubMed] [CrossRef][Google Scholar]34.Bagnall R.D., Weintraub R.G., Ingles J., Duflou J., Yeates L., Lam L., Davis A.M., Thompson T., Connell V., Wallace J., et al. A prospective study of sudden cardiac death among children and young adults.N. Engl. J. Med.2016;374:2441–2452. doi: 10.1056/NEJMoa1510687.[PubMed] [CrossRef][Google Scholar]35.Margulies M., Egholm M., Altman W.E., Attiya S., Bader J.S., Bemben L.A., Berka J., Braverman M.S., Chen Y.J., Chen Z., et al. Genome sequencing in microfabricated high-density picolitre reactors.Nature.2005;437:376–380. doi: 10.1038/nature03959.[PMC free article][PubMed] [CrossRef][Google Scholar]36.Bentley D.R., Balasubramanian S., Swerdlow H.P., Smith G.P., Milton J., Brown C.G., Hall K.P., Evers D.J., Barnes C.L., Bignell H.R., et al. Accurate whole human genome sequencing using reversible terminator chemistry.Nature.2008;456:53–59. doi: 10.1038/nature07517.[PMC free article][PubMed] [CrossRef][Google Scholar]37.Haas J., Frese K.S., Peil B., Kloos W., Keller A., Nietsch R., Feng Z., Müller S., Kayvanpour E., Vogel B., et al. Atlas of the clinical genetics of human dilated cardiomyopathy.Eur. Heart J.2015;36:1123–1135. doi: 10.1093/eurheartj/ehu301.[PubMed] [CrossRef][Google Scholar]38.Michels V.V., Moll P.P., Miller F.A., Tajik A.J., Chu J.S., Driscoll D.J., Burnett J.C., Rodeheffer R.J., Chesebro J.H., Tazelaar H.D. The frequency of familial dilated cardiomyopathy in a series of patients with idiopathic dilated cardiomyopathy.N. Engl. J. Med.1992;326:77–82. doi: 10.1056/NEJM199201093260201.[PubMed] [CrossRef][Google Scholar]39.Whiffin N., Karczewski K.J., Zhang X., Chothani S., Smith M.J., Evans D.G., Roberts A.M., Quaife N.M., Schafer S., Rackham O., et al. Characterizing the loss-of-function impact of 5’ untranslated region variants in 15,708 individuals.Nat. Commun.2020;11:2523. doi: 10.1038/s41467-019-10717-9.[PMC free article][PubMed] [CrossRef][Google Scholar]40.Schwartz P.J., Crotti L., George A.L., Jr. Modifier genes for sudden cardiac death.Eur. Heart J.2018;39:3925–3931. doi: 10.1093/eurheartj/ehy502.[PMC free article][PubMed] [CrossRef][Google Scholar]41.Kalia S.S., Adelman K., Bale S.J., Chung W.K., Eng C., Evans J.P., Herman G.E., Hufnagel S.B., Klein T.E., Korf B.R., et al. Recommendations for reporting of secondary findings in clinical exome and genome sequencing, 2016 update (ACMG SF v2.0): A policy statement of the American College of Medical Genetics and Genomics.Genet. Med.2017;19:249–255. doi: 10.1038/gim.2016.190.[PubMed] [CrossRef][Google Scholar]42.Hanchard N.A., Umana L.A., D’Alessandro L., Azamian M., Poopola M., Morris S.A., Fernbach S., Lalani S.R., Towbin J.A., Zender G.A., et al. Assessment of large copy number variants in patients with apparently isolated congenital left-sided cardiac lesions reveals clinically relevant genomic events.Am. J. Med. Genet. A.2017;173:2176–2188. doi: 10.1002/ajmg.a.38309.[PMC free article][PubMed] [CrossRef][Google Scholar]43.LaFramboise T. Single nucleotide polymorphism arrays: A decade of biological, computational and technological advances.Nucleic Acids Res.2009;37:4181–4193. doi: 10.1093/nar/gkp552.[PMC free article][PubMed] [CrossRef][Google Scholar]44.Giudicessi J.R., Lieve K.V.V., Rohatgi R.K., Koca F., Tester D.J., van der Werf C., Martijn Bos J., Wilde A.A.M., Ackerman M.J. Assessment and validation of a phenotype-enhanced variant classification framework to promote or demote RYR2 missense variants of uncertain significance.Circ. Genom. Precis. Med.2019;12:e002510. doi: 10.1161/CIRCGEN.119.002510.[PubMed] [CrossRef][Google Scholar]45.Biesecker L.G., Green R.C. Diagnostic clinical genome and exome sequencing.N. Engl. J. Med.2014;370:2418–2425. doi: 10.1056/NEJMra1312543.[PubMed] [CrossRef][Google Scholar]46.Seleman M., Hoyos-Bachiloglu R., Geha R.S., Chou J. Uses of Next-Generation Sequencing Technologies for the Diagnosis of Primary Immunodeficiencies.Front. Immunol.2017;8:847. doi: 10.3389/fimmu.2017.00847.[PMC free article][PubMed] [CrossRef][Google Scholar]47.[(accessed on 15 September 2023)];Available online:https://www.ncbi.nlm.nih.gov/clinvar/48.[(accessed on 15 September 2023)].  Available online:https://www.omim.org49.[(accessed on 15 September 2023)].  Available online:http://genetics.bwh.harvard.edu/pph2/50.[(accessed on 15 September 2023)].  Available online:https://www.mutationtaster.org51.[(accessed on 15 September 2023)].  Available online:https://www.jcvi.org/research/provean52.Richards S., Aziz N., Bale S., Bick D., Das S., Gastier-Foster J., Grody W.W., Hegde M., Lyon E., Spector E., et al. Standards and guidelines for the interpretation of sequence variants: A joint consensus recommendation of the American College of Medical Genetics and Genomics and the Association for Molecular Pathology.Genet. Med.2015;17:405–424. doi: 10.1038/gim.2015.30.[PMC free article][PubMed] [CrossRef][Google Scholar]53.Doh C.Y., Kampourakis T., Campbell K.S., Stelzer J.E. Basic science methods for the characterization of variants of uncertain significance in hypertrophic cardiomyopathy.Front. Cardiovasc. Med.2023;10:1238515. doi: 10.3389/fcvm.2023.1238515.[PMC free article][PubMed] [CrossRef][Google Scholar]54.Oulas A., Minadakis G., Zachariou M., Spyrou G.M. Selecting variants of unknown significance through network-based gene-association significantly improves risk prediction for disease-control cohorts.Sci. Rep.2019;9:3266. doi: 10.1038/s41598-019-39796-w.[PMC free article][PubMed] [CrossRef][Google Scholar]55.Zhang X., Walsh R., Whiffin N., Buchan R., Midwinter W., Wilk A., Govind R., Li N., Ahmad M., Mazzarotto F., et al. Disease-specific variant pathogenicity prediction significantly improves variant interpretation in inherited cardiac conditions.Genet. Med.2021;23:69–79. doi: 10.1038/s41436-020-00972-3.[PMC free article][PubMed] [CrossRef][Google Scholar]56.Barbosa P., Ribeiro M., Carmo-Fonseca M., Fonseca A. Clinical significance of genetic variation in hypertrophic cardiomyopathy: Comparison of computational tools to prioritize missense variants.Front. Cardiovasc. Med.2022;9:975478. doi: 10.3389/fcvm.2022.975478.[PMC free article][PubMed] [CrossRef][Google Scholar]57.Wong E.K., Bartels K., Hathaway J., Burns C., Yeates L., Semsarian C., Krahn A.D., Virani A., Ingles J. Perceptions of genetic variant reclassification in patients with inherited cardiac disease.Eur. J. Hum. Genet.2019;27:1134–1142. doi: 10.1038/s41431-019-0377-6.[PMC free article][PubMed] [CrossRef][Google Scholar]58.Ingles J., Yeates L., O’Brien L., McGaughran J., Scuffham P.A., Atherton J., Semsarian C. Genetic testing for inherited heart diseases: Longitudinal impact on health-related quality of life.Genet. Med.2012;14:749–752. doi: 10.1038/gim.2012.47.[PubMed] [CrossRef][Google Scholar]59.Schwartz P.J., Breithardt G., Howard A.J., Julian D.G., Rehnqvist Ahlberg N. Task Force Report: The legal implications of medical guidelines—A Task Force of the European Society of Cardiology.Eur. Heart J.1999;20:1152–1157. doi: 10.1053/euhj.1999.1677.[PubMed] [CrossRef][Google Scholar]60.Lambert S.A., Gil L., Jupp S., Ritchie S.C., Xu Y., Buniello A., McMahon A., Abraham G., Chapman M., Parkinson H., et al. The Polygenic Score Catalog as an open database for reproducibility and systematic evaluation.Nat. Genet.2021;53:420–425. doi: 10.1038/s41588-021-00783-5.[PubMed] [CrossRef][Google Scholar]61.Lahrouchi N., Tadros R., Crotti L., Mizusawa Y., Postema P.G., Beekman L., Walsh R., Hasegawa K., Barc J., Ernsting M., et al. Transethnic genome-wide association study provides insights in the genetic architecture and heritability of long QT syndrome.Circulation.2020;142:324–338. doi: 10.1161/CIRCULATIONAHA.120.045956.[PMC free article][PubMed] [CrossRef][Google Scholar]62.Harper A.R., Goel A., Grace C., Thomson K.L., Petersen S.E., Xu X., Waring A., Ormondroyd E., Kramer C.M., Ho C.Y., et al. HCMR Investigators. Common genetic variants and modifiable risk factors underpin hypertrophic cardiomyopathy susceptibility and expressivity.Nat. Genet.2021;53:135–142. doi: 10.1038/s41588-020-00764-0.[PMC free article][PubMed] [CrossRef][Google Scholar]63.Tadros R., Tan H.L., ESCAPE-NET Investigators. El Mathari S., Kors J.A., Postema P.G., Lahrouchi N., Beekman L., Radivojkov-Blagojevic M., Amin A.S., et al. Predicting cardiac electrical response to sodiumchannel blockade and Brugada syndrome using polygenic risk scores.Eur. Heart J.2019;40:3097–3107. doi: 10.1093/eurheartj/ehz435.[PMC free article][PubMed] [CrossRef][Google Scholar]64.Turkowski K.L., Dotzler S.M., Tester D.J., Giudicessi J.R., Bos J.M., Speziale A.D., Vollenweider J.M., Ackerman M.J. Corrected QT interval-polygenic risk score and its contribution to type 1, type 2, and type 3 long-QT syndrome in probands and genotype-positive family members.Circ. Genom. Precis. Med.2020;13:e002922. doi: 10.1161/CIRCGEN.120.002922.[PubMed] [CrossRef][Google Scholar]65.Connolly S.J., Hallstrom A.P., Cappato R., Schron E.B., Kuck K.H., Zipes D.P., Greene H.L., Boczor S., Domanski M., Follmann D., et al. Meta-analysis of the implantable cardioverter defibrillator secondary prevention trials.Eur. Heart J.2000;21:2071–2078. doi: 10.1053/euhj.2000.2476.[PubMed] [CrossRef][Google Scholar]66.Chivulescu M., Lie Ø.H., Popescu B.A., Skulstad H., Edvardsen T., Jurcut R.O., Haugaa K.H. High penetrance and similar disease progression in probands and in family members with arrhythmogenic cardiomyopathy.Eur. Heart J.2020;41:1401–1410. doi: 10.1093/eurheartj/ehz570.[PMC free article][PubMed] [CrossRef][Google Scholar]67.Cardim N., Freitas A., Brito D. From hypertrophic cardiomyopathy centers to inherited cardiovascular disease centers in Europe. A small or a major step? A position paper from the Nucleus of the Working Group on Myocardial and Pericardial Diseases of the Portuguese Society of Cardiology.Rev. Port. Cardiol.2011;30:829–835. doi: 10.1016/j.repc.2011.09.005.[PubMed] [CrossRef][Google Scholar]68.Barriales-Villa R., Gimeno-Blanes J.R., Zorio-Grima E., Ripoll-Vera T., Evangelista-Masip A., Moya-Mitjans A., Serratosa-Fernández L., Albert-Brotons D.C., García-Pinilla J.M., García-Pavía P. Plan of action for inherited cardiovascular diseases: Synthesis of recommendations and action algorithms.Rev. Esp. Cardiol.2016;69:300–309. doi: 10.1016/j.recesp.2015.11.031.[PubMed] [CrossRef][Google Scholar]69.Edwards A., Gray J., Clarke A., Dundon J., Elwyn G., Gaff C., Hood K., Iredale R., Sivell S., Shaw C., et al. Interventions to improve risk communication in clinical genetics: Systematic review.Patient Educ. Couns.2008;71:4–25. doi: 10.1016/j.pec.2007.11.026.[PubMed] [CrossRef][Google Scholar]70.Whyte S., Green A., McAllister M., Shipman H. Family communication in inherited cardiovascular conditions in Ireland.J. Genet. Couns.2016;25:1317–1326. doi: 10.1007/s10897-016-9974-5.[PubMed] [CrossRef][Google Scholar]71.Daly M.B., Montgomery S., Bingler R., Ruth K. Communicating genetic test results within the family: Is it lost in translation? A survey of relatives in the randomized six-step study.Fam. Cancer.2016;15:697–706. doi: 10.1007/s10689-016-9889-1.[PMC free article][PubMed] [CrossRef][Google Scholar]72.Kaphingst K.A., Blanchard M., Milam L., Pokharel M., Elrick A., Goodman M.S. Relationships between health literacy and genomics-related knowledge, self-efficacy, perceived importance, and communication in a medically underserved population.J. Health Commun.2016;21:58–68. doi: 10.1080/10810730.2016.1144661.[PMC free article][PubMed] [CrossRef][Google Scholar]73.de Boer R.A., Heymans S., Backs J., Carrier L., Coats A.J.S., Dimmeler S., Eschenhagen T., Filippatos G., Gepstein L., Hulot J.S., et al. Targeted therapies in genetic dilated and hypertrophic cardiomyopathies: From molecular mechanisms to therapeutic targets. A position paper from the Heart Failure Association (HFA) and the Working Group on Myocardial Function of the European Society of Cardiology (ESC)Eur. J. Heart Fail.2022;24:406–420.[PMC free article][PubMed][Google Scholar]74.Anzalone A.V., Koblan L.W., Liu D.R. Genome editing with CRISPR-Cas nucleases, base editors, transposases and prime editors.Nat. Biotechnol.2020;38:824–844. doi: 10.1038/s41587-020-0561-9.[PubMed] [CrossRef][Google Scholar]75.Fomin A., Gärtner A., Cyganek L., Tiburcy M., Tuleta I., Wellers L., Folsche L., Hobbach A.J., von Frieling-Salewsky M., Unger A., et al. Truncated titin proteins and titin haploinsufficiency are targets for functional recovery in human cardiomyopathy due to TTN mutations.Sci. Transl. Med.2021;13:eabd3079. doi: 10.1126/scitranslmed.abd3079.[PubMed] [CrossRef][Google Scholar]76.Hinson J.T., Chopra A., Nafissi N., Polacheck W.J., Benson C.C., Swist S., Gorham J., Yang L., Schafer S., Sheng C.C., et al. Titin mutations in iPS cells define sarcomere insufficiency as a cause of dilated cardiomyopathy.Science.2015;349:982–986. doi: 10.1126/science.aaa5458.[PMC free article][PubMed] [CrossRef][Google Scholar]77.Takahashi K., Tanabe K., Ohnuki M., Narita M., Ichisaka T., Tomoda K., Yamanaka S. Induction of pluripotent stem cells from adult human fibroblasts by defined factors.Cell.2007;131:861–872. doi: 10.1016/j.cell.2007.11.019.[PubMed] [CrossRef][Google Scholar]78.Bellin M., Casini S., Davis R.P., D’Aniello C., Haas J., Ward-van Oostwaard D., Tertoolen L.G., Jung C.B., Elliott D.A., Welling A., et al. Isogenic human pluripotent stem cell pairs reveal the role of a KCNH2 mutation in long-QT syndrome.EMBO J.2013;32:3161–3175. doi: 10.1038/emboj.2013.240.[PMC free article][PubMed] [CrossRef][Google Scholar]79.Prondzynski M., Lemoine M.D., Zech A.T., Horváth A., Di Mauro V., Koivumäki J.T., Kresin N., Busch J., Krause T., Krämer E., et al. Disease modeling of a mutation in α-actinin 2 guides clinical therapy in hypertrophic cardiomyopathy.EMBO Mol. Med.2019;11:e11115. doi: 10.15252/emmm.201911115.[PMC free article][PubMed] [CrossRef][Google Scholar]80.Moretti A., Fonteyne L., Giesert F., Hoppmann P., Meier A.B., Bozoglu T., Baehr A., Schneider C.M., Sinnecker D., Klett K., et al. Somatic gene editing ameliorates skeletal and cardiac muscle failure in pig and human models of Duchenne muscular dystrophy.Nat. Med.2020;26:207–214. doi: 10.1038/s41591-019-0738-2.[PMC free article][PubMed] [CrossRef][Google Scholar]81.Nelson C.E., Hakim C.H., Ousterout D.G., Thakore P.I., Moreb E.A., Castellanos Rivera R.M., Madhavan S., Pan X., Ran F.A., Yan W.X., et al. In vivo genome editing improves muscle function in a mouse model of Duchenne muscular dystrophy.Science.2016;351:403–407. doi: 10.1126/science.aad5143.[PMC free article][PubMed] [CrossRef][Google Scholar]82.Yu G., Chakrabarti S., Tischenko M., Chen A.L., Wang Z., Cho H., French B.A., Naga Prasad S.V., Chen Q., Wang Q.K. Gene therapy targeting protein trafficking regulator MOG1 in mouse models of Brugada syndrome, arrhythmias, and mild cardiomyopathy.Sci. Transl. Med.2022;14:eabf3136. doi: 10.1126/scitranslmed.abf3136.[PubMed] [CrossRef][Google Scholar]83.[(accessed on 15 September 2023)];Available online:https://clinicaltrials.gov84.[(accessed on 15 September 2023)];Available online:  https://clinicaltrials.gov/study/{\"type\":\"clinical-trial\",\"attrs\":{\"text\":\"NCT05302271\",\"term_id\":\"NCT05302271\"}}NCT05302271?cond=Cardiomyopathies&intr=gene%20therapy&rank=185.[(accessed on 15 September 2023)];Available online:  https://clinicaltrials.gov/study/{\"type\":\"clinical-trial\",\"attrs\":{\"text\":\"NCT00494195\",\"term_id\":\"NCT00494195\"}}NCT00494195?cond=Cardiomyopathies&intr=gene%20therapy&rank=486.[(accessed on 15 September 2023)];Available online:  https://clinicaltrials.gov/study/{\"type\":\"clinical-trial\",\"attrs\":{\"text\":\"NCT05885412\",\"term_id\":\"NCT05885412\"}}NCT05885412?cond=Cardiomyopathies&intr=gene%20therapy&page=2&rank=1187.[(accessed on 15 September 2023)];Available online:  https://clinicaltrials.gov/study/{\"type\":\"clinical-trial\",\"attrs\":{\"text\":\"NCT01344798\",\"term_id\":\"NCT01344798\"}}NCT01344798?cond=Cardiomyopathies&intr=gene%20therapy&page=1&rank=788.[(accessed on 15 September 2023)];Available online:  https://clinicaltrials.gov/study/{\"type\":\"clinical-trial\",\"attrs\":{\"text\":\"NCT02346422\",\"term_id\":\"NCT02346422\"}}NCT02346422?cond=Cardiomyopathies&intr=gene%20therapy&page=1&rank=989.[(accessed on 15 September 2023)];Available online:  https://clinicaltrials.gov/study/{\"type\":\"clinical-trial\",\"attrs\":{\"text\":\"NCT05445323\",\"term_id\":\"NCT05445323\"}}NCT05445323?cond=Cardiomyopathies&intr=gene%20therapy&rank=390.[(accessed on 15 September 2023)];Available online:  https://clinicaltrials.gov/study/{\"type\":\"clinical-trial\",\"attrs\":{\"text\":\"NCT01966887\",\"term_id\":\"NCT01966887\"}}NCT01966887?cond=Cardiomyopathies&intr=gene%20therapy&rank=291.[(accessed on 15 September 2023)];Available online:  https://clinicaltrials.gov/study/{\"type\":\"clinical-trial\",\"attrs\":{\"text\":\"NCT03439514\",\"term_id\":\"NCT03439514\"}}NCT03439514?cond=Cardiomyopathies&intr=gene%20therapy&page=2&rank=1292.[(accessed on 15 September 2023)];Available online:  https://clinicaltrials.gov/study/{\"type\":\"clinical-trial\",\"attrs\":{\"text\":\"NCT05836259\",\"term_id\":\"NCT05836259\"}}NCT05836259?cond=Cardiomyopathies&intr=gene%20therapy&page=2&rank=1393.[(accessed on 15 September 2023)];Available online:  https://clinicaltrials.gov/study/{\"type\":\"clinical-trial\",\"attrs\":{\"text\":\"NCT00279539\",\"term_id\":\"NCT00279539\"}}NCT00279539?cond=Cardiomyopathies&intr=gene%20therapy&page=2&rank=2094.[(accessed on 15 September 2023)];Available online:  https://clinicaltrials.gov/study/{\"type\":\"clinical-trial\",\"attrs\":{\"text\":\"NCT03882437\",\"term_id\":\"NCT03882437\"}}NCT03882437?cond=Cardiomyopathies&intr=gene%20therapy&page=3&rank=2195.Elliott P., Andersson B., Arbustini E., Bilinska Z., Cecchi F., Charron P., Dubourg O., Kühl U., Maisch B., McKenna W.J., et al. Classification of the cardiomyopathies: A position statement from the European Society of Cardiology Working Group on Myocardial and Pericardial Diseases.Eur. Heart J.2008;29:270–276. doi: 10.1093/eurheartj/ehm342.[PubMed] [CrossRef][Google Scholar]96.Hada Y., Sakamoto T., Amano K., Yamaguchi T., Takenaka K., Takahashi H., Takikawa R., Hasegawa I., Takahashi T., Suzuki J. Prevalence of hypertrophic cardiomyopathy in a population of adult Japanese workers as detected by echocardiographic screening.Am. J. Cardiol.1987;59:183–184. doi: 10.1016/S0002-9149(87)80107-8.[PubMed] [CrossRef][Google Scholar]97.Maro E.E., Janabi M., Kaushik R. Clinical and echocardiographic study of hypertrophic cardiomyopathy in Tanzania.Trop. Doct.2006;36:225–227. doi: 10.1258/004947506778604904.[PubMed] [CrossRef][Google Scholar]98.Anan R., Shono H., Kisanuki A., Arima S., Nakao S., Tanaka H. Patients with familial hypertrophic cardiomyopathy caused by a Phe110Ile missense mutation in the cardiac troponin T gene have variable cardiac morphologies and a favorable prognosis.Circulation.1998;98:391–397. doi: 10.1161/01.CIR.98.5.391.[PubMed] [CrossRef][Google Scholar]99.Nagueh S.F., Appleton C.P., Gillebert T.C., Marino P.N., Oh J.K., Smiseth O.A., Waggoner A.D., Flachskampf F.A., Pellikka P.A., Evangelisa A. Recommendations for the evaluation of left ventricular diastolic function by echocardiography.Eur. J. Echocardiogr.2009;10:165–193. doi: 10.1093/ejechocard/jep007.[PubMed] [CrossRef][Google Scholar]100.Hershberger R.E., Hedges D.J., Morales A. Dilated cardiomyopathy: The complexity of a diverse genetic architecture.Nat. Rev. Cardiol.2013;10:531–547. doi: 10.1038/nrcardio.2013.105.[PubMed] [CrossRef][Google Scholar]101.Codd M.B., Sugrue D.D., Gersh B.J., Melton L.J., III Epidemiology of idiopathic dilated and hypertrophic cardiomyopathy. A population-based study in Olmsted County, Minnesota, 1975–1984.Circulation.1989;80:564–572. doi: 10.1161/01.CIR.80.3.564.[PubMed] [CrossRef][Google Scholar]102.Smith E.D., Lakdawala N.K., Papoutsidakis N., Aubert G., Mazzanti A., McCanta A.C., Agarwal P.P., Arscott P., Dellefave-Castillo L.M., Vorovich E.E., et al. Desmoplakin cardiomyopathy, a fibrotic and inflammatory form of cardiomyopathy distinct from typical dilated or arrhythmogenic right ventricular cardiomyopathy.Circulation.2020;141:1872–1884. doi: 10.1161/CIRCULATIONAHA.119.044934.[PMC free article][PubMed] [CrossRef][Google Scholar]103.Peters S., Trümmel M., Meyners W. Prevalence of right ventricular dysplasiacardiomyopathy in a non-referral hospital.Int. J. Cardiol.2004;97:499–501. doi: 10.1016/j.ijcard.2003.10.037.[PubMed] [CrossRef][Google Scholar]104.Migliore F., Zorzi A., Michieli P., Marra Perazzolo M., Siciliano M., Rigato I., Bauce B., Basso C., Toazza D., Schiavon M., et al. Prevalence of cardiomyopathy in Italian asymptomatic children with electrocardiographic T-wave inversion at preparticipation screening.Circulation.2012;125:529–538. doi: 10.1161/CIRCULATIONAHA.111.055673.[PubMed] [CrossRef][Google Scholar]105.Merner N.D., Hodgkinson K.A., Haywood A.F.M., Connors S., French V.M., Drenckhahn J.D., Kupprion C., Ramadanova K., Thierfelder L., McKenna W., et al. Arrhythmogenic right ventricular cardiomyopathy type 5 is a fully penetrant, lethal arrhythmic disorder caused by a missense mutation in the TMEM43 gene.Am. J. Hum. Genet.2008;82:809–821. doi: 10.1016/j.ajhg.2008.01.010.[PMC free article][PubMed] [CrossRef][Google Scholar]106.James C.A., Jongbloed J.D.H., Hershberger R.E., Morales A., Judge D.P., Syrris P., Pilichou K., Domingo A.M., Murray B., Cadrin-Tourigny J., et al. International evidence based reappraisal of genes associated with arrhythmogenic right ventricular cardiomyopathy using the clinical genome resource framework.Circ. Genom. Precis. Med.2021;14:e003273. doi: 10.1161/CIRCGEN.120.003273.[PMC free article][PubMed] [CrossRef][Google Scholar]107.van Tintelen J.P., Van Gelder I.C., Asimaki A., Suurmeijer A.J., Wiesfeld A.C., Jongbloed J.D., van den Wijngaard A.,  Kuks J.B., van Spaendonck-Zwarts K.Y., Notermans N., et al. Severe cardiac phenotype with right ventricular predominance in a large cohort of patients with a single missense mutation in the DES gene.Heart Rhythm.2009;6:1574–1583. doi: 10.1016/j.hrthm.2009.07.041.[PubMed] [CrossRef][Google Scholar]108.Mogensen J., Kubo T., Duque M., Uribe W., Shaw A., Murphy R., Gimeno J.R., Elliott P., McKenna W.J. Idiopathic restrictive cardiomyopathy is part of the clinical expression of cardiac troponin I mutations.J. Clin. Investig.2003;111:209–216. doi: 10.1172/JCI200316336.[PMC free article][PubMed] [CrossRef][Google Scholar]109.Lee D.S., Pencina M.J., Benjamin E.J., Wang T.J., Levy D., O’Donnell C.J., Nam B.H., Larson M.G., D’Agostino R.B., Vasan R.S. Association of parental heart failure with risk of heart failure in offspring.N. Engl. J. Med.2006;355:138–147. doi: 10.1056/NEJMoa052948.[PubMed] [CrossRef][Google Scholar]110.De Backer J., Narula J. Cardiolaminopathies: Weighing in on the Concept of Genotype-First Screening.J. Am. Coll. Cardiol.2022;80:60–62. doi: 10.1016/j.jacc.2022.04.036.[PubMed] [CrossRef][Google Scholar]111.Teekakirikul P., Zhu W., Huang H.C., Fung E. Hypertrophic Cardiomyopathy: An Overview of Genetics and Management.Biomolecules.2019;9:878.  doi: 10.3390/biom9120878.[PMC free article][PubMed] [CrossRef][Google Scholar]112.Yousaf M., Khan W.A., Shahzad K., Khan H.N., Ali B., Hussain M., Awan F.R., Mustafa H., Sheikh F.N. Genetic Association of Beta-Myosin Heavy-Chain Gene (MYH7) with Cardiac Dysfunction.Genes.2022;13:1554.  doi: 10.3390/genes13091554.[PMC free article][PubMed] [CrossRef][Google Scholar]113.Tudurachi B.S., Zăvoi A., Leonte A., Țăpoi L., Ureche C., Bîrgoan S.G., Chiuariu T., Anghel L., Radu R., Sascău R.A., et al. An Update on MYBPC3 Gene Mutation in Hypertrophic Cardiomyopathy.Int. J. Mol. Sci.2023;24:10510.  doi: 10.3390/ijms241310510.[PMC free article][PubMed] [CrossRef][Google Scholar]114.Velicki L., Jakovljevic D.G., Preveden A., Golubovic M., Bjelobrk M., Ilic A., Stojsic S., Barlocco F., Tefelmeier M., Okwose N., et al. Genetic determinants of clinical phenotype in hypertrophic cardiomyopathy.BMC Cardiovasc. Disord.2020;20:516.  doi: 10.1186/s12872-020-01807-4.[PMC free article][PubMed] [CrossRef][Google Scholar]115.Herrera-Rodríguez D.L., Totomoch-Serra A., Rosas-Madrigal S., Luna-Limón C., Marroquín-Ramírez D., Carnevale A., Rosendo-Gutiérrez R., Villarreal-Molina M.T., Márquez-Murillo M.F. Genes frequently associated with sudden death in primary hypertrophic cardiomyopathy.Arch. Cardiol. Mex.2020;90:58–68. doi: 10.24875/ACME.M20000085.[PubMed] [CrossRef][Google Scholar]116.Christensen A.H., Platonov P.G., Jensen H.K., Chivulescu M., Svensson A., Dahlberg P., Madsen T., Frederiksen T.C., Heliö T., Lie Ø.H., et al. Genotype-phenotype correlation in arrhythmogenic right ventricular cardiomyopathy-risk of arrhythmias and heart failure.J. Med. Genet.2022;59:858–864. doi: 10.1136/jmedgenet-2021-107911.[PubMed] [CrossRef][Google Scholar]117.Ploski R., Rydzanicz M., Ksiazczyk T.M., Franaszczyk M., Pollak A., Kosinska J., Michalak E., Stawinski P., Ziolkowska L., Bilinska Z.T., et al. Evidence for troponin C (TNNC1) as a gene for autosomal recessive restrictive cardiomyopathy with fatal outcome in infancy.Am. J. Med. Genet. A.2016;170:3241–3248. doi: 10.1002/ajmg.a.37860.[PubMed] [CrossRef][Google Scholar]118.Kaviarasan V., Mohammed V., Veerabathiran R. Genetic predisposition study of heart failure and its association with cardiomyopathy.Egypt. Heart J.2022;74:5. doi: 10.1186/s43044-022-00240-6.[PMC free article][PubMed] [CrossRef][Google Scholar]119.Maron M.S., Olivotto I., Maron B.J., Prasad S.K., Cecchi F., Udelson J.E., Camici P.G. The case for myocardial ischemia in hypertrophic cardiomyopathy.J. Am. Coll. Cardiol.2009;54:866–875. doi: 10.1016/j.jacc.2009.04.072.[PubMed] [CrossRef][Google Scholar]120.Cahill T.J., Ashrafian H., Watkins H. Genetic cardiomyopathies causing heart failure.Circ. Res.2013;113:660–675. doi: 10.1161/CIRCRESAHA.113.300282.[PubMed] [CrossRef][Google Scholar]121.Janjusevic M., Fluca A.L., Ferro F., Gagno G., D’Alessandra Y., Beltrami A.P., Sinagra G., Aleksova A. Traditional and Emerging Biomarkers in Asymptomatic Left Ventricular Dysfunction-Promising Non-Coding RNAs and Exosomes as Biomarkers in Early Phases of Cardiac Damage.Int. J. Mol. Sci.2021;22:4937.  doi: 10.3390/ijms22094937.[PMC free article][PubMed] [CrossRef][Google Scholar]122.Arbelo E., Protonotarios A., Gimeno J.R., Arbustini E., Barriales-Villa R., Basso C., Bezzina C.R., Biagini E., Blom N.A., de Boer R.A., et al. 2023 ESC Guidelines for the management of cardiomyopathies: Developed by the task force on the management of cardiomyopathies of the European Society of Cardiology (ESC)Eur. Heart J.2023;44:3503–3626. doi: 10.1093/eurheartj/ehad194.[PubMed] [CrossRef][Google Scholar]123.Zeppenfeld K., Tfelt-Hansen J., de Riva M., Winkel B.G., Behr E.R., Blom N.A., Charron P., Corrado D., Dagres N., de Chillou C., et al. 2022 ESC Guidelines for the management of patients with ventricular arrhythmias and the prevention of sudden cardiac death.Eur. Heart J.2022;43:3997–4126. doi: 10.1093/eurheartj/ehac262.[PubMed] [CrossRef][Google Scholar]124.Kumar S., Baldinger S.H., Gandjbakhch E., Maury P., Sellal J.M., Androulakis A.F., Waintraub X., Charron P., Rollin A., Richard P., et al. Long-term arrhythmic and nonarrhythmic outcomes of lamin A/C mutation carriers.J. Am. Coll. Cardiol.2016;68:2299–2307. doi: 10.1016/j.jacc.2016.08.058.[PubMed] [CrossRef][Google Scholar]125.Verstraelen T.E., van Lint F.H.M., Bosman L.P., de Brouwer R., Proost M.V., Abeln B.G.S., Taha K., Zwinderman A.H., Dickhoff C., Oomen T., et al. Prediction of ventricular arrhythmia in phospholamban p.Arg14del mutation carriersreaching the frontiers of individual risk prediction.Eur. Heart J.2021;42:2842–2850. doi: 10.1093/eurheartj/ehab294.[PMC free article][PubMed] [CrossRef][Google Scholar]126.[(accessed on 15 September 2023)].  Available online:https://lmna-risk-vta.fr127.Mirelis J.G., Escobar-Lopez L., Ochoa J.P., Espinosa M.Á., Villacorta E., Navarro M., Casas G., Mora-Ayestarán N., Barriales-Villa R., Mogollón-Jiménez M.V., et al. Combination of late gadolinium enhancement and genotype improves prediction of prognosis in non-ischaemic dilated cardiomyopathy.Eur. J. Heart Fail.2022;24:1183–1196.[PMC free article][PubMed][Google Scholar]128.Ader F., De Groote P., Réant P., Rooryck-Thambo C., Dupin-Deguine D., Rambaud C., Khraiche D., Perret C., Pruny J.F., Mathieu-Dramard M., et al. FLNC pathogenic variants in patients with cardiomyopathies: Prevalence and genotype-phenotype correlations.Clin. Genet.2019;96:317–329. doi: 10.1111/cge.13594.[PubMed] [CrossRef][Google Scholar]129.de Frutos F., Ochoa J., Navarro-Peñalver M., Peñalver M., Baas A., Bjerre J.V., Zorio E., Méndez I., Lorca R., Verdonschot J.A.J., et al. Natural History of MYH7-Related Dilated Cardiomyopathy.J. Am. Coll. Cardiol.2022;80:1447–1461. doi: 10.1016/j.jacc.2022.07.023.[PubMed] [CrossRef][Google Scholar]130.Gimeno J.R., Tomé-Esteban M., Lofiego C., Hurtado J., Pantazis A., Mist B., Lambiase P., McKenna W.J., Elliott P.M. Exercise-induced ventricular arrhythmias and risk of sudden cardiac death in patients with hypertrophic cardiomyopathy.Eur. Heart J.2009;30:2599–2605. doi: 10.1093/eurheartj/ehp327.[PubMed] [CrossRef][Google Scholar]131.[(accessed on 15 September 2023)].  Available online:https://qxmd.com/calculate/calculator_303/hcm-risk-scd132.Chan R.H., Maron B.J., Olivotto I., Pencina M.J., Azzenza G.E., Haas T., Lesser J.R., Gruner C., Crean A.M., Rakowski H., et al. Prognostic value of quantitative contrast-enhanced cardiovascular magnetic resonance for the evaluation of sudden death risk in patients with hypertrophic cardiomyopathy.Circulation.2014;130:484–495. doi: 10.1161/CIRCULATIONAHA.113.007094.[PubMed] [CrossRef][Google Scholar]133.Bhonsale A., Groeneweg J.A., James C.A., Dooijes D., Tichnell C., Jongbloed J.D., Murray B., te Riele A.S., van den Berg M.P., Bikker H., et al. Impact of genotype on clinical course in arrhythmogenic right ventricular dysplasia/ cardiomyopathy-associated mutation carriers.Eur. Heart J.2015;36:847–855. doi: 10.1093/eurheartj/ehu509.[PubMed] [CrossRef][Google Scholar]134.Lee J.H., Lee S.E., Cho M.C. Clinical Implication of Genetic Testing in Dilated Cardiomyopathy.Int. J. Heart Fail.2021;4:1–11. doi: 10.36628/ijhf.2021.0024.[PMC free article][PubMed] [CrossRef][Google Scholar]135.Bondue A., Arbustini E., Bianco A., Ciccarelli M., Dawson D., De Rosa M., Hamdani N., Hilfiker-Kleiner D., Meder B., Leite-Moreira A.F., et al. Complex roads from genotype to phenotype in dilated cardiomyopathy: Scientific update from the Working Group of Myocardial Function of the European Society of Cardiology.Cardiovasc. Res.2018;114:1287–1303. doi: 10.1093/cvr/cvy122.[PMC free article][PubMed] [CrossRef][Google Scholar]136.Escobar-Lopez L., Ochoa J.P., Mirelis J.G., Espinosa M.Á., Navarro M., Gallego-Delgado M., Barriales-Villa R., Robles-Mezcua A., Basurte-Elorz M.T., Gutiérrez García-Moreno L., et al. Association of Genetic Variants with Outcomes in patients with nonischemic dilated cardiomyopathy.J. Am. Coll. Cardiol.2021;78:1682–1699. doi: 10.1016/j.jacc.2021.08.039.[PubMed] [CrossRef][Google Scholar]137.Kamiya C.A., Yoshimatsu J., Ikeda T. Peripartum Cardiomyopathy From a Genetic Perspective.Circ. J.2016;80:1684–1688. doi: 10.1253/circj.CJ-16-0342.[PubMed] [CrossRef][Google Scholar]138.Cooper L.T., Jr., Čiháková D. Do Genes Influence Susceptibility to Myocarditis?JACC Basic. Transl. Sci.2021;6:593–594. doi: 10.1016/j.jacbts.2021.06.003.[PMC free article][PubMed] [CrossRef][Google Scholar]139.Fox C.S., Evans J.C., Larson M.G., Kannel W.B., Levy D. Temporal trends in coronary heart disease mortality and sudden cardiac death from 1950 to 1999: The Framingham Heart Study.Circulation.2004;110:522–527. doi: 10.1161/01.CIR.0000136993.34344.41.[PubMed] [CrossRef][Google Scholar]140.Lloyd-Jones D.M., Wilson P.W.F. Framingham risk score and prediction of lifetime risk for coronary heart disease.Am. J. Cardiol.2004;94:20–24. doi: 10.1016/j.amjcard.2004.03.023.[PubMed] [CrossRef][Google Scholar]141.Skrzynia C., Berg J.S., Willis M.S., Jensen B.C. Genetics and heart failure: A concise guide for the clinician.Curr. Cardiol. Rev.2015;11:10–17. doi: 10.2174/1573403X09666131117170446.[PMC free article][PubMed] [CrossRef][Google Scholar]142.Czepluch F.S., Wollnik B., Hasenfuß G. Genetic determinants of heart failure: Facts and numbers.ESC Heart Fail.2018;5:211–217. doi: 10.1002/ehf2.12267.[PMC free article][PubMed] [CrossRef][Google Scholar]143.Alfares A.A., Kelly M.A., McDermott G., Funke B.H., Lebo M.S., Baxter S.B., Shen J., McLaughlin H.M., Clark E.H., Babb L.J., et al. Results of clinical genetic testing of 2,912 probands with hypertrophic cardiomyopathy: Expanded panels offer limited additional sensitivity.Genet. Med.2015;17:880–888. doi: 10.1038/gim.2014.205.[PubMed] [CrossRef][Google Scholar]144.Bordet C., Brice S., Maupain C., Gandjbakhch E., Isidor B., Palmyre A., Moerman A., Toutain A., Akloul L., Brehin A.C., et al. Psychosocial impact of predictive genetic testing in hereditary heart diseases: The PREDICT study.J. Clin. Med.2020;9:1365.  doi: 10.3390/jcm9051365.[PMC free article][PubMed] [CrossRef][Google Scholar]145.Michie S., Marteau T.M., Bobrow M. Genetic counselling: The psychological impact of meeting patients’ expectations.J. Med. Genet.1997;34:237–241. doi: 10.1136/jmg.34.3.237.[PMC free article][PubMed] [CrossRef][Google Scholar]146.Charron P., Arad M., Arbustini E., Basso C., Bilinska Z., Elliott P., Helio T., Keren A., McKenna W.J., Monserrat L., et al. Genetic counselling and testing in cardiomyopathies: A position statement of the European Society of Cardiology Working Group on Myocardial and Pericardial Diseases.Eur. Heart J.2010;31:2715–2726. doi: 10.1093/eurheartj/ehq271.[PubMed] [CrossRef][Google Scholar]147.Borry P., Evers-Kiebooms G., Cornel M.C., Clarke A., Dierickx K. Public Professional Policy Committee (PPPC) of the European Society of Human Genetics (ESHG). Genetic testing in asymptomatic minors: Background considerations towards ESHG recommendations.Eur. J. Hum. Genet.2009;17:711–719. doi: 10.1038/ejhg.2009.25.[PMC free article][PubMed] [CrossRef][Google Scholar]148.Marey I., Fressart V., Rambaud C., Fornes P., Martin L., Grotto S., Alembik Y., Gorka H., Millat G., Gandjbakhch E., et al. Clinical impact of post-mortem genetic testing in cardiac death and cardiomyopathy.Open Med.2020;15:435–446. doi: 10.1515/med-2020-0150.[PMC free article][PubMed] [CrossRef][Google Scholar]",
        "reference_links__references": "",
        "reference__references": "",
        "disease": "heart failure"
    }
]